// ==UserScript==
// @name          Israel political right wing helper
// @namespace     http://mtk.co.il/moppy
// @description	  Discover who is who in the left wing Motty Katan(c) 13-08-2011 updated 05-10-2011
// @include       *
// ==/UserScript==
//Change Log:
//17-08-2011 added the new israeli fund names
//20-08-2011 DB update only
//25-08-2011 Added a small condition to avoid edge scenarios errors
//			 +DB update (Yesh Gvul)
//30-08-2011 Corrected bug in positioning the information+DB: SmolLeumi
//Disclaimer: this data cannot be used to determine political opinions, but to identify a person name to a specific group
//01-10-2011 +DB update (Omets Lesarev)
//05-10-2011 +DB update (Artist Letter+Tsedek Hevrati Center)

(function(){
if (window.document) {
	window.document.body.addEventListener("mouseup", processSelection, false);
	window.document.body.addEventListener("keyup", processSelection, false);
}
var sId = "idIsraelRightWingNameChecker";
oGenevaAccord = {
	sName : "יוזמת ז'נבה",
	sPeople : "קולט אביטל, חיים אורון, ישראלה אורון, עדי אלדר, שאול אריאלי, אריה ארנון, אברהם בורג, יוסי ביילין, גדי בלטיאנסקי, חיים בן-שחר, שלמה ברום, יוכי ברנדס, עוזי ברעם, דויד גלס, דויד גרוסמן, צביה גרינפילד, אבשלום וילן, עינת וילף, צביה ולדן, נעמי חזן, א.ב יהושע, יוסי יונה, איתן כבל, דב לאוטמן, אתי לבני, טליה לבני, שלמה להט, דניאל לוי, אמנון ליפקין שחק, עמרם מצנע, גדעון סאמט, איציק סודרי, עמוס עוז, גיורא ענבר, רון פונדק, אילן פז, אופיר פז-פינס, אבי פרימור, יצחק פרנקנטל, זאב צחור, מנחם קליין, דורון קדמיאל, דייב קמחי, בעז קרני, יהודית קציר, דליה רבין, אליק רון, נחמה רונן, מוסי רז, אלה שאינסקייה, זאב שטרנהל, דרור שטרנשוס , אליס שלוי, אברהם שלום, עליזה שנהר, גדעון שפר, אבי שקד, יונתן תובל, יולי תמיר",
	sUrl : "http://www.heskem.org.il/People.asp?id=5&pid=4"
};
oExpertsForTheProtest2011 = {
	sName : "צוות ייעוץ למחאת האוהלים",
	sPeople : "יוסי זעריה, אמילי סילברמן, איציק גלנור, יצחק קשתי, שי פירון, דני פילק, נדיה אסמעיל, מרדכי קרמניצר, בלהה דוידזון-ארד, יוסי יונה, אביה ספיבק, הלה אספניולי, עדינה בר שלום",
	sUrl : "http://rotter.net/forum/scoops1/31424.shtml"
};
oNewIsraeliFund = {
	sName : "הנהלת הקרן החדשה",
	sPeople : "פיטר אלדמן, נעמי חזן, דניאל סוקאץ', רחל ליאל, אליעזר יערי,נעם לאוטמן, סוזאן ליס, סטיבן גותנר, פיטר שפירו, יפעת ביטון, ג'ואן שפירו, דברה באסל, ג'ונתן כהן, שרה אוסצקי-לזר, גרי סרנט, פרנקלין פישר, מרי-אן סטיין, מרטין אינדיק, זאב ברגמן, נבילה אספניולי, אמל ג'מאל, הארייט מוצ'לי-וויס, ליסה אורליק-סלקה, דניאל סיגל, פיטר אדלמן, איציק גלנור, ניקולס ספיר, פול איגרמן",
	sUrl : "http://www.nif.org.il/board"
};
oNewIsraeliFundCouncil = {
	sName : "חברי המועצה הבינלאומית קרן החדשה לישראל",
	sPeople : "יהושע בר-לב, ג'ונתן פוקס, סנפורד גלנטר, לינדה גלנטר, ראקל ניומן, סטיוארט פולק, אדין סאקס, לילה סרנט, אינגריד טאובר, בוני טננבאום, וינסנט וורמס, שרה קאנון, ג'יימס קאמינגס, ראובן דורי, ריצ'ארד גאנטר, לויס גאנטר, לואיס ליינר, אביבה פוטוריאן, רוברט ליפטון, בטילו סלצמן, קרול סיגל, קארן אדלר, עוז בן-עמרם, אלן כהן, קרולין כהן, יהודה קון, רייצ'ל קוואן, ג'רום דוידסון, שלי פישל, בארי גייברמן, ברוס גולדברגר, פיליס גולדמן, סאלי גוטסמן, שרי גרינבך, ליז גרינסטיין, מייקל הירשהורן, ריצ'ארד ג'ייקובס, לסלי קימרלינג, שרה קליין, ג'ונתן קליין, דונאלד לנדיס, בטסי לנדיס, שלי לוין, בריאנה לינט, רולנדו מטלון, סינדי מילר, אהרון פנקן, קת'לין פרטיס, פאולה ראקוף, ארווין רוזנבלום, ננסי שוורץ-סטרנוף, גורדון טאקר, דיוויד אומנסקי, אגנס ואריס, אל וורספן, מייקל וולצר, קרול זבר, שרה ארמן, ג'ודית גלמן, ברברה ס. גרין, מרטין אינדיק, לינדה קליין, פיטר קובלר, טרי לנזנר, ג'ודית ליכטמן, אלן מלקולם, דיוויד סאפרסטיין, פרנק ווגל, מינדי ברמן, גבי בלום, פול אגרמן, ליאונרד פיין, אלינור פרידמן, ג'פרי גרין, ג'פרי לואיס, דייל מנוקין, רוברט מנוקין, בוני אורלין, משה ספדי, הארייט שלי, אלן סולומונט, פרודנס סטיינר, אלפרד טאובר, נורין סבלוצקי, לויס פרנק, ז'אן ליף, לואיס ניומן, בוץ' וויבר, סידרה אזרחי, דורותי הרמן,מישל אביטבול, אריה ארנון, אלי ברקת, מרדכי בר-און, אברום בורג, אבנר דה-שליט, רמי אנטין, עוזי אבן, סידרה אזרחי, לילי גלילי, רות גביזון, בני גידרון, עמירם גולדבלום, יסכה הרני, גלעד חריש, דורותי הרמן, שלמה חסון, נחמה הילמן, חיים יזרעאלי, מיכאל קריאני, יהודית קרפ, ידין קאופמן, מרדכי קרמניצר, דוד ליבאי, סמי מיכאל, יעקב נר-דוד, ישראלה אורון, יורם פרי, אלון פילץ, פרנסיס רדאי, טליה ששון, אורי שרף, אמנון סלע, חנן סרפוס, אלה שייאנסקיה, אליס שלוי, שמעון שמיר, עליזה שנהר, רות ששינסקי, ורדה שיפר, יונתן שמשוני, יואל סיגל, עמי וינשטיין, דן יקיר, אלכס יופה, דינה זיסרמן, נטע זיו",
	sUrl : "http://www.nif.org.il/board"
};
oMerets2011 = {
	sName : "התנועה החדשה מרץ 2011",
	sPeople : "חיים אורון, אילן גלאון, ניצן הורוביץ, זהבה גלאון, דרור מורג, , אבשלום וילן, מוסי רז, טליה ששון, צביה גרינפילד, , צלי רשף, עיסווי פריג', מיכל רוזין, אורי זכי, גבי לסקי, רועי פלד",
	sUrl : "http://www.myparty.org.il/aspx/members.aspx"
};
oPeaceNow = {
	sName : "שלום עכשיו",
	sPeople : "יריב אופנהיימר, איתי מזרב, דניאל בלומנשטיק, חן אגרי, חגית עופרן, לי וילסון, רוחלה מעין, לורן אייזן",
	sUrl : "http://www.peacenow.org.il/content/האנשים-הפועלים"
};
oShimonHatsadikAtsorim14May2010 = {
	sName : "נשפטו על הפגנה בשיח ג'ראח 2010",
	sPeople : "אריק וויד אשרמן, סהר ורדי, עמיאל דב ליאונלו ורדי, אסף שרון, אליקים נתן ניצני, סתוית סיני, מאיה יחיאלי, גיל גוטגליק, יוגב זוסמן, אייל רז אבידן, אדם ישי אמוראי, אסף מלמד קינצר",
	sUrl : "http://www.takdin.co.il/searchg/%D7%90%D7%A8%D7%99%D7%A7%20%D7%95%D7%99%D7%99%D7%93%20%D7%90%D7%A9%D7%A8%D7%9E%D7%9F%20%20%D7%9E%D7%93%D7%99%D7%A0%D7%AA%20%D7%99%D7%A9%D7%A8%D7%90%D7%9C_hd_0L38nDZ8vCLmvDZCrNtHjTIunC2veT6ri.html"
};
oYeshGvulVSLiberman = {
	sName : "יש גבול בתביעה שנדחתה נגד ליברמן 2009",
	sPeople : "יואב הס, מרדכי זלדון, מיכה רחמן, ישי מנוחין, פרץ קדרון",
	sUrl : "http://www.takdin.co.il/searchg/%D7%99%D7%95%D7%90%D7%91%20%D7%94%D7%A1%20%20%D7%97%D7%9B%20%D7%90%D7%91%D7%99%D7%92%D7%93%D7%95%D7%A8%20%D7%9C%D7%99%D7%91%D7%A8%D7%9E%D7%9F_hd_0L34sCpasD5mnE3GoDrzXT2umE2veT6ri.html"
};
oYeshGvul1989Forum = {
	sName : "פורום ארצי לתנועת יש גבול מתאריך 1989",
	sPeople : "חנוך לבנה, ישי מנוחין, אנג'לו איידן, ניב ברזילאי, מאיר עמור, אלי משולם, אלי גוזנסקי, מולי מלצר, בנגלבי רובי, מרדכי זלדון, רם רהט, רמי חסון, מייק לוין, אולי ברדוש, דבי ברדוש, דורון וילנר",
	sUrl : "http://israeli-left-archive.org/greenstone/collect/yeshgvul/index/assoc/HASH9b18.dir/890729.jpg"
};
//claimed to have built a zionist left front which includes:
//שלום עכשיו, תא אופק (אוניברסיטה העברית), מרץ, השומר הצעיר, המשמרת הצעירה, יוזמת ז'נבה)
oLeftNationalism = {
	sName : "השמאל הלאומי",
	sPeople : "אלדד יניב, גדי טאוב, שמואל הספרי",
	sUrl : "http://www.slideshare.net/smoleumi/ss-5434270"
};
oOmetsLesarevAcademic = {
	sName : "האומץ לסרב - תומכים אקדמאים",
	sPeople : "יאיר אביגדור, מיכל אביעד, אהרון אביתר, גיא אבן, ארנון אברון, צח אדם, עופר אהרוני, עדי אופיר, אירית אורבוך, יעקב אושמן, גרדה אילתה-אלסתר, זוהר איתן, גדי אלגזי, קלמן אלטמן, מירי אליאב-פלדון, יעל אמיתי, דוד אנוך, יהודה אנזל, בני ארבל, מירה אריאל, ענת אריאל, מרדכי אריאלי, אריה ארנון, יאיר בוימל, ויקטוריה בוך, רות בטלר, ענת בילצקי, מלאכי בית-אריה, בנימין בית-הלחמי, לואיז בית-לחם, דוד בלנק, מתניה בן-ארצי, נעמי בן-בסט, יוחנן בן-בסט, איל בן-דב, שמואל בן-דור, צבי בנטואיץ', שלמה בנטין, אבנר בן-עמוס, זיוה בן-פורת, סיגל בן-פורת, לינדה בן-צבי, גרשון בן-שחר, דני בן-שחר, שלום בר, יובל בר, ארז בראון, דן בר-און, יעל ברדה, עידו ברונו, יגאל ברונר, ז'וזה ברונר, מיכל ברושי בן-לוי, אורי בר-יוסף, מנחם ברינקר, רות ברמן, מיכאל ברנדייס, עופר ברנע, ענת ברנע, דבורה ברנשטיין, רון ברקאי, מישל ברקוביאר, אותי בת-אל, דוד גוגנהיים, יוסי גוטמן, עמירם גולדבלום, עודד גולדרייך, עפרה גולדשטיין-גדעוני, דפנה גולן, ניב גורדון, חיים גורדון, אילן גור-זאב, יובל גורן, עמית גזית, רחל גיורא, שמעונה גינצבורג, דוד גינתון, סנאית גיסיס, עופר גל, אברהם גל, חגי גלבוע, אמירה גלבלום, שוקה גלוטמן, אלי גלזנר, אבנר גלעדי, חיים גנז, יוסף גרודז'ינסקי, צ'רלס גרינבאום, לב גרינברג, ישראל גרשוני, דוד דגני, דניאל דה מלאך, מייק דהאן, אבנר דה-שליט, ענת דוד, בלהה דוידסון-הרד, פאני דולז`נסקי, דניאל דור, יצחק דינשטיין, סדרה דיקובן אזרחי, עתניאל דרור, טומי דרייפוס, דליה דרעי, אורי הדר, סילבי הוניגמן, ג'וליה הורבט, פיטר הילמן, קרולה הילפריך, אריאל הירשפלד, יורם הירשפלד, רות הכהן, דון הנדלמן, תלמה הנדלר, לנס הנטר, יעקב הסינג, אברהם הפנר, אלון הראל, אודי הרושובסקי, חנה הרצוג, זאב הרצוג, מרקוס ואסם, רועי וגנר, יוסף ווידינפלד, מינה ווילסון, אמנון וולמן, אביטל וולמן, שולה וולקוב, פול ווקסלר, ברונק ויינריב, ברק וייס, ורד ויניצקי, קרן וינר, עמיאל ורדי, ראובן זהבי, נטע זיו, עופר זיתוני, שלמה זנד, יוסי זעירא, ענת זעירא, דליה זקש, חנן חבר, ראובן חורש, גלית חזן-רוקם, מאיר חמו, יצחק חן, צבי טאובר, חוה יבלונקה, עירד יבנה, דפנה יואל, מיכאל יוגב, יובל יונאי, יוסי יונה, ניצה ינאי, עלי יסיף, רבקה יעקובי, חיים יעקובי, מנחם יערי, אורן יפתחאל, טלי יצחקי, רעיה כהן, ינון כהן, אריק כהן, דורית כהן, ג'רלד כהן, מיה כהן לוי, רון כוזר, חגי כנען, אורי כץ, רימון כשר, חנה כשר, יעקב כתריאל, תמר כתריאל, יצחק לאור, אורלי לובין, יונתה לוי, שמעון לוי, יוברט לו-יון, דפנה לויט, מרילו לוין, ג'ויס ליוינגסטון, אליה לייבוביץ, חררדו לייבנר, נתי ליניאל, דפנה למיש, ג'ון לנדאו, עידן לנדו, מיכה לשם, אורי מאור, סטפני מוזס, עוזי מוטרו, בן-ציון מוניץ, פנינה מוצפי-הלר, נילי מור, נאוה מורן, ענת מטר, יהודה מטרס, נינה מיורק, אמנון מייזלס, אריאל מירב, ז'נט מלכין, פאול מנדס-פלור, רות מנור, בצלאל מנקין, שמוליק מרקו, ג'אד נאמן, יצחק (יאני) נבו, ז'ק נגרה, חנה נוה, יוסף נוימן, דוד ניומן, יהודה ניני, ענת ניניו, יוסף ניר, רון נעמן, דורון נרקיס, גד נתן, אילן סבן, מירי סגל, צבי סולוב, מיכאל סולטמן, אורלי סוקר, אריה סיון, רוזלי סיטמן, דיאנה סילברמן קלר, טלי סילוני, איימי סינגר, אייבי סישל, רקפת סלע-שפי, עוזי סמילנסקי, דוד סנש, אנה ספרד, חנה ספרן, ראובן סרוסי, אמוץ עגנון, אברהם עוז, עובדיה עזרא, דניאל עמית, אהרון עצמון, רנה פוזננסקי, עמוס פיאט, איתמר פיטובסקי, תמר פיטרברג, עופר פיין, דני פילק, יורי פינס, עמית פינצ'בסקי, רוני פיסקר, מנחם פיש, שמואל פלג, עינת פלד, יואב פלד, נורית פלד-אלחנן, רבקה פלדחי, רומה פלק, רפאל פלק, נירה פנסר, צחי פרבר, עמנואל פרגון, אילנה פרדס, גדעון פרוידנטל, איתמר פרוקצ`יה, עדי פרוש, איריס פרוש, מוטי פרי, אהוד פרידגוט, דב פרידלנדיר, אריאלה פרידמן, ליאת פרידמן, אלון פרידמן, אליזבת פריונד, איריס פריי, מיכאל פריי, מיכל פרנס, חנן פרנק, מיכל פרנקל, רוני פרצ`ק, קובי פתר, איתמר צביק, משה צוקרמן, משה צימרמן, דודי צפתי, יעקב קאופמן, רונן קדמון, ג'ודי קופפרמן, יהודה קופפרמן, חגי קופרמינץ, אורנה קופרמן, רז קופרמן, בקי קוק, ליאו קורי, עמליה קוריאט, נורה קורין-לנגר, שושנה קייני, חנן קיש, גיל קליין, אביעד קליינברג, דבורה קלקין-פישמן, נפתלי קמינסקי, שמואל קפלן, סם קפלן, ענת קציר, אילנה קראוזמן, ורד קראוס, סטיב קרליש, שרון קרן, מיכאל קרן, דני רבינוביץ, אמיתי רגב, טובה רוזן, זאב רוזנהק, הנרי רוזנפלד, שרון רוטברד, ורד רום-קידר, דנה רון, משה רון, אביהו רונן, פרדי רוקם, דניאל רורליך, זאב רותם, צבי רזי, אמנון רז-קרקוצקין, יעקב ריטוב, אילנה ריטוב, דני ריטר, רענן ריין, טניה ריינהרט, אלחנן ריינר, חגי רם, אורי רם, איציק רנרט, ג'וליה רסניק, עדנה שביט, עוזי שביט, אהרון שבתאי, עידן שגב, ערן שדך, אילנה שוהמי, דורית שוויקי, ניטה שוחט, מנשה שויד, אברהם שוייגר, דוד שולמן, זאב שטיין, זאב שטרנהל, נעמי שיר, טוביה שלונסקי, גדעון שלח, ליאון שלף, רונן שמיר, ישעיהו שן, יהודה שנהב, בני שנון, אורלי שנקר, שמאי שפייזר, אריה שפירא, דני שפרוך, ינון שרים, מוריס תובל, אילן תורן",
	sUrl : "http://www.seruv.org.il/Hebrew/academic_supporters.asp"
};
oTsedekHevrati2011 = {
	sName : "מרכז ישראלי לקידום צדק חברתי - ועד מנהל",
	sPeople : "חגית חובב, סמדר אלחנני, יובל אליצור, נפתלי ארנון, עלי בלום, איריס בן-דוד הדר, ג'וני גל, ניהאיה דאוד, מילכה דונחין, רמה זוטא, מוחמד חאג'-יחיא, אברהם חולי, עזיז חיידר, נתן חסון, מאיר חת, רימון לביא, מקס לבנת, ענת מאור, תמי מולד-חיו, דן סואן, משה סיקרון, רבקה סנה, ברוך עובדיה, מרדכי פרנקל, בן-עמי צוקרמן, יוסף קטן, יונה רוזנלפד, חיים רוט, נפתלי  רוטנברג, רות שטייניץ, שמואל שי, מריו שכטמן, דוד שמעוני, דליה שפרינצק, מאיר תמרי",
	sUrl : "http://www.socialjustice.org.il/content2.php?actions=show&id=5226&r_id=5225"
};
oArtistsLetter2011 = {
	sName : "מכתב האמנים - נגד הופעה באריאל",
	sPeople : "חנה מרון, דויד גרוסמן, עודד קוטלר, יהושע סובול, אופירה הניג, שמואל הספרי, לאורה ריבלין, דורי פרנס, גדליה בסר, מיכאל רונן, עידו ריקלין, שרי גוטמן, יאיר גרבוז, אמנון מסקין, אוהד נהרין, איתן פוקס, גלעד עברון, אלון גרבוז, דורון צברי, דני קרמן, אבנר כץ, שמעון לוי, גד קינר, אפרת מישורי, שמעון בוזגלו, דורון רבינא, ג'קי שמש, מאיה ערד, דורי מנור, ארי רמז, אמיר אוריין, דוד שטיינברג, ורדית שלפי",
	sUrl : "http://www.news-israel.net/Article.asp?Code=23310"	
};


aoDB = new Array(oGenevaAccord, 
				 oExpertsForTheProtest2011, 
				 oNewIsraeliFund, 
				 oNewIsraeliFundCouncil, 
				 oMerets2011,
				 oPeaceNow,
				 oShimonHatsadikAtsorim14May2010,
				 oYeshGvulVSLiberman,
				 oYeshGvul1989Forum,
				 oLeftNationalism,
				 oOmetsLesarevAcademic,
				 oTsedekHevrati2011,
				 oArtistsLetter2011); 
function checkSelection(oEvent)
{
	sName = "";
    if (document.activeElement && document.activeElement.value) {
        var sVal = document.activeElement.value;
        sName = sVal.substring (document.activeElement.selectionStart, 
                                  document.activeElement.selectionEnd);
    } else {
        sName = window.getSelection().toString();       
    }
    return sName;
}

function stripHebrewNikud(sName)
{
	sNewName = "";
	for(var i=0;i<sName.length;i++){
		if (sName.charCodeAt(i) < 1425 || sName.charCodeAt(i) > 1476) {
			sNewName += sName.charAt(i); 		
		}
	}
	return sNewName;
}
//save all the names
var asMatchesGlobal = new Array();
function checkName(oCfg, sName)
{
	sReturnHTML = "";
	sQueryNames = oCfg.sPeople.replace(/([^,]+)(?:, )?/g,"($1)|");
	sQueryNames = sQueryNames.substr(0, sQueryNames.length-1);	
	oRegExp = new RegExp(sQueryNames, "g");
	sName = stripHebrewNikud(sName);
	var asMatches = sQueryNames.split("|");
	for (var i=0;i<asMatches.length;i++){
		asMatchesGlobal[asMatches[i]] = true;
	}
	asMatches = new Array();
	i=0;
	while(asResults = oRegExp.exec(sName)){		
		if (!asMatches[asResults[0]]){
			asMatches[i++] = asResults[0]; 	
		}
		asMatches[asResults[0]] = true;				
	}
	sMatchedNames = asMatches.join(', '); 
    if (sMatchedNames) {
    	sReturnHTML = "<a href='"+oCfg.sUrl+"'>"+oCfg.sName+"</a> ("+sMatchedNames+")<br/>"; 
	}
	return sReturnHTML;    
}

function processSelection(oEvent)
{
	sName = checkSelection(oEvent);
	if (document.getElementById(sId)){
  		document.getElementById(sId).style.visibility = "hidden";    		
	}	 
    if (sName) {
    	sHTML = "";
    	for (var i=0;i<aoDB.length;i++)
		{
			sHTML += checkName(aoDB[i], sName); 
		}
		
		var nTotalNames = 0;
		for (s in asMatchesGlobal){
			nTotalNames++;		
		}
		//GM_log("database names:"+nTotalNames);
		if (nTotalNames>=10000){
			GM_log("database must not reach 10000 names");
		}else if (sHTML.length){	
			//display the results  			
			if (!document.getElementById(sId)){
				oDiv = document.createElement("div");
				oDiv.id = sId;	
				oDiv.style.position = "absolute";
				oDiv.style.backgroundColor = "white";
				oDiv.style.border = "1px solid black";
				oDiv.style.zIndex = "50000";
				unsafeWindow.document.body.appendChild(oDiv);
			}else {
				oDiv = document.getElementById(sId);
			}
					
			nScrollTop = (document.body.scrollTop) ? document.body.scrollTop : document.documentElement.scrollTop; 	                                     
			oDiv.style.top = nScrollTop + oEvent.clientY+"px";			 
			oDiv.style.left = document.body.scrollLeft+oEvent.clientX+"px";					
			oDiv.innerHTML = sHTML;
			oDiv.style.visibility = "visible";
		}
	}

}
})();