// ==UserScript==
// @name           uni_hwm_hunt_exp
// @description    HWM Mod - Hunt Experience Universal (2013.12.31)
// @homepage       http://userscripts.org/scripts/show/150393
// @author         Manten (Add ElMarado) //Њ ­вн­
// @version        1.65
// @namespace      heroeswm
// @include        http://178.248.235.15/group_wars.php*
// @include        http://178.248.235.15/home.php*
// @include        http://178.248.235.15/map.php*
// @include        http://*.heroeswm.*/group_wars.php*
// @include        http://*.heroeswm.*/home.php*
// @include        http://*.heroeswm.*/map.php*
// ==/UserScript==

var koef = 1;
var max_exp = 0;
var version = '1.65';
var sectors =	{
		"cx=50&cy=50":1,		//Empire Capital      
		"cx=51&cy=50":2,                //East River          
		"cx=50&cy=49":3,                //Tiger Lake          
		"cx=51&cy=49":4,                //Rogues' Wood          
		"cx=50&cy=51":5,                //Wolf Dale           
		"cx=50&cy=48":6,                //Peaceful Camp       
		"cx=49&cy=51":7,                //Lizard Lowland      
		"cx=49&cy=50":8,                //Green Wood          
		"cx=49&cy=48":9,                //Eagle Nest          
		"cx=50&cy=52":10,               //Portal Ruins        
		"cx=51&cy=51":11,               //Dragon Caves        
		"cx=49&cy=49":12,               //Shining Spring      
		"cx=48&cy=49":13,               //Sunny Sity          
		"cx=52&cy=50":14,               //Magma Mines         
		"cx=52&cy=49":15,               //Bear Mountain      
		"cx=52&cy=48":16,               //Fairy Trees         
		"cx=53&cy=50":17,               //Port City           
		"cx=53&cy=49":18,               //Mithril Coast       
		"cx=51&cy=52":19,               //GreatWall           
		"cx=51&cy=53":20,               //Titans' Valley      
		"cx=52&cy=53":21,               //Fishing Village     
		"cx=52&cy=54":22,               //Kingdom Capital     
		"cx=48&cy=48":23,               //Ungovernable Steppe 
		"cx=51&cy=48":24,               //Crystal Garden      
		"cx=53&cy=52":25,               //East Island         
		"cx=49&cy=52":26                //The Wilderness           
		}
var mob_exp = {peasant:5,conscript:7,brute:6,archer:15,marksman:19,crossman:19,footman:17,squire:21,vindicator:20,griffon:59,impergriffin:62,battlegriffon:62,priest:101,inquisitor:121,zealot:121,cavalier:232,paladin:262,champion:252,angel:330,archangel:390,seraph2:390,
               skeleton:6,skeletonarcher:10,skmarksman:12,sceletonwar:10,zombie:11,plaguezombie:15,rotzombie:17,ghost:26,spectre:26,poltergeist:27,cursed:30,vampire:68,vampirelord:70,vampireprince:70,lich:87,archlich:110,masterlich:100,wight:165,wraith:205,banshee:205,bonedragon:280,spectraldragon:310,ghostdragon:310,dgolem:329,dgolemup:400,
               gremlin:5,mastergremlin:9,saboteurgremlin:9,stone_gargoyle:16,obsgargoyle:26,elgargoly:25,iron_golem:33,steelgolem:54,magneticgolem:57,mage:63,archmage:70,djinn:103,djinn_sultan:110,rakshasa_rani:155,rakshasa_raja:160,colossus:350,titan:400,
               pixel:12,sprite:20,dryad:20,dancer:20,wardancer:33,wdancer:33,elf:38,masterhunter:42,arcaneelf:42,druid:74,druideld:101,unicorn:124,silverunicorn:135,treant:187,ancienent:210,greendragon:350,emeralddragon:400,
               goblin:5,hobgoblin:9,wolfrider:20,wolfraider:31,orc:29,orcchief:38,ogre:60,ogremagi:74,rocbird:104,thunderbird:115,cyclop:172,cyclopking:182,behemoth:350,ancientbehemoth:390,
               goblinarcher:10,goblinmag:9,boarrider:31,orcshaman:33,orcrubak:38,ogrebrutal:75,firebird:117,darkbird:120,cyclopod:187,dbehemoth:410,
               scout:20,assassin:33,maiden:30,fury:49,bloodsister:49,minotaur:39,minotaurguard:56,taskmaster:56,darkrider:65,grimrider:94,briskrider:94,hydra:108,deephydra:115,shadow_witch:157,matriarch:185,shadowdragon:350,blackdragon:400,
               imp:6,familiar:10,vermin:10,horneddemon:14,hornedoverseer:23,jdemon:16,hellhound:33,cerberus:41,hotdog:30,succubus:61,succubusmis:67,seducer:65,hellcharger:136,nightmare:145,hellkon:101,pitfiend:157,pitlord:195,pity:157,devil:245,archdevil:311,archdemon:312,
               defender:7,shieldguard:12,mountaingr:24,spearwielder:11,skirmesher:17,bearrider:24,blackbearrider:36,brawler:27,berserker:42,runepriest:59,runepatriarch:100,thane:131,thunderlord:162,firedragon:255,magmadragon:329,
               enforcer:10,mercarcher:15,mercfootman:25,battlegriffin:45,mercwizard:35,swolf:20,bear:22,smalllizard:13,lizard:25,redlizard:30,thiefmage:35,thiefwarrior:35,thiefarcher:35,water:57,air:59,earth:63,fire:60,
	       spider:15,spiderpois:30,harpy:29,harpyhag:45,beholder:33,evileye:33,kamneed:56,kamnegryz:67,troll:150,blacktroll:180,siren:60,upsiren:70,seamonster:120,upseamonster:140,leviathan:250,upleviathan:300,wfassault:10,
	       mummy:115,pharaoh:153,blackknight:160,deadknight:190,gogachi:13,megogachi:16,efreeti:200,rapukk:200,efreetisultan:250,zhryak:290,eviltiger2010:110,evilcat:45,evilbunny:130,gorynych:50,evilsnake:45,phoenix:600,
	       goblinus:5,trapper:15,fcentaur:13,ncentaur:20,mcentaur:21,warrior:21,mauler:23,warmong:36,shamaness:66,eadaughter:72,sdaughter:75,slayer:70,executioner:83,chieftain:100,wyvern:170,foulwyvern:195,cyclopus:390,bloodeyecyc:500,untamedcyc:700
};
var mob_rus_exp = {
		"\u0410\u0434\u0435\u043f\u0442\u044b":121,                                                                                               //Ђ¤ҐЇвл;
		"\u0410\u0434\u0441\u043a\u0438\u0435 \u0436\u0435\u0440\u0435\u0431\u0446\u044b":136,                                                    //Ђ¤бЄЁҐ ¦ҐаҐЎжл;
		"\u0410\u0434\u0441\u043a\u0438\u0435 \u0436\u043d\u0435\u0446\u044b":290,                                                                //Ђ¤бЄЁҐ ¦­Ґжл;
		"\u0410\u0434\u0441\u043a\u0438\u0435 \u043f\u0441\u044b":33,                                                                             //Ђ¤бЄЁҐ Їбл;
		"\u0410\u043d\u0433\u0435\u043b\u044b":330,                                                                                               //Ђ­ЈҐ«л;
		"\u0410\u0440\u0431\u0430\u043b\u0435\u0442\u0447\u0438\u043a\u0438":19,                                                                  //ЂаЎ «ҐвзЁЄЁ;
		"\u0410\u0440\u0445\u0430\u043d\u0433\u0435\u043b\u044b":390,                                                                             //Ђае ­ЈҐ«л;
		"\u0410\u0440\u0445\u0438\u0434\u0435\u043c\u043e\u043d\u044b":312,                                                                       //ЂаеЁ¤Ґ¬®­л;
		"\u0410\u0440\u0445\u0438\u0434\u044c\u044f\u0432\u043e\u043b\u044b":311,                                                                 //ЂаеЁ¤мпў®«л;
		"\u0410\u0440\u0445\u0438\u043b\u0438\u0447\u0438":110,                                                                                   //ЂаеЁ«ЁзЁ;
		"\u0410\u0440\u0445\u0438\u043c\u0430\u0433\u0438":70,                                                                                    //ЂаеЁ¬ ЈЁ;
		"\u0410\u0441\u0441\u0430\u0441\u0438\u043d\u044b":33,                                                                                    //Ђбб бЁ­л;
		"\u0410\u0441\u0442\u0440\u0430\u043b\u044c\u043d\u044b\u0435 \u0434\u0440\u0430\u043a\u043e\u043d\u044b":310,                            //Ђбва «м­лҐ ¤а Є®­л;
		"\u0411\u0430\u043d\u044c\u0448\u0438":205,                                                                                               //Ѓ ­миЁ;
		"\u0411\u0435\u0433\u0435\u043c\u043e\u0442\u044b":350,                                                                                   //ЃҐЈҐ¬®вл;
		"\u0411\u0435\u0440\u0441\u0435\u0440\u043a\u0438":42,                                                                                    //ЃҐабҐаЄЁ;
		"\u0411\u0435\u0441\u0442\u0438\u0438":30,                                                                                                //ЃҐбвЁЁ;
		"\u0411\u0435\u0441\u044b":6,                                                                                                             //ЃҐбл;
		"\u0411\u0435\u0445\u043e\u043b\u0434\u0435\u0440\u044b":33,                                                                              //ЃҐе®«¤Ґал;
		"\u0411\u043e\u0435\u0432\u044b\u0435 \u0433\u0440\u0438\u0444\u043e\u043d\u044b":45,                                                     //Ѓ®ҐўлҐ ЈаЁд®­л;
		"\u0411\u043e\u0435\u0432\u044b\u0435 \u0435\u0434\u0438\u043d\u043e\u0440\u043e\u0433\u0438":135,                                        //Ѓ®ҐўлҐ Ґ¤Ё­®а®ЈЁ;
		"\u0411\u043e\u0435\u0432\u044b\u0435 \u043a\u0435\u043d\u0442\u0430\u0432\u0440\u044b":21,                                               //Ѓ®ҐўлҐ ЄҐ­в ўал;
		"\u0411\u044b\u0447\u043e\u043a 2009":0,                                                                                                  //Ѓлз®Є 2009;
		"\u0412\u0430\u043c\u043f\u0438\u0440\u044b":68,                                                                                          //‚ ¬ЇЁал;
		"\u0412\u0430\u0440\u043c\u043e\u043d\u0433\u0435\u0440\u044b":36,                                                                        //‚ а¬®­ЈҐал;
		"\u0412\u0435\u0434\u044c\u043c\u044b-\u043f\u0440\u0438\u0437\u0440\u0430\u043a\u0438":30,                                               //‚Ґ¤м¬л-ЇаЁ§а ЄЁ;
		"\u0412\u0435\u043b\u0438\u043a\u0438\u0435 \u043b\u0435\u0432\u0438\u0430\u0444\u0430\u043d\u044b":300,                                  //‚Ґ«ЁЄЁҐ «ҐўЁ д ­л;
		"\u0412\u0435\u0440\u0445\u043e\u0432\u043d\u044b\u0435 \u0434\u0440\u0443\u0438\u0434\u044b":101,                                        //‚Ґае®ў­лҐ ¤агЁ¤л;
		"\u0412\u0435\u0441\u0442\u043d\u0438\u043a\u0438 \u0441\u043c\u0435\u0440\u0442\u0438":205,                                              //‚Ґбв­ЁЄЁ б¬ҐавЁ;
		"\u0412\u0438\u0432\u0435\u0440\u043d\u044b":170,                                                                                         //‚ЁўҐа­л;
		"\u0412\u043b\u0430\u0434\u044b\u0447\u0438\u0446\u044b \u0442\u0435\u043d\u0438":185,                                                    //‚« ¤лзЁжл вҐ­Ё;
		"\u0412\u043e\u0434\u043d\u044b\u0435 \u044d\u043b\u0435\u043c\u0435\u043d\u0442\u0430\u043b\u0438":57,                                   //‚®¤­лҐ н«Ґ¬Ґ­в «Ё;
		"\u0412\u043e\u0436\u0430\u043a\u0438":100,                                                                                               //‚®¦ ЄЁ;
		"\u0412\u043e\u0437\u0434\u0443\u0448\u043d\u044b\u0435 \u044d\u043b\u0435\u043c\u0435\u043d\u0442\u0430\u043b\u0438":59,                 //‚®§¤ги­лҐ н«Ґ¬Ґ­в «Ё;
		"\u0412\u043e\u0438\u043d\u044b-\u043d\u0430\u0451\u043c\u043d\u0438\u043a\u0438":25,                                                     //‚®Ё­л-­ с¬­ЁЄЁ;
		"\u0412\u043e\u0438\u0442\u0435\u043b\u0438":12,                                                                                          //‚®ЁвҐ«Ё;
		"\u0412\u043e\u0440\u044b-\u043a\u043e\u043b\u0434\u0443\u043d\u044b":35,                                                                 //‚®ал-Є®«¤г­л;
		"\u0412\u043e\u0440\u044b-\u0440\u0430\u0437\u0432\u0435\u0434\u0447\u0438\u043a\u0438":35,                                               //‚®ал-а §ўҐ¤зЁЄЁ;
		"\u0412\u043e\u0440\u044b-\u0443\u0431\u0438\u0439\u0446\u044b":35,                                                                       //‚®ал-гЎЁ©жл;
		"\u0412\u044b\u0441\u0448\u0438\u0435 \u0430\u043d\u0433\u0435\u043b\u044b":390,                                                          //‚лбиЁҐ  ­ЈҐ«л;
		"\u0412\u044b\u0441\u0448\u0438\u0435 \u0432\u0430\u043c\u043f\u0438\u0440\u044b":70,                                                     //‚лбиЁҐ ў ¬ЇЁал;
		"\u0412\u044b\u0441\u0448\u0438\u0435 \u043b\u0438\u0447\u0438":100,                                                                      //‚лбиЁҐ «ЁзЁ;
		"\u0413\u0430\u0440\u043f\u0438\u0438":29,                                                                                                //ѓ аЇЁЁ;
		"\u0413\u0430\u0440\u043f\u0438\u0438-\u0432\u0435\u0434\u044c\u043c\u044b":45,                                                           //ѓ аЇЁЁ-ўҐ¤м¬л;
		"\u0413\u0438\u0433\u0430\u043d\u0442\u0441\u043a\u0438\u0435 \u044f\u0449\u0435\u0440\u044b":25,                                         //ѓЁЈ ­вбЄЁҐ пйҐал;
		"\u0413\u0438\u0434\u0440\u044b":108,                                                                                                     //ѓЁ¤ал;
		"\u0413\u043b\u0443\u0431\u043e\u043a\u043e\u0432\u043e\u0434\u043d\u044b\u0435 \u0447\u0435\u0440\u0442\u0438":140,                      //ѓ«гЎ®Є®ў®¤­лҐ зҐавЁ;
		"\u0413\u043d\u0438\u044e\u0449\u0438\u0435 \u0437\u043e\u043c\u0431\u0438":17,                                                           //ѓ­ЁойЁҐ §®¬ЎЁ;
		"\u0413\u043e\u0431\u043b\u0438\u043d\u044b":5,                                                                                           //ѓ®Ў«Ё­л;
		"\u0413\u043e\u0431\u043b\u0438\u043d\u044b-\u043b\u0443\u0447\u043d\u0438\u043a\u0438":10,                                               //ѓ®Ў«Ё­л-«гз­ЁЄЁ;
		"\u0413\u043E\u0431\u043B\u0438\u043D\u044B-\u043C\u0430\u0433\u0438":9,                                               			  //ѓ®Ў«Ё­л-¬ ЈЁ;
		"\u0413\u043e\u0431\u043b\u0438\u043d\u044b-\u0442\u0440\u0430\u043f\u043f\u0435\u0440\u044b":15,                                         //ѓ®Ў«Ё­л-ва ЇЇҐал;
		"\u0413\u043e\u0433\u0438":13,                                                                                                            //ѓ®ЈЁ;
		"\u0413\u043e\u043b\u0435\u043c\u044b \u0441\u043c\u0435\u0440\u0442\u0438":329,                                                          //ѓ®«Ґ¬л б¬ҐавЁ;
		"\u0413\u043e\u043b\u043e\u0432\u043e\u0440\u0435\u0437\u044b":6,                                                                         //ѓ®«®ў®аҐ§л;
		"\u0413\u043e\u0440\u043d\u044b\u0435 \u0441\u0442\u0440\u0430\u0436\u0438":12,                                                           //ѓ®а­лҐ бва ¦Ё;
		"\u0413\u0440\u0435\u043c\u043b\u0438\u043d\u044b":5,                                                                                     //ѓаҐ¬«Ё­л;
		"\u0413\u0440\u0435\u043c\u043b\u0438\u043d\u044b-\u0432\u0440\u0435\u0434\u0438\u0442\u0435\u043b\u0438":9,                              //ѓаҐ¬«Ё­л-ўаҐ¤ЁвҐ«Ё;
		"\u0413\u0440\u0438\u0444\u043e\u043d\u044b":59,                                                                                          //ѓаЁд®­л;
		"\u0413\u0440\u043e\u043c\u043e\u0432\u0435\u0440\u0436\u0446\u044b":162,                                                                 //ѓа®¬®ўҐа¦жл;
		"\u0414\u0435\u043c\u043e\u043d\u0435\u0441\u0441\u044b":67,                                                                              //„Ґ¬®­Ґббл;
		"\u0414\u0435\u0442\u0451\u043d\u044b\u0448\u0438 \u044f\u0449\u0435\u0440\u0430":13,                                                     //„Ґвс­лиЁ пйҐа ;
		"\u0414\u0436\u0438\u043d\u043d\u044b":103,                                                                                               //„¦Ё­­л;
		"\u0414\u0436\u0438\u043d\u043d\u044b \u0441\u0443\u043b\u0442\u0430\u043d\u044b":110,                                                    //„¦Ё­­л бг«в ­л;
		"\u0414\u043e\u0447\u0435\u0440\u0438 \u0437\u0435\u043c\u043b\u0438":72,                                                                 //„®зҐаЁ §Ґ¬«Ё;
		"\u0414\u043e\u0447\u0435\u0440\u0438 \u043d\u0435\u0431\u0430":75,                                                                       //„®зҐаЁ ­ҐЎ ;
		"\u0414\u0440\u0435\u0432\u043d\u0438\u0435 \u0431\u0435\u0433\u0435\u043c\u043e\u0442\u044b":390,                                        //„аҐў­ЁҐ ЎҐЈҐ¬®вл;
		"\u0414\u0440\u0435\u0432\u043d\u0438\u0435 \u044d\u043d\u0442\u044b":210,                                                                //„аҐў­ЁҐ н­вл;
		"\u0414\u0440\u0438\u0430\u0434\u044b":20,                                                                                                //„аЁ ¤л;
		"\u0414\u0440\u0443\u0438\u0434\u044b":74,                                                                                                //„агЁ¤л;
		"\u0414\u0443\u0445\u0438":27,                                                                                                            //„геЁ;
		"\u0414\u044c\u044f\u0432\u043e\u043b\u044b":245,                                                                                         //„мпў®«л;
		"\u0414\u044c\u044f\u0432\u043e\u043b\u044f\u0442\u0430":10,                                                                              //„мпў®«пв ;
		"\u0415\u0434\u0438\u043d\u043e\u0440\u043e\u0433\u0438":124,                                                                             //…¤Ё­®а®ЈЁ;
		"\u0416\u0435\u043b\u0435\u0437\u043d\u044b\u0435 \u0433\u043e\u043b\u0435\u043c\u044b":33,                                               //†Ґ«Ґ§­лҐ Ј®«Ґ¬л;
		"\u0416\u0440\u0435\u0446\u044b \u0440\u0443\u043d":59,                                                                                   //†аҐжл аг­;
		"\u0417\u0430\u0449\u0438\u0442\u043d\u0438\u043a\u0438 \u0432\u0435\u0440\u044b":20,                                                     //‡ йЁв­ЁЄЁ ўҐал;
		"\u0417\u0430\u0449\u0438\u0442\u043d\u0438\u043a\u0438 \u0433\u043e\u0440":7,                                                            //‡ йЁв­ЁЄЁ Ј®а;
		"\u0417\u0435\u043b\u0451\u043d\u044b\u0435 \u0434\u0440\u0430\u043a\u043e\u043d\u044b":350,                                              //‡Ґ«с­лҐ ¤а Є®­л;
		"\u0417\u0435\u043c\u043d\u044b\u0435 \u044d\u043b\u0435\u043c\u0435\u043d\u0442\u0430\u043b\u0438":63,                                   //‡Ґ¬­лҐ н«Ґ¬Ґ­в «Ё;
		"\u0417\u043b\u0430\u044f \u043a\u0440\u044b\u0441\u0430 2008":0,                                                                         //‡« п Єалб  2008;
		"\u0417\u043b\u043e\u0431\u043d\u044b\u0435 \u0433\u043b\u0430\u0437\u0430":33,                                                           //‡«®Ў­лҐ Ј« § ;
		"\u0417\u043b\u043e\u0439 \u0433\u043e\u0440\u044b\u043d\u044b\u0447 2012":50,                                                            //‡«®© ѓ®ал­лз 2012;
		"\u0417\u043B\u0430\u044F \u0417\u043C\u0435\u044F 2013":45,			                                                          //‡« п ‡¬Ґп 2013;
		"\u0417\u043b\u043e\u0439 \u043a\u043e\u0442\u0438\u043a 2011":45,                                                                        //‡«®© Є®вЁЄ 2011;
		"\u0417\u043b\u043e\u0439 \u043a\u0440\u043e\u043b\u044f 2011":130,                                                                       //‡«®© Єа®«п 2011;
		"\u0417\u043b\u043e\u0439 \u0442\u0438\u0433\u0440 2010":110,                                                                             //‡«®© вЁЈа 2010;
		"\u0417\u043e\u043c\u0431\u0438":11,                                                                                                      //‡®¬ЎЁ;
		"\u0418\u0437\u0443\u043c\u0440\u0443\u0434\u043d\u044b\u0435 \u0434\u0440\u0430\u043a\u043e\u043d\u044b":400,                            //€§г¬аг¤­лҐ ¤а Є®­л;
		"\u0418\u043c\u043f\u0435\u0440\u0441\u043a\u0438\u0435 \u0433\u0440\u0438\u0444\u043e\u043d\u044b":62,                                   //€¬ЇҐабЄЁҐ ЈаЁд®­л;
		"\u0418\u043d\u043a\u0432\u0438\u0437\u0438\u0442\u043e\u0440\u044b":121,                                                                 //€­ЄўЁ§Ёв®ал;
		"\u0418\u0441\u043a\u0443\u0441\u0438\u0442\u0435\u043b\u044c\u043d\u0438\u0446\u044b":65,                                                //€бЄгбЁвҐ«м­Ёжл;
		"\u0418\u0444\u0440\u0438\u0442\u044b":200,                                                                                               //€даЁвл;
		"\u0418\u0444\u0440\u0438\u0442\u044b \u0441\u0443\u043b\u0442\u0430\u043d\u044b":250,                                                    //€даЁвл бг«в ­л;
		"\u041a\u0430\u043c\u0435\u043d\u043d\u044b\u0435 \u0433\u043e\u0440\u0433\u0443\u043b\u044c\u0438":16,                                   //Љ ¬Ґ­­лҐ Ј®аЈг«мЁ;
		"\u041a\u0430\u043c\u043d\u0435\u0433\u0440\u044b\u0437\u044b":67,                                                                        //Љ ¬­ҐЈал§л;
		"\u041a\u0430\u043c\u043d\u0435\u0435\u0434\u044b":45,                                                                                    //Љ ¬­ҐҐ¤л;
		"\u041a\u0435\u043d\u0442\u0430\u0432\u0440\u044b":13,                                                                                    //ЉҐ­в ўал;
		"\u041a\u043d\u044f\u0437\u044c\u044f \u0432\u0430\u043c\u043f\u0438\u0440\u043e\u0432":70,                                               //Љ­п§мп ў ¬ЇЁа®ў;
		"\u041a\u043e\u043b\u043e\u0441\u0441\u044b":350,                                                                                         //Љ®«®ббл;
		"\u041a\u043e\u043d\u0438 \u043f\u0440\u0435\u0438\u0441\u043f\u043e\u0434\u043d\u0435\u0439":101,                                        //Љ®­Ё ЇаҐЁбЇ®¤­Ґ©;
		"\u041a\u043e\u0441\u0442\u043e\u043b\u043e\u043c\u044b":27,                                                                              //Љ®бв®«®¬л;
		"\u041a\u043e\u0441\u0442\u044f\u043d\u044b\u0435 \u0434\u0440\u0430\u043a\u043e\u043d\u044b":280,                                        //Љ®бвп­лҐ ¤а Є®­л;
		"\u041a\u043e\u0447\u0435\u0432\u044b\u0435 \u043a\u0435\u043d\u0442\u0430\u0432\u0440\u044b":20,                                         //Љ®зҐўлҐ ЄҐ­в ўал;
		"\u041a\u043e\u0448\u043c\u0430\u0440\u044b":145,                                                                                         //Љ®и¬ ал;
		"\u041a\u0440\u0435\u0441\u0442\u044c\u044f\u043d\u0435":5,                                                                               //ЉаҐбвмп­Ґ;
		"\u041a\u0440\u043e\u0432\u0430\u0432\u044b\u0435 \u044f\u0449\u0435\u0440\u044b":30,                                                     //Ља®ў ўлҐ пйҐал;
		"\u041a\u0440\u043e\u0432\u043e\u0433\u043b\u0430\u0437\u044b\u0435 \u0446\u0438\u043a\u043b\u043e\u043f\u044b":500,                      //Ља®ў®Ј« §лҐ жЁЄ«®Їл;
		"\u041b\u0430\u0437\u0443\u0442\u0447\u0438\u043a\u0438":20,                                                                              //‹ §гвзЁЄЁ;
		"\u041b\u0430\u0442\u043d\u0438\u043a\u0438":21,                                                                                          //‹ в­ЁЄЁ;
		"\u041b\u0435\u0432\u0438\u0430\u0444\u0430\u043d\u044b":250,                                                                             //‹ҐўЁ д ­л;
		"\u041b\u0435\u0441\u043d\u044b\u0435 \u0441\u043d\u0430\u0439\u043f\u0435\u0440\u044b":42,                                               //‹Ґб­лҐ б­ ©ЇҐал;
		"\u041b\u0438\u0447\u0438":87,                                                                                                            //‹ЁзЁ;
		"\u041b\u0443\u0447\u043d\u0438\u043a\u0438":15,                                                                                          //‹гз­ЁЄЁ;
		"\u041c\u0430\u0433\u0438":63,                                                                                                            //Њ ЈЁ;
		"\u041c\u043e\u0433\u0438\u043b\u044c\u043d\u044b\u0435 \u0433\u043e\u043b\u0435\u043c\u044b":400,                                        //Њ®ЈЁ«м­лҐ Ј®«Ґ¬л;
		"\u041c\u0430\u0433\u043c\u0430 \u0434\u0440\u0430\u043a\u043e\u043d\u044b":329,                                                          //Њ Ј¬  ¤а Є®­л;
		"\u041c\u0430\u0433\u043d\u0438\u0442\u043d\u044b\u0435 \u0433\u043e\u043b\u0435\u043c\u044b":57,                                         //Њ Ј­Ёв­лҐ Ј®«Ґ¬л;
		"\u041c\u0430\u0433\u043e\u0433\u0438":16,                                                                                                //Њ Ј®ЈЁ;
		"\u041c\u0430\u0441\u0442\u0435\u0440\u0430 \u043a\u043e\u043f\u044c\u044f":17,                                                           //Њ бвҐа  Є®Їмп;
		"\u041c\u0430\u0441\u0442\u0435\u0440\u0430 \u043b\u0443\u043a\u0430":42,                                                                 //Њ бвҐа  «гЄ ;
		"\u041c\u0435\u0433\u0435\u0440\u044b":49,                                                                                                //ЊҐЈҐал;
		"\u041c\u0435\u0434\u0432\u0435\u0434\u0438":22,                                                                                          //ЊҐ¤ўҐ¤Ё;
		"\u041c\u0435\u0442\u0430\u0442\u0435\u043b\u0438 \u043a\u043e\u043f\u044c\u044f":11,                                                     //ЊҐв вҐ«Ё Є®Їмп;
		"\u041c\u0438\u043d\u043e\u0442\u0430\u0432\u0440\u044b":39,                                                                              //ЊЁ­®в ўал;
		"\u041c\u0438\u043d\u043e\u0442\u0430\u0432\u0440\u044b \u0441\u0442\u0440\u0430\u0436\u0438":56,                                         //ЊЁ­®в ўал бва ¦Ё;
		"\u041c\u0438\u043d\u043e\u0442\u0430\u0432\u0440\u044b-\u043d\u0430\u0434\u0441\u043c\u043e\u0442\u0440\u0449\u0438\u043a\u0438":56,     //ЊЁ­®в ўал-­ ¤б¬®вайЁЄЁ;
		"\u041c\u043e\u043d\u0430\u0445\u0438":101,                                                                                               //Њ®­ еЁ;
		"\u041c\u043e\u0440\u0441\u043a\u0438\u0435 \u0447\u0435\u0440\u0442\u0438":120,                                                          //Њ®абЄЁҐ зҐавЁ;
		"\u041c\u0443\u043c\u0438\u0438":115,                                                                                                     //Њг¬ЁЁ;
		"\u041c\u0443\u043c\u0438\u0438 \u0444\u0430\u0440\u0430\u043e\u043d\u043e\u0432":153,                                                    //Њг¬ЁЁ д а ®­®ў;
		"\u041c\u044f\u0442\u0435\u0436\u043d\u0438\u043a\u0438":10,                                                                              //ЊпвҐ¦­ЁЄЁ;
		"\u041d\u0430\u0435\u0437\u0434\u043d\u0438\u043a\u0438 \u043d\u0430 \u0432\u043e\u043b\u043a\u0430\u0445":20,                            //Ќ Ґ§¤­ЁЄЁ ­  ў®«Є е;
		"\u041d\u0430\u0435\u0437\u0434\u043d\u0438\u043a\u0438 \u043d\u0430 \u043a\u0430\u0431\u0430\u043d\u0430\u0445":31,                      //Ќ Ґ§¤­ЁЄЁ ­  Є Ў ­ е;
		"\u041d\u0430\u0435\u0437\u0434\u043d\u0438\u043a\u0438 \u043d\u0430 \u043c\u0435\u0434\u0432\u0435\u0434\u044f\u0445":24,                //Ќ Ґ§¤­ЁЄЁ ­  ¬Ґ¤ўҐ¤пе;
		"\u041d\u0430\u0435\u0437\u0434\u043d\u0438\u043a\u0438 \u043d\u0430 \u044f\u0449\u0435\u0440\u0430\u0445":65,                            //Ќ Ґ§¤­ЁЄЁ ­  пйҐа е;
		"\u041d\u0430\u043b\u0451\u0442\u0447\u0438\u043a\u0438 \u043d\u0430 \u0432\u043e\u043b\u043a\u0430\u0445":31,                            //Ќ «свзЁЄЁ ­  ў®«Є е;
		"\u041d\u0438\u043c\u0444\u044b":20,                                                                                                      //ЌЁ¬дл;
		"\u041e\u0431\u0441\u0438\u0434\u0438\u0430\u043d\u043e\u0432\u044b\u0435 \u0433\u043e\u0440\u0433\u0443\u043b\u044c\u0438":26,           //ЋЎбЁ¤Ё ­®ўлҐ Ј®аЈг«мЁ;
		"\u041e\u0433\u043d\u0435\u043d\u043d\u044b\u0435 \u0433\u043e\u043d\u0447\u0438\u0435":30,                                               //ЋЈ­Ґ­­лҐ Ј®­зЁҐ;
		"\u041e\u0433\u043d\u0435\u043d\u043d\u044b\u0435 \u0434\u0435\u043c\u043e\u043d\u044b":23,                                               //ЋЈ­Ґ­­лҐ ¤Ґ¬®­л;
		"\u041e\u0433\u043d\u0435\u043d\u043d\u044b\u0435 \u0434\u0440\u0430\u043a\u043e\u043d\u044b":255,                                        //ЋЈ­Ґ­­лҐ ¤а Є®­л;
		"\u041E\u0433\u043D\u0435\u043D\u043D\u044B\u0435 \u043F\u0442\u0438\u0446\u044B":117,                                        		  //ЋЈ­Ґ­­лҐ ЇвЁжл;
		"\u041e\u0433\u043d\u0435\u043d\u043d\u044b\u0435 \u044d\u043b\u0435\u043c\u0435\u043d\u0442\u0430\u043b\u0438":60,                       //ЋЈ­Ґ­­лҐ н«Ґ¬Ґ­в «Ё;
		"\u041e\u0433\u0440\u044b":60,                                                                                                            //ЋЈал;
		"\u041e\u0433\u0440\u044b \u043c\u0430\u0433\u0438":74,                                                                                   //ЋЈал ¬ ЈЁ;
		"\u041E\u0433\u0440\u044B-\u0432\u0435\u0442\u0435\u0440\u0430\u043D\u044B":75,                                                           //ЋЈал-ўҐвҐа ­л;
		"\u041e\u043f\u043e\u043b\u0447\u0435\u043d\u0446\u044b":7,                                                                               //ЋЇ®«зҐ­жл;             -
		"\u041e\u0440\u043a\u0438":29,                                                                                                            //ЋаЄЁ;
		"\u041e\u0440\u043a\u0438 \u0432\u043e\u0436\u0434\u0438":38,                                                                             //ЋаЄЁ ў®¦¤Ё;
		"\u041E\u0440\u043A\u0438-\u0442\u0438\u0440\u0430\u043D\u044B":38,                                                                       //ЋаЄЁ-вЁа ­л;
		"\u041E\u0440\u043A\u0438-\u0448\u0430\u043C\u0430\u043D\u044B":33,                                                                       //ЋаЄЁ-и ¬ ­л;
		"\u041f\u0430\u043b\u0430\u0434\u0438\u043d\u044b":262,                                                                                   //Џ « ¤Ё­л;
		"\u041f\u0430\u043b\u0430\u0447\u0438":83,                                                                                                //Џ « зЁ;
		"\u041f\u0430\u0443\u043a\u0438":15,                                                                                                      //Џ гЄЁ;
		"\u041f\u0435\u0445\u043e\u0442\u0438\u043d\u0446\u044b":17,                                                                              //ЏҐе®вЁ­жл;
		"\u041f\u0435\u0449\u0435\u0440\u043d\u044b\u0435 \u0432\u043b\u0430\u0434\u044b\u043a\u0438":195,                                        //ЏҐйҐа­лҐ ў« ¤лЄЁ;
		"\u041f\u0435\u0449\u0435\u0440\u043d\u044b\u0435 \u0433\u0438\u0434\u0440\u044b":115,                                                    //ЏҐйҐа­лҐ ЈЁ¤ал;
		"\u041f\u0435\u0449\u0435\u0440\u043d\u044b\u0435 \u0434\u0435\u043c\u043e\u043d\u044b":157,                                              //ЏҐйҐа­лҐ ¤Ґ¬®­л;
		"\u041f\u0435\u0449\u0435\u0440\u043d\u044b\u0435 \u043e\u0442\u0440\u043e\u0434\u044c\u044f":157,                                        //ЏҐйҐа­лҐ ®ва®¤мп;
		"\u041f\u0440\u0438\u0432\u0438\u0434\u0435\u043d\u0438\u044f":26,                                                                        //ЏаЁўЁ¤Ґ­Ёп;
		"\u041f\u0440\u0438\u0437\u0440\u0430\u043a\u0438":26,                                                                                    //ЏаЁ§а ЄЁ;
		"\u041f\u0440\u0438\u0437\u0440\u0430\u0447\u043d\u044b\u0435 \u0434\u0440\u0430\u043a\u043e\u043d\u044b":310,                            //ЏаЁ§а з­лҐ ¤а Є®­л;
		"\u041f\u0440\u0438\u043d\u0446\u0435\u0441\u0441\u044b \u0440\u0430\u043a\u0448\u0430\u0441":155,                                        //ЏаЁ­жҐббл а Єи б;
		"\u041f\u0440\u043e\u0432\u043e\u0440\u043d\u044b\u0435 \u043d\u0430\u0435\u0437\u0434\u043d\u0438\u043a\u0438":94,                       //Џа®ў®а­лҐ ­ Ґ§¤­ЁЄЁ;
		"\u041f\u0442\u0438\u0446\u044b \u0433\u0440\u043e\u043c\u0430":115,                                                                      //ЏвЁжл Ја®¬ ;
		"\u041F\u0442\u0438\u0446\u044B \u0442\u044C\u043C\u044B":120,                                                                      	  //ЏвЁжл вм¬л;
		"\u0420\u0430\u0434\u0436\u0438 \u0440\u0430\u043a\u0448\u0430\u0441":160,                                                                //ђ ¤¦Ё а Єи б;
		"\u0420\u043e\u0433\u0430\u0442\u044b\u0435 \u0434\u0435\u043c\u043e\u043d\u044b":14,                                                     //ђ®Ј влҐ ¤Ґ¬®­л;
		"\u0420\u043e\u0433\u0430\u0442\u044b\u0435 \u0436\u043d\u0435\u0446\u044b":200,                                                          //ђ®Ј влҐ ¦­Ґжл;
		"\u0420\u043e\u043a\u0438":104,                                                                                                           //ђ®ЄЁ;
		"\u0420\u044b\u0446\u0430\u0440\u0438":232,                                                                                               //ђлж аЁ;
		"\u0420\u044b\u0446\u0430\u0440\u0438 \u0441\u043c\u0435\u0440\u0442\u0438":190,                                                          //ђлж аЁ б¬ҐавЁ;
		"\u0420\u044b\u0446\u0430\u0440\u0438 \u0442\u044c\u043c\u044b":160,                                                                      //ђлж аЁ вм¬л;
		"\u0421\u0432\u0438\u0440\u0435\u043F\u044B\u0435 \u0431\u0435\u0433\u0435\u043C\u043E\u0442\u044B":410,                                  //‘ўЁаҐЇлҐ ЎҐЈҐ¬®вл;
		"\u0421\u0438\u0440\u0435\u043d\u044b":60,                                                                                                //‘ЁаҐ­л;
		"\u0421\u0438\u0440\u0435\u043d\u044b-\u0438\u0441\u043a\u0443\u0441\u0438\u0442\u0435\u043b\u044c\u043d\u0438\u0446\u044b":70,           //‘ЁаҐ­л-ЁбЄгбЁвҐ«м­Ёжл;
		"\u0421\u043a\u0435\u043b\u0435\u0442\u044b":6,                                                                                           //‘ЄҐ«Ґвл;
		"\u0421\u043a\u0435\u043b\u0435\u0442\u044b-\u0432\u043e\u0438\u043d\u044b":10,                                                           //‘ЄҐ«Ґвл-ў®Ё­л;
		"\u0421\u043a\u0435\u043b\u0435\u0442\u044b-\u0430\u0440\u0431\u0430\u043b\u0435\u0442\u0447\u0438\u043a\u0438":12,                       //‘ЄҐ«Ґвл- аЎ «ҐвзЁЄЁ;
		"\u0421\u043a\u0435\u043b\u0435\u0442\u044b-\u043b\u0443\u0447\u043d\u0438\u043a\u0438":10,                                               //‘ЄҐ«Ґвл-«гз­ЁЄЁ;
		"\u0421\u0442\u0430\u043b\u044c\u043d\u044b\u0435 \u0433\u043e\u043b\u0435\u043c\u044b":54,                                               //‘в «м­лҐ Ј®«Ґ¬л;
		"\u0421\u0442\u0430\u0440\u0435\u0439\u0448\u0438\u043d\u044b \u0440\u0443\u043d":100,                                                    //‘в аҐ©иЁ­л аг­;
		"\u0421\u0442\u0430\u0440\u0448\u0438\u0435 \u0433\u0440\u0435\u043c\u043b\u0438\u043d\u044b":9,                                          //‘в аиЁҐ ЈаҐ¬«Ё­л;
		"\u0421\u0442\u0430\u0440\u0448\u0438\u0435 \u0434\u0435\u043c\u043e\u043d\u044b":16,                                                     //‘в аиЁҐ ¤Ґ¬®­л;
		"\u0421\u0442\u0435\u043f\u043d\u044b\u0435 \u0431\u043e\u0439\u0446\u044b":23,                                                           //‘вҐЇ­лҐ Ў®©жл;
		"\u0421\u0442\u0435\u043f\u043d\u044b\u0435 \u0432\u043e\u0438\u043d\u044b":21,                                                           //‘вҐЇ­лҐ ў®Ё­л;
		"\u0421\u0442\u0435\u043f\u043d\u044b\u0435 \u0432\u043e\u043b\u043a\u0438":20,                                                           //‘вҐЇ­лҐ ў®«ЄЁ;
		"\u0421\u0442\u0435\u043f\u043d\u044b\u0435 \u0433\u043e\u0431\u043b\u0438\u043d\u044b":5,                                                //‘вҐЇ­лҐ Ј®Ў«Ё­л;
		"\u0421\u0442\u0435\u043f\u043d\u044b\u0435 \u0446\u0438\u043a\u043b\u043e\u043f\u044b":390,                                              //‘вҐЇ­лҐ жЁЄ«®Їл;
		"\u0421\u0432\u0438\u043d\u044c\u044f 2007 \u0433\u043e\u0434\u0430":0,                                                                   //‘ўЁ­мп 2007 Ј®¤ ;
		"\u0421\u0432\u043e\u0431\u043e\u0434\u043d\u044b\u0435 \u0446\u0438\u043a\u043b\u043e\u043f\u044b":700,                                  //‘ў®Ў®¤­лҐ жЁЄ«®Їл;
		"\u0421\u0442\u0438\u0445\u0438\u0439\u043d\u044b\u0435 \u0433\u043e\u0440\u0433\u0443\u043b\u044c\u0438":25,                             //‘вЁеЁ©­лҐ Ј®аЈг«мЁ;
		"\u0421\u0442\u0440\u0435\u043b\u043a\u0438":19,                                                                                          //‘ваҐ«ЄЁ;
		"\u0421\u0442\u0440\u0435\u043b\u043a\u0438-\u043d\u0430\u0451\u043c\u043d\u0438\u043a\u0438":15,                                         //‘ваҐ«ЄЁ-­ с¬­ЁЄЁ;
		"\u0421\u0443\u043a\u043a\u0443\u0431\u044b":61,                                                                                          //‘гЄЄгЎл;
		"\u0421\u0443\u043c\u0435\u0440\u0435\u0447\u043d\u044b\u0435 \u0432\u0435\u0434\u044c\u043c\u044b":157,                                  //‘г¬ҐаҐз­лҐ ўҐ¤м¬л;
		"\u0421\u0443\u043c\u0435\u0440\u0435\u0447\u043d\u044b\u0435 \u0434\u0440\u0430\u043a\u043e\u043d\u044b":350,                            //‘г¬ҐаҐз­лҐ ¤а Є®­л;
		"\u0422\u0430\u043d\u0446\u0443\u044e\u0449\u0438\u0435 \u0441 \u0432\u0435\u0442\u0440\u043e\u043c":33,                                  //’ ­жгойЁҐ б ўҐва®¬;
		"\u0422\u0430\u043d\u0446\u0443\u044e\u0449\u0438\u0435 \u0441 \u043a\u043b\u0438\u043d\u043a\u0430\u043c\u0438":20,                      //’ ­жгойЁҐ б Є«Ё­Є ¬Ё;
		"\u0422\u0430\u043d\u0446\u0443\u044e\u0449\u0438\u0435 \u0441\u043e \u0441\u043c\u0435\u0440\u0442\u044c\u044e":33,                      //’ ­жгойЁҐ б® б¬Ґавмо;
		"\u0422\u0430\u043d\u044b":131,                                                                                                           //’ ­л;
		"\u0422\u0451\u043c\u043d\u044b\u0435 \u0432\u0438\u0432\u0435\u0440\u043d\u044b":195,                                                    //’с¬­лҐ ўЁўҐа­л;
		"\u0422\u0451\u043c\u043d\u044b\u0435 \u0432\u0441\u0430\u0434\u043d\u0438\u043a\u0438":94,                                               //’с¬­лҐ ўб ¤­ЁЄЁ;
		"\u0422\u0438\u0442\u0430\u043d\u044b":400,                                                                                               //’Ёв ­л;
		"\u0422\u0440\u043e\u043b\u043b\u0438":150,                                                                                               //’а®««Ё;
		"\u0423\u0431\u0438\u0439\u0446\u044b":70,                                                                                                //“ЎЁ©жл;
		"\u0423\u043c\u0435\u0440\u0442\u0432\u0438\u044f":165,                                                                                   //“¬ҐавўЁп;
		"\u0424\u0435\u0438":12,                                                                                                                  //”ҐЁ;
		"\u0424\u0435\u043d\u0438\u043a\u0441\u044b":600,                                                                                         //”Ґ­ЁЄбл;
		"\u0424\u0443\u0440\u0438\u0438":49,                                                                                                      //”гаЁЁ;
		"\u0425\u043e\u0431\u0433\u043e\u0431\u043b\u0438\u043d\u044b":9,                                                                         //•®ЎЈ®Ў«Ё­л;
		"\u0425\u043e\u0437\u044f\u0435\u0432\u0430 \u043c\u0435\u0434\u0432\u0435\u0434\u0435\u0439":36,                                         //•®§пҐў  ¬Ґ¤ўҐ¤Ґ©;
		"\u0426\u0435\u0440\u0431\u0435\u0440\u044b":41,                                                                                          //–ҐаЎҐал;
		"\u0426\u0438\u043a\u043b\u043e\u043f\u044b":172,                                                                                         //–ЁЄ«®Їл;
		"\u0426\u0438\u043a\u043b\u043e\u043f\u044b \u043a\u043e\u0440\u043e\u043b\u0438":182,                                                    //–ЁЄ«®Їл Є®а®«Ё;
		"\u0426\u0438\u043A\u043B\u043E\u043F\u044B-\u0433\u0435\u043D\u0435\u0440\u0430\u043B\u044B":187,                                        //–ЁЄ«®Їл-ЈҐ­Ґа «л;
		"\u0427\u0430\u0440\u043e\u0434\u0435\u0438-\u043d\u0430\u0451\u043c\u043d\u0438\u043a\u0438":35,                                         //— а®¤ҐЁ-­ с¬­ЁЄЁ;
		"\u0427\u0435\u043c\u043f\u0438\u043e\u043d\u044b":252,                                                                                   //—Ґ¬ЇЁ®­л;
		"\u0427\u0451\u0440\u043d\u044b\u0435 \u0434\u0440\u0430\u043a\u043e\u043d\u044b":400,                                                    //—са­лҐ ¤а Є®­л;
		"\u0427\u0435\u0440\u043d\u044b\u0435 \u0442\u0440\u043e\u043b\u043b\u0438":180,                                                          //—Ґа­лҐ ва®««Ё;
		"\u0427\u0435\u0440\u0442\u0438":10,                                                                                                      //—ҐавЁ;
		"\u0427\u0443\u043c\u043d\u044b\u0435 \u0437\u043e\u043c\u0431\u0438":15,                                                                 //—г¬­лҐ §®¬ЎЁ;
		"\u0428\u0430\u043c\u0430\u043d\u043a\u0438":66,                                                                                          // ¬ ­ЄЁ;
		"\u0428\u0442\u0443\u0440\u043c\u043e\u0432\u0438\u043a\u0438":10,                                                                        //вга¬®ўЁЄЁ;
		"\u0428\u0442\u0443\u0440\u043c\u043e\u0432\u044b\u0435 \u0433\u0440\u0438\u0444\u043e\u043d\u044b":62,                                   //вга¬®ўлҐ ЈаЁд®­л;
		"\u042d\u043b\u044c\u0444\u0438\u0439\u0441\u043a\u0438\u0435 \u043b\u0443\u0447\u043d\u0438\u043a\u0438":38,                             //ќ«мдЁ©бЄЁҐ «гз­ЁЄЁ;
		"\u042d\u043d\u0442\u044b":187,                                                                                                           //ќ­вл;
		"\u042f\u0434\u043e\u0432\u0438\u0442\u044b\u0435 \u043f\u0430\u0443\u043a\u0438":30                                                      //џ¤®ўЁвлҐ Ї гЄЁ;
};
var url_cur  = location.href;
var url_home = "home.php";
var url_map  = "map.php";
var url_war  = "group_wars.php";
var url_1_home = "www.heroeswm.ru/home.php";
var url_1_map  = "www.heroeswm.ru/map.php";
var url_1_war  = "www.heroeswm.ru/group_wars.php";
var url_2_home = "178.248.235.15/home.php";
var url_2_map  = "178.248.235.15/map.php";
var url_2_war  = "178.248.235.15/group_wars.php";
var url_3_home = "qrator.heroeswm.ru/home.php";
var url_3_map  = "qrator.heroeswm.ru/map.php";
var url_3_war  = "qrator.heroeswm.ru/group_wars.php";
var all_tables = document.getElementsByTagName('table');
//********************
var str_pl_lvl		= ustring("Ѓ®Ґў®© га®ўҐ­м: ");
var str_sum_exp		= ustring("‡  ­Ёе ¤ ¤гв <B> STR1 </B> ®Їлв .  Џ®в®¬ Ёе бв ­Ґв (~STR6 ив).");
var str_kill_now	= ustring("“ЎҐ© бҐ©з б! Ќ  STR9 га®ў­Ґ §  ­Ёе ¤ ¤гв <B> STR10 </B> ®Їлв .");
var str_hlp_exp		= ustring("‡  гЎЁ©бвў® б Ї®¬®й­ЁЄ®¬ (50/50) ‚ ¬ ¤ ¤гв <B> STR2 </B> ®Їлв . ‚ б«Ґ¤гойЁ© а § ЇаҐ¤«®¦ в (~STR7 ив).");
var str_min_kol		= ustring("„«п Min (~5%) ЇаЁа®бв  ­ ¤® гЎЁвм ­Ґ Ў®«ҐҐ STR3 ив (STR4 ®Їлв ). ‚ б«Ґ¤гойЁ© а § ЇаҐ¤«®¦ в (~STR8 ив).");
var str_exp_helper	= ustring("ЋЇлв Ї®¬®й­ЁЄ : [70..133]*“а®ўҐ­м*Ќ Ўа ­­ п г¬Є *[1.1-‡Ґ«мҐ].");
var str_min_kills	= ustring("„«п Ї®«гзҐ­Ёп 1 г¬Ґ­Ёп ¤®бв в®з­® гЎЁвм STR5 бгйҐбвў (STR1 ®Їлв )");
var str_all_kills	= ustring("„«п Ї®«гзҐ­Ёп 1 г¬Ґ­Ёп ­Ґ®Ўе®¤Ё¬® гЎЁвм ўбҐе бгйҐбвў (STR1 ®Їлв )");
//********************
var enable_Exp_Half   	= GM_getValue("enable_Exp_Half"  , true);
var enable_5_procent  	= GM_getValue("enable_5_procent" , false);
var enable_05_Umka    	= GM_getValue("enable_05_Umka"   , false);
var enable_Exp_Helper 	= GM_getValue("enable_Exp_Helper", false);
var show_only_Gud_ExpUm = GM_getValue("show_only_Gud_ExpUm", true);
var alarm_Green_Hunt	= GM_getValue("alarm_Green_Hunt", false);
//****************************************************


/** ЃЁЎ«Ё®вҐЄ  о­ЁЄ®¤ 
*
* ђҐ «Ё§гҐв дг­ЄжЁЁ а Ў®вл б о­ЁЄ®¤®¬.
* @file lib_unicode.js
* @version 1.1.0
* @author DrunkenStranger
* @link http://userscripts.org/users/362572
* @license GPL
*/
function uchar(s) {
    switch (s[0]) {
        case "Ђ": return "\u0410";
        case "Ѓ": return "\u0411";
        case "‚": return "\u0412";
        case "ѓ": return "\u0413";
        case "„": return "\u0414";
        case "…": return "\u0415";
        case "†": return "\u0416";
        case "‡": return "\u0417";
        case "€": return "\u0418";
        case "‰": return "\u0419";
        case "Љ": return "\u041a";
        case "‹": return "\u041b";
        case "Њ": return "\u041c";
        case "Ќ": return "\u041d";
        case "Ћ": return "\u041e";
        case "Џ": return "\u041f";
        case "ђ": return "\u0420";
        case "‘": return "\u0421";
        case "’": return "\u0422";
        case "“": return "\u0423";
        case "”": return "\u0424";
        case "•": return "\u0425";
        case "–": return "\u0426";
        case "—": return "\u0427";
        case "": return "\u0428";
        case "™": return "\u0429";
        case "љ": return "\u042a";
        case "›": return "\u042b";
        case "њ": return "\u042c";
        case "ќ": return "\u042d";
        case "ћ": return "\u042e";
        case "џ": return "\u042f";
        case " ": return "\u0430";
        case "Ў": return "\u0431";
        case "ў": return "\u0432";
        case "Ј": return "\u0433";
        case "¤": return "\u0434";
        case "Ґ": return "\u0435";
        case "¦": return "\u0436";
        case "§": return "\u0437";
        case "Ё": return "\u0438";
        case "©": return "\u0439";
        case "Є": return "\u043a";
        case "«": return "\u043b";
        case "¬": return "\u043c";
        case "­": return "\u043d";
        case "®": return "\u043e";
        case "Ї": return "\u043f";
        case "а": return "\u0440";
        case "б": return "\u0441";
        case "в": return "\u0442";
        case "г": return "\u0443";
        case "д": return "\u0444";
        case "е": return "\u0445";
        case "ж": return "\u0446";
        case "з": return "\u0447";
        case "и": return "\u0448";
        case "й": return "\u0449";
        case "к": return "\u044a";
        case "л": return "\u044b";
        case "м": return "\u044c";
        case "н": return "\u044d";
        case "о": return "\u044e";
        case "п": return "\u044f";
        case "р": return "\u0401";
        case "с": return "\u0451";
        default: return s[0];
    }
}

function ustring(s) {
    s = String(s);
    var result = "";
    for (var i = 0; i < s.length; i++)
        result += uchar(s[i]);
    return result;
}


/** ЃЁЎ«Ё®вҐЄ  б®ЎлвЁ©
*
* ђҐ «Ё§гҐв Єа®ббЎа г§Ґа­л© ¬Ґе ­Ё§¬ а Ў®вл б б®ЎлвЁп¬Ё.
* @file lib_event.js
* @version 1.1.0
* @author DrunkenStranger
* @link http://userscripts.org/users/362572
* @license GPL
*/

/** ‘®ЎлвЁҐ
* 
* ђҐ «Ё§ жЁп Єа®ббЎа г§Ґа­®Ј® ¬Ґе ­Ё§¬  а Ў®вл б б®ЎлвЁп¬Ё.
* @link http://javascript.ru/tutorial/events/crossbrowser
*/
Event = (function() {
    var guid = 0;
        
    function fixEvent(event) {
        event = event || window.event;
        
        if (event.isFixed)
            return event;
        event.isFixed = true;
        
        event.preventDefault = event.preventDefault || function() {this.returnValue = false;};
        event.stopPropagation = event.stopPropagaton || function() {this.cancelBubble = true;};
        
        if (!event.target)
            event.target = event.srcElement;
        
        if (!event.relatedTarget && event.fromElement)
            event.relatedTarget = event.fromElement == event.target ? event.toElement : event.fromElement;
        
        if (event.pageX == null && event.clientX != null) {
            var html = document.documentElement, body = document.body;
            event.pageX = event.clientX + (html && html.scrollLeft || body && body.scrollLeft || 0) - (html.clientLeft || 0);
            event.pageY = event.clientY + (html && html.scrollTop || body && body.scrollTop || 0) - (html.clientTop || 0);
        }
        
        if (!event.which && event.button)
            event.which = (event.button & 1 ? 1 : (event.button & 2 ? 3 : (event.button & 4 ? 2 : 0)));
        
        return event
    }    
    
    /* ‚л§лў Ґвбп ў Є®­вҐЄбвҐ н«Ґ¬Ґ­в  ўбҐЈ¤  this = element */
    function commonHandle(event) {
        event = fixEvent(event);
        
        var handlers = this.events[event.type];
        for (var g in handlers) {
            var handler = handlers[g];
            var ret = handler.call(this, event);
            if (ret === false) {
                event.preventDefault();
                event.stopPropagation();
            }
        }
    }
    
    return {
        add: function(elem, type, handler) {
            if (elem.setInterval && (elem != window && !elem.frameElement)) {
                elem = window;
            }
            
            if (!handler.guid) {
                handler.guid = ++guid;
            }
            
            if (!elem.events) {
                elem.events = {};
		elem.handle = function(event) {
		    if (typeof Event !== "undefined") {
				return commonHandle.call(elem, event)
		    }
                }
            }
	    
            if (!elem.events[type]) {
                elem.events[type] = {}                
            
                if (elem.addEventListener)
		    elem.addEventListener(type, elem.handle, false)
		else if (elem.attachEvent)
                    elem.attachEvent("on" + type, elem.handle)
            }
            
            elem.events[type][handler.guid] = handler
        },
        
        remove: function(elem, type, handler) {
            var handlers = elem.events && elem.events[type]
            
            if (!handlers) return
            
            delete handlers[handler.guid]
            
            for(var any in handlers) return 
	    if (elem.removeEventListener)
		elem.removeEventListener(type, elem.handle, false)
	    else if (elem.detachEvent)
		elem.detachEvent("on" + type, elem.handle)
		
	    delete elem.events[type]
	
	    
	    for (var any in elem.events) return
	    try {
	        delete elem.handle
	        delete elem.events 
	    } catch(e) { // IE
	        elem.removeAttribute("handle")
	        elem.removeAttribute("events")
	    }
        } 
    }
}())

/** 
* @file ui_conf.js
* @version 1.1.0
* @author DrunkenStranger
* @link http://userscripts.org/users/362572
* @license GPL
*/
/** €­вҐадҐ©б Є®­дЁЈга жЁЁ бЄаЁЇв 
* @param Document doc
*/
function UIConf(doc) {

    this.doc = doc;
    
    // this.node
    this.node = this.doc.createElement("div");
    this.node.style.display = "block";
    this.node.style.position = "fixed";
    this.node.style.backgroundColor = "#faebd7";
    this.node.style.borderStyle = "solid";
    this.node.style.borderWidth = "1px";
    this.node.style.borderColor = "#999999";
    this.node.style.width = "auto";
    this.node.style.height = "auto";
    this.node.style.margin = "0px";
    this.node.style.padding = "20px";
    
    this.nodeTitle = this.doc.createElement("div");
    this.nodeTitle.style.margin = "0px";
    this.nodeTitle.style.marginBottom = "10px";
    this.nodeTitle.style.padding = "0px";
    this.nodeTitle.style.fontSize = "18px";
    this.nodeTitle.style.color = "#000000";
    this.nodeTitle.style.textAlign = "center";

    this.nodeControls = this.doc.createElement("div");
    this.nodeControls.style.margin = "0px";
    this.nodeControls.style.padding = "0px";
    
    this.node.appendChild(this.nodeTitle);
    this.node.appendChild(this.nodeControls);
    this.doc.body.appendChild(this.node);
    
    // this.nodeAbout
    this.nodeAbout = this.doc.createElement("div");
    this.nodeAbout.style.display = "block";
    this.nodeAbout.style.position = "fixed";
    this.nodeAbout.style.backgroundColor = "#eedc82";
    this.nodeAbout.style.borderStyle = "solid";
    this.nodeAbout.style.borderWidth = "1px";
    this.nodeAbout.style.borderColor = "#999999";
    this.nodeAbout.style.margin = "0px";
    this.nodeAbout.style.padding = "10px";
    this.nodeAbout.style.width = "auto";
    this.nodeAbout.style.height = "auto";

    this.nodeAboutTitle = this.doc.createElement("div");
    this.nodeAboutTitle.style.margin = "0px";
    this.nodeAboutTitle.style.marginBottom = "10px";
    this.nodeAboutTitle.style.padding = "0px";
    this.nodeAboutTitle.style.fontSize = "18px";
    this.nodeAboutTitle.style.color = "#000000";
    this.nodeAboutTitle.style.textAlign = "center";
    this.nodeAboutTitle.textControls = ustring("€­бвагЄжЁп");

    this.nodeAboutContent = this.doc.createElement("div");
    this.nodeAboutContent.style.margin = "10px";
    this.nodeAboutContent.style.padding = "0px";
    this.nodeAboutContent.style.fontSize = "12px";
    this.nodeAboutContent.style.color = "#000000";
    this.nodeAboutContent.style.width = "530px";
    this.nodeAboutContent.style.height = "210px";
    this.nodeAboutContent.style.maxHeight = "490px";
    this.nodeAboutContent.style.overflow = "auto";
    
    this.nodeAboutControls = this.doc.createElement("div");
    this.nodeAboutControls.style.margin = "0px";
    this.nodeAboutControls.style.padding = "0px";
    
    this.nodeAbout.appendChild(this.nodeAboutTitle);
    this.nodeAbout.appendChild(this.nodeAboutContent);
    this.nodeAbout.appendChild(this.nodeAboutControls);
    this.node.appendChild(this.nodeAbout);
    
    this.setTitle("Љ®­дЁЈга жЁп");
    this.hide();
    this.hideAbout();
    
    var ui = this;
    ui.appendButton("€­бвагЄжЁп", function() {ui.showAbout();});
    ui.appendAboutButton("‡ Єалвм", function() {ui.hideAbout();});
    ui.appendButton("‡ Єалвм ¬Ґ­о", function() {ui.hide();});
}

UIConf.prototype.show = function() {
    this.node.style.display = "block";
    this.node.style.top = "127px";
    this.node.style.left = (this.doc.documentElement.clientWidth - this.node.clientWidth) / 2+200;
}

UIConf.prototype.hide = function() {
    this.node.style.display = "none";
}

UIConf.prototype.showAbout = function() {
    this.nodeAbout.style.display = "block";
    this.nodeAbout.style.top = "410px";
    this.nodeAbout.style.left = (this.doc.documentElement.clientWidth - this.nodeAbout.clientWidth) / 2+200;
}

UIConf.prototype.hideAbout = function() {
    this.nodeAbout.style.display = "none";
}

UIConf.prototype.createButton = function(title, handler) {
    var button = this.doc.createElement("input");
    button.style.display = "block";
    button.style.margin = "5px";
    button.style.marginLeft = "auto";
    button.style.marginRight = "auto";
    button.style.padding = "1px";
    button.style.paddingLeft = "5px";
    button.style.paddingRight = "5px";
    button.style.borderStyle = "solid";
    button.style.borderWidth = "1px";
    button.style.borderColor = "#999999";
    button.style.fontSize = "12px";
    button.style.cursor = "pointer";
    button.type = "button";
    button.value = ustring(title);
    if (handler !== undefined)
        Event.add(button, "click", handler);
    return button;
}

UIConf.prototype.createGreaseMonkeyBoolOption = function(name, def, title, desc) {
    
    var node = this.doc.createElement("block");
    node.style.display = "block";
    node.style.backgroundColor = "transparent";
    node.style.margin = "5px";
    node.style.marginLeft = "auto";
    node.style.marginRight = "auto";
    node.style.padding = "1px";
    
    var p = this.doc.createElement("p");
    p.style.display = "block";
    p.style.textAlign = "center";
    p.style.fontSize = "12px";
    p.style.margin = "0px";
    p.style.padding = "0px";
    p.style.color = "#000000";
    p.style.fontWeight = "bold";

    var edit = this.doc.createElement("input");
    edit.style.display = "inline";
    edit.style.margin = "2px";
    edit.style.padding = "1px";
    edit.style.paddingLeft = "5px";
    edit.style.paddingRight = "5px";
    edit.style.borderStyle = "none";
    edit.style.backgroundColor = "transparent";
    edit.style.fontSize = "12px";
    edit.style.fontWeight = "bold";
    edit.style.textAlign = "center";
    edit.style.width = "180px";
    
    var button = this.doc.createElement("input");
    button.style.display = "inline";
    button.style.margin = "2px";
    button.style.padding = "1px";
    button.style.paddingLeft = "5px";
    button.style.paddingRight = "5px";
    button.style.borderStyle = "solid";
    button.style.borderWidth = "1px";
    button.style.borderColor = "#999999";
    button.style.fontSize = "14px";
    button.style.fontWeight = "bold";
    button.style.cursor = "pointer";
    button.style.width = "80px";

    node.appendChild(p);
    node.appendChild(edit);
    node.appendChild(button);
    
    value = Boolean(GM_getValue(name, Boolean(def)));
    if (desc !== undefined)
        node.title = ustring(desc);
    edit.type = "text";
    edit.value = name;
//    edit.disabled = true;
    button.value = value;
    button.type = "button";
    Event.add(
        button, 
        "click", 
        function() {
            value = !value;
//            edit.disabled = false;
//            edit.value = value;
//            edit.disabled = true;
            GM_setValue(name, value);
    	    button.value = value;
        }
    );
    
    return node;
}

UIConf.prototype.appendButton = function(title, handler) {
    var button = this.createButton(title, handler);
    button.style.width = "95%";
    this.nodeControls.appendChild(button);
    return button;
}

UIConf.prototype.insertGMBoolOption = function(name, def, title, desc, position) {
    if (position === undefined)
        position = 0;
    var option = this.createGreaseMonkeyBoolOption(name, def, title, desc);
    this.nodeControls.insertBefore(option, this.nodeControls.childNodes[position]);
    return option;
}

UIConf.prototype.appendAboutButton = function(title, handler) {
    var button = this.createButton(title, handler);
    button.style.width = "120px";
    this.nodeAboutControls.appendChild(button);
    return button;
}

UIConf.prototype.setTitle = function(title) {
    this.nodeTitle.textContent = ustring(title);
}

UIConf.prototype.setAbout = function(text) {
    this.nodeAboutContent.innerHTML = ustring(text);
}
// ********* бзЁвлў ­ЁҐ га®ў­п ЈҐа®п **********
function getLevel() {
	if(url_cur.indexOf(url_home) == -1){ return; }
	
	//var pl_level = 0;
	var pl_level;

	for (var k = 0; k < all_tables.length; k++)
	{
                if (!all_tables[k]) continue;
                if (!all_tables[k].childNodes[0]) continue;
                if (!all_tables[k].childNodes[0].childNodes[0]) continue;
                if (!all_tables[k].childNodes[0].childNodes[0].childNodes[0]) continue;
                if (!all_tables[k].childNodes[0].childNodes[0].childNodes[0].innerHTML) continue;

		var str_tbl_info = all_tables[k].childNodes[0].childNodes[0].childNodes[0].innerHTML;

		if (str_tbl_info.indexOf(str_pl_lvl) > 0)
		{
			str_tbl_info = str_tbl_info.substring(str_tbl_info.indexOf(str_pl_lvl) + str_pl_lvl.length);
			pl_level = str_tbl_info.substring(0, str_tbl_info.search(/\D/));
			break;
		}
	}
	if(url_cur.indexOf(url_1_home) != -1)
	{
		GM_setValue("hwm_hunt_exp_pl_1_level", pl_level);
		return;
	 }
	if(url_cur.indexOf(url_2_home) != -1)
	{
		GM_setValue("hwm_hunt_exp_pl_2_level", pl_level);
		return;
	 }
	if(url_cur.indexOf(url_3_home) != -1)
	{
		GM_setValue("hwm_hunt_exp_pl_3_level", pl_level);
		return;
	 }
}

// *******************
function showExperience() {
	if(url_cur.indexOf(url_map) == -1){ return; }
	var cur_mob = "XXX";
	var my_td_danger;
	var pl_level = 0;
	if(url_cur.indexOf(url_1_map) != -1)  	pl_level = GM_getValue("hwm_hunt_exp_pl_1_level", "none");
	if(url_cur.indexOf(url_2_map) != -1)  	pl_level = GM_getValue("hwm_hunt_exp_pl_2_level", "none");
	if(url_cur.indexOf(url_3_map) != -1)  	pl_level = GM_getValue("hwm_hunt_exp_pl_3_level", "none");

	for (var k = 0; k < all_tables.length; k++)
	{
		if (all_tables[k].className == "wbwhite")
		{
			var link = all_tables[k].childNodes[0].childNodes[0].childNodes[1].childNodes[1];
			var str_hunt = all_tables[k].childNodes[0].childNodes[0].childNodes[1].innerHTML;

			mob_count = str_hunt.substring(str_hunt.search(/\(/)+1, str_hunt.search(/\u0448\u0442./)-1);

			var my_td_danger = all_tables[k].childNodes[0].childNodes[0].childNodes[2];
			cur_mob = link.href.split("=")[1];

			if(!my_td_danger){ return; } //no hunt...

			var total_exp       = Math.floor(mob_exp[cur_mob] * mob_count * koef / 5);		//ЋЇлв ў ®¤Ё­®зЄг
			var next_count      = (mob_count*1.3).toFixed(0);					//ЏаЁа®бв ЇаЁ Ї®ЎҐ¤Ґ ў ®¤Ё­®зЄг

                        var exp_with_helper = (total_exp / 2).toFixed(0);                          		//ЋЇлв б Ї®¬®й­ЁЄ®¬ (50/50)
			var next_half_count = (mob_count*Math.pow(1.3, 0.5)).toFixed(0);			//ЏаЁа®бв ЇаЁ Ї®ЎҐ¤Ґ б Ї®¬®й­ЁЄ®¬ (50/50)

			var min_count       = (mob_count / 5 - 0.5).toFixed(0);                    		//„«п ¬Ё­Ё¬ «м­®Ј® 5% ЇаЁа®бв 
                        var exp_min_count   = (Math.floor(mob_exp[cur_mob] * min_count * koef / 5)).toFixed(0); //ЋЇлв ЇаЁ ¬Ё­Ё¬ «м­®¬ ЇаЁа®бвҐ
			var next_min_count  = (mob_count*Math.pow(1.3, 0.2)).toFixed(0);			//ЏаЁа®бв ЇаЁ гЎЁ©бвўҐ <=20% Ўг¤Ґв ~5.4%

			total_exp = total_exp > pl_level*500 ? pl_level*500 : total_exp;			//…б«Ё ®Їлв Ў®«миҐ ўҐае­Ґ© ®вбҐзЄЁ Ї® га®ў­о
			exp_with_helper = exp_with_helper > pl_level*500 ? pl_level*500 : exp_with_helper;
			exp_min_count = exp_min_count > pl_level*500 ? pl_level*500 : exp_min_count;
			if (pl_level > 2) { 									//…б«Ё ®Їлв ¬Ґ­миҐ ­Ё¦­Ґ© ®вбҐзЄЁ Ї® га®ў­о (3+ га®ў­Ё)
				total_exp = total_exp < pl_level*70 ? pl_level*70 : total_exp; 
				exp_with_helper = exp_with_helper < pl_level*35 ? pl_level*35 : exp_with_helper;
				exp_min_count = exp_min_count < pl_level*14 ? pl_level*14 : exp_min_count;
			} 
                                                                                                        
			var str_total_exp = total_exp;
			var next_level = Number(pl_level)+1;
			if (total_exp > max_exp && max_exp > 0) { all_tables[k].childNodes[0].style.background = '#FFA07A' ; }

			str_total_exp ='<br> <font style="color:#0000CD">'+str_sum_exp.replace('STR1', str_total_exp).replace('STR6', next_count)+'</font>';
			if ((total_exp < next_level*70) && (pl_level > 1))  {str_total_exp +='<br> <font style="color:#0000CD">'+str_kill_now.replace('STR9', next_level).replace('STR10',next_level*70)+'</font>';}

                        if (enable_Exp_Half) {str_total_exp = str_total_exp + '<br> <font style="color:#CD00CD">'+str_hlp_exp.replace('STR2', exp_with_helper).replace('STR7', next_half_count)+'</font>'};

                        if (enable_5_procent) {str_total_exp = str_total_exp + '<font style="color:#007FFF"><i><center>'+str_min_kol.replace('STR3', min_count).replace('STR4', exp_min_count).replace('STR8', next_min_count)+'</center></i></font>'};

			var min_kills = Math.round(pl_level * 500 * 5 / mob_exp[cur_mob] / koef);
                        var exp_min_kills= mob_count < min_kills ? total_exp: pl_level * 500;
                                                                                                          
                        if (enable_Exp_Helper) {str_total_exp = str_total_exp + '<font style="font-size:10px; color:#013220"><b><center>'+str_exp_helper+'</center></b></font>'};
			all_tables[k].childNodes[0].childNodes[0].childNodes[1].innerHTML = str_hunt + str_total_exp;
			if (enable_05_Umka) {
				all_tables[k].childNodes[0].childNodes[0].childNodes[1].innerHTML +=
					'<font style="font-size:10px"><i><center>' +
						(mob_count > min_kills ? str_min_kills.replace('STR5', min_kills).replace('STR1', exp_min_kills) : str_all_kills.replace('STR1', exp_min_kills) );
							'</center></i></font>';}
                        
		}
	}
}
//****************************************************
function helpers() {
	if(url_cur.indexOf(url_war) == -1){ return; }
	var ems, elem, elem2, str_hunt, mob_count, mob_name, total_exp, backgrn, sect, s_sect;
	var alr = 0;
	var pl_level = 0;
	if(url_cur.indexOf(url_1_war) != -1)  	pl_level = GM_getValue("hwm_hunt_exp_pl_1_level", "none");
	if(url_cur.indexOf(url_2_war) != -1)  	pl_level = GM_getValue("hwm_hunt_exp_pl_2_level", "none");
	if(url_cur.indexOf(url_3_war) != -1)  	pl_level = GM_getValue("hwm_hunt_exp_pl_3_level", "none");
	for (var k = 0; k < all_tables.length; k++)
	{
		if (all_tables[k].className == "wb")
		{
	                ems = all_tables[k].querySelectorAll( "td > a[href*='map.php?cx']");
			for (var i = 0; i < ems.length; i++) {
				if (!ems[i].parentNode.parentNode.childNodes[6].childNodes[4]) {
		 			elem = ems[i].parentNode.parentNode.childNodes[6].childNodes[3].childNodes[0]; //odin v drugom sektore ili inoi level
				} else if (!ems[i].parentNode.parentNode.childNodes[6].childNodes[6]) {
		 			elem = ems[i].parentNode.parentNode.childNodes[6].childNodes[5].childNodes[0]; //odin v moem sektore
		 			elem2 = ems[i].parentNode.parentNode.childNodes[6].childNodes[4]; //odin v moem sektore
				}  else {
		 			elem = ems[i].parentNode.parentNode.childNodes[6].childNodes[6].childNodes[0]; //dvoe v drugom sektore
				}
				str_hunt = elem.innerHTML;
			 	mob_count = str_hunt.substring(str_hunt.search(/\(/)+1, str_hunt.search(/\)/));
			 	mob_name = str_hunt.substring(0, str_hunt.search(/\(/));
				total_exp = Math.floor(mob_rus_exp[mob_name] * mob_count * koef / 5);
				backgrn = '';
				if (elem.parentNode.parentNode.childElementCount != 5) {
                                	s_sect = ems[i].href;
				        sect = s_sect.substring(s_sect.lastIndexOf("?")+1,s_sect.length);
					s_sect =s_sect.replace("map.php?"+sect,"move_sector.php?id="+sectors[sect]);
					ems[i].innerHTML += ustring('<br><font style="color:#FF3244;"><b>ЏҐаҐ©вЁ</b></font>');
					ems[i].href = s_sect;
				}
				if (show_only_Gud_ExpUm && (total_exp< pl_level*133) ){ backgrn = ' background:#cfd';}
				if (show_only_Gud_ExpUm && (total_exp< pl_level*70)  ){ backgrn = ' background:#0f0';}
				if (alarm_Green_Hunt    && (total_exp< pl_level*133) && (elem.parentNode.parentNode.childElementCount != 5)){ alr = 1;}
				elem.innerHTML += '<font style="font-size:12px; color:#013220;'+ backgrn+'"><b>'+' '+total_exp+'</b></font>'+ ustring(' ®Їлв .');
			}
		}
	} 
if (alr == 1) alert(ustring('‡Ґ«Ґ­ п ®е®в '));
}
//****************************************************
if ((document.location.href.indexOf(url_home) != -1) || (document.location.href.indexOf(url_map) != -1) || (document.location.href.indexOf(url_war) != -1)){

    var uiConf = new UIConf(document);
    uiConf.setTitle("HWM Hunt Experience");
    uiConf.setAbout(
        "‡¤Ґбм ¬®¦­® ®вЄ«озЁвм ­Ґ­г¦­лҐ ў ¬ Ї®¤бЄ §ЄЁ.<br><br>" +
        "ЋЇЁб ­Ёп Ї а ¬Ґва®ў.<br>" +
        "<b>enable_Exp_Half</b> - Џ®¤бЄ §Є  Ї® Ї а­®© ®е®вҐ 50/50.<br>" +
        "<b>enable_5_procent</b> - Џ®¤бЄ §Є  Ї® Ї а­®© ®е®вҐ ¤«п ¬Ё­. ЇаЁа®бв .<br>" +
        "<b>enable_05_Umka</b> - ‘Є®«мЄ® ¤®бв в®з­® гЎЁвм ¤«п Ї®«гзҐ­Ёп 1 г¬ЄЁ.<br>" +
        "<b>enable_Exp_Helper</b> - ”®а¬г«  а бзсв  ®Їлв  ¤«п Ї®¬®й­ЁЄ .<br>" +
        "<b>show_only_Gud_ExpUm</b> - Џ®¤бўҐзЁў вм ®е®вл б «гзиҐ© нЄбЇ®г¬Є®©.<br>" +
        "<b>alarm_Green_Hunt</b> - ‚Є«озЁвм ЇаҐ¤гЇаҐ¦¤Ґ­ЁҐ ЇаЁ ўлЈ®¤­®© ®е®вҐ.<br>" +
        "<br><b>true</b> - ‘ва®Є  Ўг¤Ґв ®в®Ўа ¦ вмбп." +
        "<br><b>false</b> - ‘ва®Є  Ќ… Ўг¤Ґв ®в®Ўа ¦ вмбп.<br>" +
        "<br><b>‚ҐабЁп: 1.65<b>" +
        "<br><A HREF=http://userscripts.org/scripts/show/150393>Џ®б¬®ваҐвм ®Ў­®ў«Ґ­Ёп бЄаЁЇв </A>"
    );
   
    var i = 0;
    uiConf.insertGMBoolOption("enable_Exp_Half", enable_Exp_Half, undefined, "Ћв®Ўа ¦ вм ®Їлв б Ї®¬®й­ЁЄ®¬ 50/50.", i++);
    uiConf.insertGMBoolOption("enable_5_procent", enable_5_procent, undefined, "Ћв®Ўа ¦ вм Є®«-ў® ¤«п ¬Ё­.ЇаЁа®бв .", i++);
    uiConf.insertGMBoolOption("enable_05_Umka", enable_05_Umka, undefined, "Ћв®Ўа ¦ вм Є®«-ў® ¤«п Ї®«гзҐ­Ёп 1 г¬ЄЁ.", i++);
    uiConf.insertGMBoolOption("enable_Exp_Helper", enable_Exp_Helper, undefined, "Ћв®Ўа ¦ вм д®а¬г«г ¬Ё­. ®Їлв  Ї®¬®й­ЁЄ .", i++);
    uiConf.insertGMBoolOption("show_only_Gud_ExpUm", show_only_Gud_ExpUm, undefined, "Џ®¤бўҐзЁў вм ®е®вл б ўлЈ®¤­®© нЄбЇ®г¬Є®©.", i++);
    uiConf.insertGMBoolOption("alarm_Green_Hunt", alarm_Green_Hunt, undefined, "‚Є«озЁвм ЇаҐ¤гЇаҐ¦¤Ґ­ЁҐ ЇаЁ ўлЈ®¤­®© ®е®вҐ.", i++);
    GM_registerMenuCommand(ustring("HWM Hunt Experience: Љ®­дЁЈга жЁп"), function() {uiConf.show();});

}

getLevel();
showExperience();
helpers();