// ==UserScript==
// @name        Unknown Hanzi
// @namespace   http://sugoi-ideas.appspot.com/
// @description Highlights hanzi not being in the Anki deck
// @version     1.0
// @include     *
// @grant       none
// ==/UserScript==

var simplifiedHanziInDeck = '枯缚丸纱郎堂息俚宙防尸偶框腥嗝就忙烤泰者恍赋挤沼窜市角袭彦缠善叶刀路岛诀席焉爱驶石熔趴讹教迫姑葱剖枢谓阅傅睹尧努颠表做湖孕罗吁劝策毕咨鹦畴楷非躯某畜捆敞凛疮决眉韦伦躁矿董但范久歉总萍侍况励焚怔环誉呐陈喧迁谚纲每匆籽拢常约灾米刺并颤没懒甩茎操旁又想田轿亥弛哪勒掘蔓误饵溢择黄鸽看凤更俏碟磷败诸律述势矣嘛戒莫兆容青絮茅碳渣呼御悟抗落搅首其抽诽煎膛辈门花音矮柄瘫悠民靴笼橙睬购彩氓刊原廿诱低增按磋既柳噢喇捡铺耿撞塘筝糠且钥咏书账着铸俘辆踌德漂燃县倦酿手芭实刃鹉见蚤骗鸡肚圈敌抱腻仆改椒昏友征块公旦卸萨诗怅泳缆允丈典佩附纹锄丧厢丽肖奏拱旅恕础煌仁冻驻瘾牺走警启缘弦咀境峰橘疗寸醋毡易傲间统舞悦当产周笆斋堡明热浇撮哩樱妾负装忿磕牢坐计吃咱豆扒评缎葡姬庶禅盐削冈具宿等伶良右端抬甚兰隧佳栏绞朝淆鸿钻辐似啊跃姨晕镑宙吗苏吨填肥讳无务瞅宋豪舱蟹何躺谁奎澳蜡支奋已霉暴摔定咐革旭箱叽冒梗课魄胞笛摧曲悲老窄伙臼升身瑞陵百蔑抹骚毅垦瞩猜葛啼悼形自慌髓诲胃奇瓷练掐峻前嬉工交钓互爵媚追晋尔哲析垃雇大死鹿届牌档吟皿瓦划衷旱被聂闲氮要富本傍备苑儿瘸诧莉脉学镶鼠桩拣芦暂蝇劣惶陕额俺挪赐签葬畏揭蹲轩罪桅鲜怪湿橡瘩妮济痴赞仑撇荆睦坚四膏协霖嫁践羽栽碑涵废吼肩玩员棒滔馅彼畅报锋终储仅惧率聘勿隋尽闹达嫖肝叉搜塔伞浑壶仲转匣永盲倒继项苇啤幼估呆筐亲紧注贪喝舰存涨恼寝克徊咳衔熊汽写够梢嗅沙笔噩蜂桥召玫掀泥题体戚翘郊慷唠此邻播士闸泌梯瞒巴论饶胳凌乓告惩盘嘴咪航蝎粉金贬所磨揉查研哟猾脂烦禁裁嘶寅属键式惠洒簿盾觉迎晒栗儒喘饰嗨抚藤烈厨浆倚毙叠触罩荫霜吕胆归酷痰冲街侯愕赁怖泉宁毁艾剃哥清扬狂夹址开持予役屋探红丝连妨河国梳殿糊藏槛哉缔抢透宠钝愤投殆诚扰唇冗佣么少虎祭皮亚质桌歌怀靖瞎猬纤引历赤标熟拌憋如副履培嗡缸法擅蓄进内坎次东说泊撰除数霸诈郭驾乳拷斜络剧夏懂丢帆汝坊弹腐瓣苦世笠浴夕灿浓例赴突赛导秩摇蒸灰宪植搞方廷贞之布僻究挠仰建躬太拓捶寻毒轨第父悔及摩搏粱贤芯渔泽岁香演郁喂凑彪或根齿算幻与弯作捞驴沿蜘枉拒爪皱葵骂穿截孩哗趟区尝瀑毫欺枝狭酸君矩卑铝姆智骨逼茶洲念呀崩卫乒那般潘退愉烟乙驼补晓打杂亢李棚景留朱翔科异票消顾霞屿座菊妄步莲赢咙纠祥甲级幕血祈彻动宣帽慨卅铁蕉苹馆搓期嗓余酬乱多弟匠篷散驳向目党贝赌英湾跌眼辰结吸股町遗符途推窝挺孔耸朋森政腺峨珍诊函墅侈族巾肘禹化辣造呈昌劳艺丛秧趁倡运岩许盟差际赃育寨您渐杀妙搁称喊措寓浅构央饼洪维晶邀桃剑币强菇声堤擦昼菜欣幸薪舶恳斤巫解肛摞利域鹅商江偷羊波渗午污债敬顷仕捏限雾臣怡辟籍碧姚网胶韩极村丑洗响都愁猎疆稼住祝埋漏吴筋凉斥材换舌嫂松袖熬品眺巧谅宵答焕埠寇类浦谴经略鞋尹篱踊楼须瑰渍戈俱蹄隶送夷唯萤脊驯婆农频恐迈秦跪侮挡据谤代碰夸矫姐派径章犀舵妹攒职汗疟丙套妥祷井渡诡船收钦绳仓能赶简倍脏遵涉彭貌敲刁山糖事翅浩婿疾匀尤炉寂天证荧办妇名折毋勋封竖俊企殃狱愈勉灵雕登哎蓦苗耕完弃咯钟跺谈粮纬屠询砍寒倾慰萄验印诉惊断胖捐集瓶砌土己漫檬寺浮阔寮曹袱柬饮宇菌碗画壁赂失点默扎婴帅八乡泡概将厕拘株撕宽男吊回珊挨距幽乐辩歧氏固殷绣溉乾剩烁谣掏泻昆虏恨捷埔上垫携益雌温雹劫束价括哄未义鸟铜阀格半借漆救理嘿军拂福隐衰违拳一激休嚷校白惜专棚分贿瞻蠢载亮尚移琼蒜遣翻敦婶整鉴饺光然聚托耗枫呢撂啡阴货惨挑长最芬禽逛恰陋术匕压创吩语凰淡馒润纶汞杜淋妆耶反绪艇相捕娟症颜僵薄媳拾输胁殴摸啃蚀拦痢脱序喀寡故美壳饲伟晌萌普愿缓示灸肠垂康挎年叨匹板粥养诵伐流脖拙沾离黎地拴抒道言窗库誓啸墨腿带使厘禾密意抓疲嘉矛赏预栅碍疯电甭控她膨械健舐万涕权爬晰续姥复妓害敷亿砖通溶茧醉释钱立磊猛染怒债烛遭另界毛岗挟妻徽奉乞尼颇凡到衡获逊谭昔肆讥妒柯绸列猩憾详玄庸稀鲸讨匾寄错雨割亭虫凄悬凿短招罢阻订咋骡罚兹用钮由舒家号蹦先碎展否顿台粤残洛膀充徐王野雾威屈稠娶佯鼓器斧守插心盈欢迪蕾贼垒仙虹醇溅肢浙蜀瓜缅岂壮叼娃崎系膝墙院姜劈妃翼栖织嫌侧震廓鸣超广艰规裙岭芽依桦燥共筑业奸请凸叭绢卧曾哇糕杖几递谐忧梦细寥瘤岔颓讽囚拆盯显至辫瞳授贸嘘拨勃歇子琢销付嗜深钩菩炼干喽港往脸望冶味扫牛佐犯兵箍裤硅谱设店冰汹营恒你海锦呕吞碱谬腮缀慎掩版坏攻腰闭指闻恢弄空狡和惋挽状火什掠该胜碌饿入纷边裂笨童还忘盛队诺添佛抑千炊沈暖群团照扁栓疤巡咕踪聪轴病只吹坡肌粘柏早凳蹬谋编众淀哆晴旺冤像宫肺鹰欲季新篡桂裳愁喃犬逗茫泣纯七园蜓炕督坦迄盼扇放抖会亩聊摘旗线陡问孙狈棺捺慕绩刻稍催架水珑扣惟禄件迹赔菠从肃奢沏秋俐肯淹炸鞍奈磅箭蒲涡小量尿录怕斩耐逮省抿横筒组橱驹髦匙掌提份习洋奥锯勇贮魔宅现伺浸辅丹舅师闯攀顺们嘟筛待献仪渊礼芳哼帮锣脾契蛇口桔蝉听执唉胸畔陌晨募跑冠眨拜驮蛛翌淑澄爆溜钉辱蔡玉焦西葫旋咒毯魂足贩扩伪吠玻辞谍摄埃衬恶隆捉荣癌茂揽朴著虑摆举锻逝修咸刑骑侨跟中堵顶过啄沦冬犹司卷游蕴谦姓怠拍宦驰帖唐亏夫伏巷宰赫杭缴液靠挖棘助琴纪坝管慧独酒惫屏砂楚伤拔泵棋朔绵静撤匪浪栋烘扭苛治勘蛮瞬矗嫉的试阶蓝乏林痹孟剔晚是轧蔬锅模咖尖腋穴障软秀肪暇陪逃再兴九痕气力思加夭梅去谢礁蹈基桑哀志铃芒随叩蔼圾颂烫榜秘芝底净鞭比替险苯袍汪龄越却遮烹肾室承夺汤娘伴盖轰盏药球腊妞脚索娥便溺擎糟呻赠熄对涯裹睡丘度亨锡抛片艳滨也绷韧卿鬼甫眠簇鄙猫人煮厚联吾观柜璃刚棍京锹踢荐姿爽即绑挂记巩受元氢包全各蹋庙议逸刷官舆柿款喜刨腕竹贵售暮必巢援廊奴裸谜竞恩奠摊疼安徘知豁麦轮译腔兑胀懈六椭紫层社占狠愧案车惕蚕剂娱采衣喋混树背态二芥祸把给图骤亦遥今忍班棕豫恭马壤雷滴幢木五贴嗽镰适切猿近憎词躲惦扑窑朦脆斟日券个掉豹彬酗房坛乃调逾返啥让贰核伊髻捣滥吓阁在站辑楞渠抄痒映垮享婚鳞洞娜塌贯咽重喷话颁色虐庞哭鲁唱破呵接塑锐竿叉盒两狸遂扯朵华穷考辖戏较鹏拖钳认轻仔袁粪值帝叛鬓里止邮扔麻崇侵竭有耍薯铭昂制府恤句肋它围哈颗缝珠惭棉财抨稿隙取喻蘑骆桨针扮供贡俩梨得傻叮宝严肤徒舍繁风急甜蒂饭烂费蜗拇出艘昧惑窿厂疚屎绰伯缺滞岸技堕寞殖剪稳月来涂迟欠睁绘辽媒臂帐高亡镁讪姊帕鱼临讯兽阵祖搬铲盆钞样批歪旬撒精袜嘲爷绿委灯疫古侦条判贺壹踩舟战窟痛捧兼节蓬钙下神猖膊咧颈文梭成耻猪搂兔漠犁逢击娇灭冷尊仿曰丰卓奶钢琳租领合惹程嚼好堪愚女振宴这寿哑欧玲蜜绒忌狐串排麟翰厉隅鸭稚他坤面锈捂卵坟逆押旧吉辨诫蝠乎曼鲍阂罕食仗始发杠杆呱零巨煤弓萎坑叹鹤羞累而删应乖硕弗览外朗头叔闺荒郑僧奖莹危僚很若辛堆扶惯痪鹊卒窥需税踏册蚂为皆圆披积型竟星挣妈泼遍挫希矶鸦讶嘱譬窃我居南瑚凶溪浊源汁部远雁纸劲种介任孤皂凯聋蝶蔽情脑吻烧史齐博滑卡柴纺赎命秒顽争沉妖桶幅庆趋闪可怨以疙泛旷延施柠直歹置袋不读惰帘滋佃萃玛饱沃蝴搭魏宗硬杏拉仇鲤牙蛙监勺餐撼苍难果匿柔邦缩潭责莱笋纳尉扛焊纵张厅陆诅趣臭煞筹了刘夜沟嚎拥揣矢悉邹活杉俗疑局蚁峡拗微川颊琐讲瘦爸油茄虚津睛倔熙腾功唾蛋缕云爹蜻忆稻检瞪屉肿则邪垄彰笈泪尺吐辉翁凝伍酱掷黑叁私筷吱岳乍吧庄访贱谊炒射关帜粒笑枚主瞄龟陷溃疏三沸客感叙嘻侠均贷迅侣厌字料蝗喉母襟遇汇斗测时蝙韵乡笃镜象牲刹谷蒋申铀忽银识跳潜郡鼎因满尬啦虾囱保圳资墓生偿恋枪镇赵武叫杨番菲澡馋尘廉腹卢晤牧砸篮性雅融衍同署虽耀阳正锁杰呜滚飞乌慘素左找殊降锤免拿挚丫炮踱鼻囊膜后瑟敢敏伸吵滩巾机北忠兜塞逐停信审怎骇耳梁行觅瞌孵咬于屯担准优描宜位乔奔户盔尴挥起物慈皇蒙狼刮棵戴赖双迷厦萧宏末蚊淘昨别慢选坠佑胎弊宾逻参肉拐诬综怜剥弥崖裕贫斑凹州段硫真枕瘟歼绝嫩蛾圣羡绅粹篇祟唆趾弧醒飘丐拼致噪传涩哦俄姻平粗昭尾患城覆匈确魁勾单兄荡训嗯影洁椅丁茵阐凭弱场灌耽快配榴哨隔侄狮晃绍阿螺雪沫买察铅抵狗霍潮翠庐促崭朽灶旨讼假屑秉纽瞧褐屁荷避吏焰衙循赚拟眯卖杯怯屡氯窒愣春衫胧页雀谎偏斯池护医求燕暑才泄辙牵拧陶服倘氛骄勤馈诞炭效炎揪墟萝饥草暗减卜惚拭撑十龙甸视含闷绕猴候俭柱鹃贾涌迭缉些雄渴庭唤跨孝乘揍罐初处盗床辜酝胡箩速握躇豌熏氧困狙链冯仍秃逞涛露损嗦谨特磁悄令驱甘变码适汉俯'
;

var traditionalHanziInDeck = 
'這國個來為時們會說學對過於後著裡裏發髮還經沒衕麼現麵開電種當噹從動業實隻長與兩樣進機點頭問無間產氣話幾錶將華內軍車製曏併並關體總給員見應東報臺檯颱萬別彆場聲數書門題計邊乾幹資親許處隊義係繫請結論記難風變區黨聯認帶戰愛運聽張覺則統卻務條濟達議辦遠強設觀傳師術馬該領決寫導紅廣講權兒節讓識滿組轉級語連爭視談單歷曆錢據際極線離證熱團裝調農準類約號剋較選樂稱輕專廠響參誌備亞況價圖嚴買眾隨復複覆規興黃費驗舉灣藝須鬚爾歡確歲註斷飛嗎溫僅願雖續維幫剛勢絕醫緊劃畫顯蘇擊態圍飯習屬護緻職雙媽畫夠鄉標採埰勞陽壓讀誰層紀靜創雲樹責織簡質腦盡儘訴槍賣鬥漢獨沖衝聞項傷細繼勝評爺塊終獲穫協陳羅負錯闆財筆營養園臉換顧階紙編餘驚訂適構衛試堅檢詩優貨葉雜銀舊環劉陸積錄鐵樓腳預劇頓漸狀亂擔課減殺藥懷鐘鍾彈貴寶蘭畢婦謝討煙禮龍異戶訪睏鬆寧練豐揮燈順壞險縣揚謂輸執館簽綠敗盤魚鮮臨戲靈礎頂億淚惡陣鬍衚誤額趕紹載麗徵偉脫楊搖輪歐稅賽歸納鄧審碼補島澤彙匯蟲榮圓範雞麥詞孫燒築釋寬銷齊獎擺聖牆尋慶擇紛鎮絲獻蓋橋糧掛訓鋼莊穩奮遺慮購窮純監橫敵謀測纍吳擴損隱魯贊穀銅捲嘆誠針鏡賞夢軟陰鬧譯壯煩慣緩紡貿觸縮跡網輛奪礦滅幣勁傾趙貼訊閃廢閑滾棄輝蕩頗廳奧躍憑閉殘競鋪側庫凈倆徹虛捨藍貧擁績罷儀顏豬倫鋒啟絡療涼貫膽毀攝違齡紐緣辯郵濃憶鍋飄艱詢憲徑賓掃諸輯顆濕災猶韓煉緒屆擠貝湯閱罵劑宮薩曉潔縱蔣丟貢詳傑欄輩肅頻勵搶駛撥鄰遲騰暫鄭飽闊飲噸遞嚇頁綱駐聰蒼鞏噴籌潤爛騎獄烏誕淺諾鑽綜漁憐潛鍵儲鳥辭憤褲飾塗罰漲帳鳴虧夾鹽劍掙趨悶賴牽脈髒臟厲壽譽喬鎖彎糾貸繞贏銳餓駕峽拋溝窩灑凱紋慘剝攤瘋瀋餅轟勸塵喚脅鴻喪釐債醜懸灘鴨膠擾誼礙冊賀紗霧驅凍崗騙懼憂嶺擋貓遷貪鑒誇軌邁鳳爐脹償遼襲癥撲縫籠恆嘗遙敘樸萊渾廚繪盜屍暢覽犧桿倉蕭錦賺閣叢戀懶撫膚頑偽艦厭偵豈腸鬱艷譜櫃彌攜賢蹤勻檔睜謹臥廈惱磚盧颳顛顫蓮齒驕擬潑撈鈴廟診踐禍撐曬湊纖皺僑濱駁繩娛賠贈悅諒綿飢濤壇罈龐邏誘頌醬燦禦釀馳狹獅疊籃姦纏賦瑪廂竊釘輿賭轎闖畝兌錫輓韻攔襯豎賊懲蝦賬蠟譚銘腫臘鹹鈔墊頸獸滲遜販幟紳綸繳輔屢諧嘩岡囑漿壺嬰恥謊帥濫絨燭謙鷹獵攪蘿馮啞殼暈禪蘋蔥簾鋁頒澱朧鴉墳嬌謠鵬懇潰晉薦鉤寵呂鏈穎諷驟陝茲瓊綁剎聳滯妝僕鵝癢澆墜繡饒廁撿廬蝕賈蔭蘆揀緝斬訝閥賜欽燙鍛緬傘攏慄闡壟晝糞縛禿騷曠搗擲輻棟釣擱韋蠻諱譴貞軸鉛撓訟鑄儉閘樞侶謬銜斃譏爍瀉艙軀蘊傭賤饅絞壘膩賄彥窯綢樁隸聾謎龜鑲淵詐鏟纜翹辮縷嘯壩墮淪摟綽誦嶼覓齋鑼錘嶄勛洶莖詭渦緯噓濺轄誣聶貶擰矯吶韌篩侖瑣荊俠癮挾喲盞鑿濁櫻攬瑩堯煥竄締鏽鄒頃鶴襪寢攢驢鈾刪磯瀾瞞鋤螢綴詫繃慚鮑嬸詠腎摯楓凜蟬滬駱滌棲躊疇訣飼粵瑤瀝嘰嗚墾鎂閻駭篤澀悵窪貯鈞棗驀祿饞柵嘔碩鑰禱贖樺鯉狽鹼誡熒瘡'
;

var kanjiInDeck = 
'一丁七万丈三上下不与且世丘丙両並中丸丹主久乏乗乙九乱乳乾了予争事二互五井亜亡交享京亭人仁今介仏仕他付仙代令以仮仰仲件任企伏伐休会伝伯伴伸伺似但位低住佐体何余作佳併使例侍供依価侮侯侵便係促俊俗保信修俳俵俸倉個倍倒候借倣値倫倹偉偏停健側偵偶偽傍傑傘備催債傷傾働像僕僚僧儀億儒償優元兄充兆先光克免児党入全八公六共兵具典兼内円冊再冒冗写冠冬冷准凍凝凡処凶凸凹出刀刃分切刈刊刑列初判別利到制刷券刺刻則削前剖剛剣剤副剰割創劇力功加劣助努励労効劾勅勇勉動勘務勝募勢勤勧勲包化北匠匹区医匿十千升午半卑卒卓協南単博占印危即却卵卸厄厘厚原厳去参又及友双反収叔取受叙口古句叫召可台史右号司各合吉同名后吏吐向君吟否含吸吹呈呉告周味呼命和咲哀品員哲唆唇唐唯唱商問啓善喚喜喝喪喫営嗣嘆嘱器噴嚇囚四回因団困囲図固国圏園土圧在地坂均坊坑坪垂型垣埋城域執培基堀堂堅堕堤堪報場塀塁塊塑塔塗塚塩塾境墓増墜墨墳墾壁壇壊壌士壮声壱売変夏夕外多夜夢大天太夫央失奇奉奏契奔奥奨奪奮女奴好如妃妄妊妙妥妨妹妻姉始姓委姫姻姿威娘娠娯婆婚婦婿媒嫁嫌嫡嬢子孔字存孝季孤学孫宅宇守安完宗官宙定宜宝実客宣室宮宰害宴宵家容宿寂寄密富寒寛寝察寡寧審寮寸寺対寿封専射将尉尊尋導小少尚就尺尼尽尾尿局居屈届屋展属層履屯山岐岩岬岳岸峠峡峰島崇崎崩川州巡巣工左巧巨差己巻市布帆希帝帥師席帯帰帳常帽幅幕幣干平年幸幹幻幼幽幾庁広床序底店府度座庫庭庶康庸廃廉廊延廷建弁弊式弐弓弔引弟弦弧弱張強弾当形彩彫彰影役彼往征径待律後徐徒従得御復循微徳徴徹心必忌忍志忘忙応忠快念怒怖思怠急性怪恋恐恒恥恨恩恭息恵悔悟悠患悦悩悪悲悼情惑惜惨惰想愁愉意愚愛感慈態慌慎慕慢慣慨慮慰慶憂憎憤憩憲憶憾懇懐懲懸成我戒戦戯戸戻房所扇扉手才打払扱扶批承技抄把抑投抗折抜択披抱抵抹押抽担拍拐拒拓拘拙招拝拠拡括拷拾持指挑挙挟振挿捕捜捨据掃授掌排掘掛採探接控推措掲描提揚換握揮援揺損搬搭携搾摂摘摩撃撤撮撲擁操擦擬支改攻放政故敏救敗教敢散敬数整敵敷文斉斎斗料斜斤斥断新方施旅旋族旗既日旧旨早旬昆昇明易昔星映春昨昭是昼時晩普景晴晶暁暇暑暖暗暦暫暮暴曇曜曲更書曹替最月有服朕朗望朝期木未末本札朱朴机朽杉材村束条来杯東松板析林枚果枝枠枢枯架柄某染柔柱柳査栄栓校株核根格栽桃案桑桜桟梅械棄棋棒棚棟森棺植検業極楼楽概構様槽標模権横樹橋機欄欠次欧欲欺款歌歓止正武歩歯歳歴死殉殊残殖殴段殺殻殿母毎毒比毛氏民気水氷永汁求汗汚江池決汽沈沖没沢河沸油治沼沿況泉泊泌法泡波泣泥注泰泳洋洗洞津洪活派流浄浅浜浦浪浮浴海浸消涙涯液涼淑淡深混添清渇済渉渋渓減渡渦温測港湖湯湾湿満源準溝溶滅滋滑滝滞滴漁漂漆漏演漠漢漫漬漸潔潜潟潤潮澄激濁濃濫濯瀬火灯灰災炉炊炎炭点為烈無焦然焼煙照煩煮熟熱燃燥爆爵父片版牛牧物牲特犠犬犯状狂狩独狭猛猟猫献猶猿獄獣獲玄率玉王珍珠班現球理琴環璽瓶甘甚生産用田由甲申男町画界畑畔留畜畝略番異畳疎疑疫疲疾病症痘痛痢痴療癒癖発登白百的皆皇皮皿盆益盗盛盟監盤目盲直相盾省看県真眠眺眼着睡督瞬矛矢知短矯石砂研砕砲破硝硫硬碁碑確磁磨礁礎示礼社祈祉祖祝神祥票祭禁禅禍福秀私秋科秒秘租秩称移程税稚種稲稼稿穀穂積穏穫穴究空突窃窒窓窮窯立竜章童端競竹笑笛符第筆等筋筒答策箇算管箱節範築篤簡簿籍米粉粋粒粗粘粛粧精糖糧糸系糾紀約紅紋納純紙級紛素紡索紫累細紳紹紺終組経結絞絡給統絵絶絹継続維綱網綿緊総緑緒線締編緩緯練縁縄縛縦縫縮績繁繊織繕繭繰缶罪置罰署罷羅羊美群義羽翁翌習翻翼老考者耐耕耗耳聖聞聴職肉肌肖肝肢肥肩肪肯育肺胃胆背胎胞胴胸能脂脅脈脚脱脳腐腕腰腸腹膚膜膨臓臣臨自臭至致興舌舎舗舞舟航般舶船艇艦良色芋芝花芳芸芽苗若苦英茂茎茶草荒荘荷菊菌菓菜華落葉著葬蒸蓄蔵薄薦薪薫薬藩藻虐虚虜虞虫蚊蚕蛇蛍蛮融血衆行術街衛衝衡衣表衰衷袋被裁裂装裏裕補裸製複褐褒襟襲西要覆覇見規視覚覧親観角解触言訂計討訓託記訟訪設許訳訴診証詐詔評詞詠試詩詰話該詳誇誉誌認誓誕誘語誠誤説読課調談請論諭諮諸諾謀謁謄謙講謝謡謹識譜警議譲護谷豆豊豚象豪貝貞負財貢貧貨販貫責貯貴買貸費貿賀賃賄資賊賓賛賜賞賠賢賦質購贈赤赦走赴起超越趣足距跡路跳践踊踏躍身車軌軍軒軟転軸軽較載輝輩輪輸轄辛辞辱農辺込迅迎近返迫迭述迷追退送逃逆透逐逓途通逝速造連逮週進逸遂遅遇遊運遍過道達違遠遣適遭遮遵遷選遺避還邦邪邸郊郎郡部郭郵郷都酌配酒酔酢酪酬酵酷酸醜醸釈里重野量金針釣鈍鈴鉄鉛鉢鉱銀銃銅銘銭鋭鋳鋼錠錬錯録鍛鎖鎮鏡鐘鑑長門閉開閑間関閣閥閲闘防阻附降限陛院陣除陥陪陰陳陵陶陸険陽隅隆隊階随隔際障隠隣隷隻雄雅集雇雌雑離難雨雪雰雲零雷電需震霊霜霧露青静非面革靴音韻響頂項順預頑頒領頭頻頼題額顔顕願類顧風飛食飢飯飲飼飽飾養餓館首香馬駄駅駆駐騎騒験騰驚骨髄高髪鬼魂魅魔魚鮮鯨鳥鳴鶏麗麦麻黄黒黙鼓鼻齢串丼乞亀伎侶俺傲僅冥冶凄刹剥勃勾匂叱呂呪咽哺唄唾喉喩嗅嘲埼堆塞塡奈妖妬媛嫉宛尻岡崖嵐巾弄弥彙怨恣惧慄憧憬戚戴拉拭拳拶挨挫捉捗捻摯斑斬旦旺昧曖曽枕柵柿栃桁梗梨椅椎楷毀氾汎汰沃沙淫湧溺潰煎熊爪爽牙狙玩瑠璃璧瓦畏畿痕痩瘍眉睦瞭瞳稽窟箋箸籠綻緻罵羞羨肘股脇脊腎腫腺膝膳臆臼舷艶芯苛茨萎葛蓋蔑蔽藍藤虎虹蜂蜜袖裾訃詣詮誰諦諧謎貌貪貼賂賭踪蹴辣遜遡那酎醒采釜錦錮鍋鍵鎌闇阜阪隙韓頃須頓頬顎餅餌駒骸鬱鶴鹿麓麺'
;

var hanziInDeck = simplifiedHanziInDeck + traditionalHanziInDeck + kanjiInDeck;

var set = {};

//var strTest = '是不';
//hanziInDeck = strTest;

for(var i = 0; i < hanziInDeck.length; i++)
{
	set[hanziInDeck.charAt(i)] = 1;
}


/////////////////////////////////////////////////////////////////////
/// checks whether the character is considered unknown
/// @param ch character to test
function isUnknown(ch)
{
	return 	ch.charCodeAt(0) >= 0x4E00 &&
			ch.charCodeAt(0) <= 0x9FFF &&
			!set.hasOwnProperty(ch);
}

/////////////////////////////////////////////////////////////////////
function findUnknownChars(node)
{
	var unknownCharClusters = [];
	var foundLast = -1;
	var text = node.nodeValue;
	for(var textInd = 0; textInd < text.length; ++textInd)
	{
		var ch = text.charAt(textInd);
		if(isUnknown(ch))
		{
			if(foundLast < 0)
			{
				foundLast = textInd;
			}
		}
		else if(foundLast >= 0)
		{
			unknownCharClusters.push([foundLast, textInd]);
			foundLast = -1;
		}
	}
	if(foundLast >= 0)
	{
		unknownCharClusters.push([foundLast, text.length]);
	}
	return unknownCharClusters;
}

/// replaces the text node with a series of text, span, text, span, text, etc.
/// @param unknownChars pair of the text node and array of [start, end) positions to replace
function replaceNodes(unknownChars)
{
	for(var i = 0; i < unknownChars.length; ++i)
	{
		var node = unknownChars[i][0];
		var charPositions = unknownChars[i][1];
		var lastReplaced = 0;
		var text = node.nodeValue;
		var parent = node.parentNode;
		for(var j = 0; j < charPositions.length; ++j)
		{
			substPosition = charPositions[j]
			if(lastReplaced != substPosition[0])
			{
				var textBefore = text.substring(lastReplaced, substPosition[0] );
				var before = document.createTextNode( textBefore );
				parent.insertBefore(before, node);
			}
				
			var highlight = document.createElement("span");
			highlight.class = "highlight";
			var highlightedText = text.substring(substPosition[0], substPosition[1]);
			highlight.textContent = highlightedText;
			highlight.style.color = "red";
			parent.insertBefore(highlight, node);
			lastReplaced = substPosition[1];
		}
		if(lastReplaced != unknownChars.length)
		{
			var after = document.createTextNode( text.substring(lastReplaced ) );
			parent.insertBefore(after, node);		
		}
		parent.removeChild(node);
	}
}

var unknownChars = [];
recurseDomChildren(document.documentElement, unknownChars);
replaceNodes(unknownChars);

function recurseDomChildren(start, unknownChars)
{
    var nodes = start.childNodes;
    if(nodes)
    {
        loopNodeChildren(nodes, unknownChars);
    }
}

function loopNodeChildren(nodes, unknownChars)
{
    var node;
    for(var i=0;i<nodes.length;i++)
    {
        node = nodes[i];
        searchInTextNode(node, unknownChars);
        if(node.childNodes)
        {
            recurseDomChildren(node, unknownChars);
        }
    }
}

function searchInTextNode(node, unknownChars)
{
    if(node.nodeType === 3) // text node
    {
        unknownCharsInText = findUnknownChars(node);
		if(unknownCharsInText.length != 0)
		{
			unknownChars.push([node, unknownCharsInText]);
		}
    }  
}



