// ==UserScript==
// @name           呵呵
// @namespace      
// @description    
// @include        http://reg.renren.com/xn6245.do?*
// ==/UserScript==


function main()
{
  var s='';
  for(i=0;i<12;i++)
    s=s+Math.floor(Math.random()*10);
  document.getElementById('regEmail').value=s+'@cosb.com';
  s='';
  for(i=0;i<12;i++)
    s=s+Math.floor(Math.random()*10);
  document.getElementById('pwd').value=s+'hehe';
  var a,b,c;
  //姓
  var xing=Array("贾","赵","萧","梁","胡","谢","曹","袁","傅","彭","蒋","蔡","魏","薛","阎","潘","戴","夏","姜","姚","邹","熊","郝","秦","蒋","邵","侯","段","武","赖","龚","奥","夏侯","诸葛","上官","欧阳","尉迟","公孙","岳","墨","琴","涂","温","匡","余","余" ,"温","景","庄","王","燕","袁","景","马","伊","樊","朱","冯","雷","范","穆","麒","安","布","卜","白","拜","鲍","庹","崔","程","晨","迟","常","车","翟","窦","狄","费","范","郭","葛","恭","霍","孔","柯","骆","苗","孟","潘","乔","童","屠","邰","谭","巫","翁","徐","肖","萧","夏","张","李","赵","刘","杨");
  //第二个字
  var frist=Array("雷","琳","甜","琪","茂","莆","倩","祥","霞","莠","唇","汝","瑞","妮","莫","终","慧","诗","雯","鸿","乔","雪","君","雅","森","沐","淮","莉","淑","申","双","霆","媛","熙","彩","明","琪","兴","旺","泉","诚","秋","生","骏","晶","然","怡","蓉","淳","宇","玉","志","麻","宏","静","萱","楚","茵","迪","卡","辉","苑","博","新","豪","炫","翰","豪","睿","渊","昊","宸","博","哲","瀚","幽","桦","逸","智","鑫","鹏","顾","玮","益","轩");
  //第三个字
  var sec=Array("敢","款","淦","筐","贵","辜","凯","植","奠","捷","掎","探","敦","智","棠","淘","淡","焦","荔","轸","迦","钧","婷","喋","塘","塔","暖","楠","幄","涯","焰","雁","雅","雯","喻","婺","琬","博","棉","涵","淼","淮","番","徨","惠","斑","酣","邯","媚","彬","棠","磊","宸","瓿","梅","晴","婷","霞","惠");
  a=Math.floor(Math.random()*104);
  b=Math.floor(Math.random()*84);
  c=Math.floor(Math.random()*58);
  document.getElementById('name').value=(xing[a] + frist[b] + sec[c]);
  document.getElementById('icode').focus();
}


main();
