// По вопросам и предложениям сюда: shaitan_mashine@mail.ru
//
// ==UserScript==
// @name          Заменяет мат на странице.
// @namespace     http://*
// @description   Заменитель мата и подсветка (при наведении на слово показывается оригинал)
// @include       http://*

// ==/UserScript==

var r=document.createElement("style");
r.innerHTML="span.mattrem{background-color:yellow}"
document.body.appendChild(r);

/// Русские буквы
var Rus=[];

/// массив замены фигни на чушь
var Arr=[];	

function ra(t1,t2)
{
	Arr[Arr.length] = [t1,t2];
}

ra('ебать','эх');
ra('Ебать','Эх');
ra('ебан','плох');
ra('Ебан','Плох');
ra('йобан','плох');

ra('ебучи','плохо');
ra('ебал','имел');
ra('Ебал','Имел');
ra('ебенн','плох');
ra('ебу ','имею ');
ra('Ебу ','Имею ');
ra('еби ','имей ');
ra('ебёт','имеет');
ra('ебнут','глуп');
ra('ебнул','вдарил');
ra('ебешь','имеешь');


ra('хуй','фиг');
ra('Хуй','Фиг');
ra('Хули','фигли');
ra('хули','Фигли');
ra('охуен','офиген');
ra('Охуен','Офиген');
ra('охуел','офигел');

ra('охуит','замечат');
ra('хует','фигов');
ra('Хует','Фигов');
ra('хуита','фигня');
ra('Хуита','Фигня');
ra('хуев','фигов');
ra('хуесран','плох');
ra('хуясе','нифига себе');

ra('хуек','пись');
ra('хуец','пись');
ra('хуем','половым органом');
ra('хуям','половыми органам');

ra('хуеплет','болтун');

ra('хуяр','фигар');
ra('хуесос','пылесос');
ra('членосос','пылесос');

ra('Нихуя','Нифига');
ra('нихуя','нифига'); 

ra('пидор','дурак');
ra('пидар','педик');
ra('Пидар','Гомик');
ra('пизд','фигн');
ra('Пизд','Фигн');
ra('говн','овн');
ra('гавно','фекалия');

	
ra('пох ','пофиг ');
ra('бля ','блин ');
ra('Бля ','Блин ');

ra('бляд','блин');
ra('блять','блин');
ra('Блять','Блин');
ra('блеать','блин');
ra('блеадь','блин');
ra('блеять','блин');
ra('блиать','блин');
ra('пилять','блин');

ra('ебоши','е*оши');
ra('наеб','обман');
ra('хуяк','на!');
ra('съеб','ушел');
ra('епт','е*т');

ra('ебло','лицо');
ra('еблан','дурак');
ra('гандон','презерватив');
ra('гондон','презерватив');

ra('шлюх','дур');
ra('шлюшк','дур');
ra('Первый нах','Я обезьяна');
ra('первый нах','я обезьяна');
ra('100500','я c тобой полностью согласен');
ra('выебну','выпендри');
ra('заебыва','доста');
ra('далбаеб','дурак');
ra('долбаеб','дурак');
ra('долбоеб','дурак');
ra('задрот','настырный');
ra('дохуя','многовато');
ra('хер ','половой орган ');
ra('в ахуе','в шоке');
ra('вахуе','в шоке');
ra('уебищ','страшилищ');

var inner = document.body.innerHTML;
for (var i=0;i<Arr.length;i++)
{
	inner = inner.replace(new RegExp(Arr[i][0],'g'),"<span class=mattrem title='"+Arr[i][0]+"'>"+Arr[i][1]+"</span>");
}

document.body.innerHTML = inner;

