// ==UserScript==
// @name           Продажа аккаунтов онлайн игр
// @namespace      ARISTOKRAT
// @description    ресурсы и. т. д.
// ==/UserScript==

Продам золото для vten.ru В ТРИ РАЗА ДЕШЕВЛЕ! Можно маленькими 

партиями (для недоверчивых). Оплата на ЯндексДеньги, также можно оплатить 

через посредника. После оплаты вы получаете аккаунт с черепами и 

минералами на нужную сумму. Возможны заказы на другие wap игры. По 

вопросам и заказам обращайтесь shift717@yandex.ru 

Партнёрская программа - выплата 25% от суммы покупки привлечённого 

клиента.