// ==UserScript==
// @name           facebook-lem
// @namespace      IndigenousTweets.com
// @description    Translates Facebook into Lemko
// @include        http*://*.facebook.com/*
// @include        http*://facebook.com/*
// @exclude        http*://*.facebook.com/messages/*
// @exclude        http*://facebook.com/messages/*
// @author         Kevin Scannell
// @run-at         document-start
// @version        0.0.1
// @icon           http://indigenoustweets.com/resources/gm.png
// ==/UserScript==
 
// Last updated:   2012-07-18
// Translations:   Tomasz Kisielowski
 
/*
 *  Copyright 2012 Kevin Scannell
 *
 *  This program is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation, either version 3 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License
 *  along with this program.  If not, see <http://www.gnu.org/licenses/>.
 *
*/
 
 
var tags = new Array();
tags.push('a');      // many...
tags.push('h4');     // Sponsored, Ticker, ...
tags.push('h6');     // %a commented on %a.
tags.push('label');  // Comment
 
var divclasses = new Array();
divclasses.push('innerWrap');  // Write a comment... <textarea>
divclasses.push('commentActions fsm fwn fcg'); // time stamps on comments
divclasses.push('UIImageBlock_Content UIImageBlock_ICON_Content');  // 2 people like this
//divclasses.push('fsm fwn fcg');  // By:
//divclasses.push('uiImageBlockContent uiImageBlockSmallContent');  // "near"
 
var spanclasses = new Array();
spanclasses.push('default_message');  // Like/Dislike
spanclasses.push('saving_message');   // Like/Dislike
 
// Replace the search string with the translated string
function r(dd, s, t) {
    if (s == t) {
        return (dd);
    } else {
        var RegExpr = new RegExp(s, "g");
        return (dd.replace(RegExpr, t));
    }
}
 
function translate(x) {
    d = x;
// Translations go here
    d = r(d, '(^|="|>)([0-9]{1,2}) stycznia(?=($|"|<))', "$1" + "$2" + " січня");
    d = r(d, '(^|="|>)([0-9]{1,2}) lutego(?=($|"|<))', "$1" + "$2" + " лютого");
    d = r(d, '(^|="|>)([0-9]{1,2}) marca(?=($|"|<))', "$1" + "$2" + " березня");
    d = r(d, '(^|="|>)([0-9]{1,2}) kwietnia(?=($|"|<))', "$1" + "$2" + " квітня");
    d = r(d, '(^|="|>)([0-9]{1,2}) maja(?=($|"|<))', "$1" + "$2" + " травня");
    d = r(d, '(^|="|>)([0-9]{1,2}) czerwca(?=($|"|<))', "$1" + "$2" + " червня");
    d = r(d, '(^|="|>)([0-9]{1,2}) lipca(?=($|"|<))', "$1" + "$2" + " липня");
    d = r(d, '(^|="|>)([0-9]{1,2}) sierpnia(?=($|"|<))', "$1" + "$2" + " серпня");
    d = r(d, '(^|="|>)([0-9]{1,2}) września(?=($|"|<))', "$1" + "$2" + " вересня");
    d = r(d, '(^|="|>)([0-9]{1,2}) października(?=($|"|<))', "$1" + "$2" + " жовтня");
    d = r(d, '(^|="|>)([0-9]{1,2}) listopada(?=($|"|<))', "$1" + "$2" + " листопада");
    d = r(d, '(^|="|>)([0-9]{1,2}) grudnia(?=($|"|<))', "$1" + "$2" + " грудня");
 
    d = r(d, '(^|="|>)([0-9]{1,2}) stycznia ([0-9]{4}) o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " січня " + "$3" + " o " + "$4");
    d = r(d, '(^|="|>)([0-9]{1,2}) lutego ([0-9]{4}) o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " лютого " + "$3" + " o " + "$4");
    d = r(d, '(^|="|>)([0-9]{1,2}) marca ([0-9]{4}) o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " березня " + "$3" + " o " + "$4");
    d = r(d, '(^|="|>)([0-9]{1,2}) kwietnia ([0-9]{4}) o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " квітня " + "$3" + " o " + "$4");
    d = r(d, '(^|="|>)([0-9]{1,2}) maja ([0-9]{4}) o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " травня " + "$3" + " o " + "$4");
    d = r(d, '(^|="|>)([0-9]{1,2}) czerwca ([0-9]{4}) o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " червня " + "$3" + " o " + "$4");
    d = r(d, '(^|="|>)([0-9]{1,2}) lipca ([0-9]{4}) o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " липня " + "$3" + " o " + "$4");
    d = r(d, '(^|="|>)([0-9]{1,2}) sierpnia ([0-9]{4}) o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " серпня " + "$3" + " o " + "$4");
    d = r(d, '(^|="|>)([0-9]{1,2}) września ([0-9]{4}) o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " вересня " + "$3" + " o " + "$4");
    d = r(d, '(^|="|>)([0-9]{1,2}) października ([0-9]{4}) o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " жовтня " + "$3" + " o " + "$4");
    d = r(d, '(^|="|>)([0-9]{1,2}) listopada ([0-9]{4}) o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " листопада " + "$3" + " o " + "$4");
    d = r(d, '(^|="|>)([0-9]{1,2}) grudnia ([0-9]{4}) o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " грудня " + "$3" + " o " + "$4");
 
    d = r(d, '(^|="|>)([0-9]{1,2}) stycznia o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " січня o " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) lutego o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " лютого o " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) marca o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " березня o " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) kwietnia o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " квітня o " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) maja o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " травня o " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) czerwca o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " червня o " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) lipca o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " липня o " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) sierpnia o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " серпня o " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) września o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " вересня o " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) października o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " жовтня o " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) listopada o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " листопада o " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) grudnia o ([0-9:apm]+)(?=($|"|<))', "$1" + "$2" + " грудня o " + "$3");
 
    d = r(d, '(^|="|>)([0-9]{1,2}) stycznia ([0-9]{4})(?=($|"|<))', "$1" + "$2" + " січня " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) lutego ([0-9]{4})(?=($|"|<))', "$1" + "$2" + " лютого " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) marca ([0-9]{4})(?=($|"|<))', "$1" + "$2" + " березня " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) kwietnia ([0-9]{4})(?=($|"|<))', "$1" + "$2" + " квітня " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) maja ([0-9]{4})(?=($|"|<))', "$1" + "$2" + " травня " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) czerwca ([0-9]{4})(?=($|"|<))', "$1" + "$2" + " червня " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) lipca ([0-9]{4})(?=($|"|<))', "$1" + "$2" + " липня " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) sierpnia ([0-9]{4})(?=($|"|<))', "$1" + "$2" + " серпня " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) września ([0-9]{4})(?=($|"|<))', "$1" + "$2" + " вересня " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) października ([0-9]{4})(?=($|"|<))', "$1" + "$2" + " жовтня " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) listopada ([0-9]{4})(?=($|"|<))', "$1" + "$2" + " листопада " + "$3");
    d = r(d, '(^|="|>)([0-9]{1,2}) grudnia ([0-9]{4})(?=($|"|<))', "$1" + "$2" + " грудня " + "$3");
 
    d = r(d, '(^|="|>)styczeń(?=($|"|<))', "$1" + "січень");
    d = r(d, '(^|="|>)luty(?=($|"|<))', "$1" + "лютий");
    d = r(d, '(^|="|>)marzec(?=($|"|<))', "$1" + "Березень");
    d = r(d, '(^|="|>)kwiecień(?=($|"|<))', "$1" + "Квітень");
    d = r(d, '(^|="|>)maj(?=($|"|<))', "$1" + "травень");
    d = r(d, '(^|="|>)czerwiec(?=($|"|<))', "$1" + "Червень");
    d = r(d, '(^|="|>)lipiec(?=($|"|<))', "$1" + "Липень");
    d = r(d, '(^|="|>)sierpień(?=($|"|<))', "$1" + "Серпень");
    d = r(d, '(^|="|>)wrzesień(?=($|"|<))', "$1" + "вересень");
    d = r(d, '(^|="|>)październik(?=($|"|<))', "$1" + "Жовтень");
    d = r(d, '(^|="|>)listopad(?=($|"|<))', "$1" + "Листопад");
    d = r(d, '(^|="|>)grudzień(?=($|"|<))', "$1" + "грудень");
 
    d = r(d, '(^|="|>)około minuty temu(?=($|"|<))', "$1" + "окола мынуты тому");
    d = r(d, '(^|="|>)kilka sekund temu(?=($|"|<))', "$1" + "пару секунд тому");
    d = r(d, '(^|="|>)około godziny temu(?=($|"|<))', "$1" + "окола годыну тому");
    d = r(d, '(^|="|>)godzinę temu(?=($|"|<))', "$1" + "годыну тому");
    d = r(d, '(^|="|>)([0-9,]+) godz\\. temu(?=($|"|<))', "$1" + "$2" + " годын(ы) тому");
    d = r(d, '(^|="|>)minutę temu(?=($|"|<))', "$1" + "мынута тому");
    d = r(d, '(^|="|>)([0-9,]+) minut\\(y\\) temu(?=($|"|<))', "$1" + "$2" + " мынут тому");
    d = r(d, '(^|="|>)sekundę temu(?=($|"|<))', "$1" + "секунду тому");
    d = r(d, '(^|="|>)([0-9,]+) sekund\\(y\\) temu(?=($|"|<))', "$1" + "$2" + " секунд тому");
 
    d = r(d, '(^|="|>)Wczoraj(?=($|"|<))', "$1" + "вчера");
    d = r(d, '(^|="|>)Poniedziałek(?=($|"|<))', "$1" + "понедiлoк");
    d = r(d, '(^|="|>)Wtorek(?=($|"|<))', "$1" + "віторок");
    d = r(d, '(^|="|>)Środa(?=($|"|<))', "$1" + "середа");
    d = r(d, '(^|="|>)Czwartek(?=($|"|<))', "$1" + "четверь");
    d = r(d, '(^|="|>)Piątek(?=($|"|<))', "$1" + "пятніця");
    d = r(d, '(^|="|>)Sobota(?=($|"|<))', "$1" + "субота");
    d = r(d, '(^|="|>)Niedziela(?=($|"|<))', "$1" + "недїля");
 
    d = r(d, '(^|="|>)w poniedziałek(?=($|"|<))', "$1" + "в понедїлoк");
    d = r(d, '(^|="|>)we wtorek(?=($|"|<))', "$1" + "в віторок");
    d = r(d, '(^|="|>)w środę(?=($|"|<))', "$1" + "в середy");
    d = r(d, '(^|="|>)w czwartek(?=($|"|<))', "$1" + "в четвер");
    d = r(d, '(^|="|>)w piątek(?=($|"|<))', "$1" + "в пятніцy");
    d = r(d, '(^|="|>)w sobotę(?=($|"|<))', "$1" + "в суботy");
    d = r(d, '(^|="|>)w niedzielę(?=($|"|<))', "$1" + "в недїлy");
 
    d = r(d, '(^|="|>)w zeszły poniedziałek(?=($|"|<))', "$1" + "в понедїлoк");
    d = r(d, '(^|="|>)w zeszły wtorek(?=($|"|<))', "$1" + "в віторок");
    d = r(d, '(^|="|>)w zeszłą środę(?=($|"|<))', "$1" + "в середy");
    d = r(d, '(^|="|>)w zeszły czwartek(?=($|"|<))', "$1" + "в четвер");
    d = r(d, '(^|="|>)w zeszły piątek(?=($|"|<))', "$1" + "в пятніцy");
    d = r(d, '(^|="|>)w zeszłą sobotę(?=($|"|<))', "$1" + "в суботy");
    d = r(d, '(^|="|>)w zeszłą niedzielę(?=($|"|<))', "$1" + "в недїлy");
 
    d = r(d, '(^|="|>)Jutro o ([^<" ]+)(?=($|"|<))', "$1" + "Заран о " + "$2");
    d = r(d, '(^|="|>)Wczoraj o ([^<" ]+)(?=($|"|<))', "$1" + "Вчера о " + "$2");
    d = r(d, '(^|="|>)Poniedziałek\, ([0-9:apm]+)(?=($|"|<))', "$1" + "в понедїлoк o " + "$2");
    d = r(d, '(^|="|>)Wtorek\, ([0-9:apm]+)(?=($|"|<))', "$1" + "в віторок o " + "$2");
    d = r(d, '(^|="|>)Środa\, ([0-9:apm]+)(?=($|"|<))', "$1" + "в середy o " + "$2");
    d = r(d, '(^|="|>)Czwartek\, ([0-9:apm]+)(?=($|"|<))', "$1" + "в четвер o " + "$2");
    d = r(d, '(^|="|>)Piątek\, ([0-9:apm]+)(?=($|"|<))', "$1" + "в пятніцy o " + "$2");
    d = r(d, '(^|="|>)Sobota\, ([0-9:apm]+)(?=($|"|<))', "$1" + "в суботy o " + "$2");
    d = r(d, '(^|="|>)Niedziela\, ([0-9:apm]+)(?=($|"|<))', "$1" + "в недїлy o " + "$2");
 
    d = r(d, '(^|="|>)ULUBIONE(?=($|"|<))', "$1" + "ВИБРАНЕ");
    d = r(d, '(^|="|>)GRUPY(?=($|"|<))', "$1" + "ГРУПЫ");
    d = r(d, '(^|="|>)STRONY(?=($|"|<))', "$1" + "СТОРОНЫ");
    d = r(d, '(^|="|>)WIĘCEJ(?=($|"|<))', "$1" + "ВЕЦЕ");
    d = r(d, '(^|="|>)STRONY I REKLAMY(?=($|"|<))', "$1" + "СТОРОНЫ Ы РЕГЛАМЫ");
    d = r(d, '(^|="|>)ZNAJOMI(?=($|"|<))', "$1" + "ЗНАЭМЕ");
    d = r(d, '(^|="|>)APLIKACJE(?=($|"|<))', "$1" + "АПЛЫКАЦЫЙИ");
    d = r(d, '(^|="|>)NAJNOWSZY WPIS(?=($|"|<))', "$1" + "НАЙБАРЖЕ НОВЫЙ ВПЫС");
 
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>), (<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) lubią to\.(?=($|"|<))', "$1" + "$2" + ", " + "$3" + " i " + "$4" + " Лубыт тото.");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) oraz (<a [^>]+>[^<]+</a>) lubią to\.(?=($|"|<))', "$1" + "$2" + " i " + "$3" + " Лубыт тото.");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) oraz (<a [^>]+>[^<]+</a>) go lubią\.(?=($|"|<))', "$1" + "$2" + " i " + "$3" + " вiн Лубыт ім.");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) oraz (<a [^>]+>[^<]+</a>) ją lubią\.(?=($|"|<))', "$1" + "$2" + " i " + "$3" + " вiна Лубыт ім.");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) oraz (<a [^>]+>[^<]+</a>) ich lubią\.(?=($|"|<))', "$1" + "$2" + " i " + "$3" + " ім Лубыт.");
    d = r(d, '(^|>)1 inny znajoэму(?=($|<))', "$1" + "1 iншый знаэмы");
    d = r(d, '(^|>)([0-9,]+) innych znajoэмуch(?=($|<))', "$1" + "$2" + " iншыйx знаэмыx");
    d = r(d, '(^|>)1 inny(?=($|<))', "$1" + "1 iншы");
    d = r(d, '(^|>)([0-9,]+) innych(?=($|<))', "$1" + "$2" + " iншыйx");
    d = r(d, '(^|>)(1?1) innych członków(?=($|<))', "$1" + "$2" + " iншыйx");
    d = r(d, '(^|>)([0-9,]+) innych członków(?=($|<))', "$1" + "$2" + " iншыйx");
    d = r(d, '(^|>)1 inna osoba(?=($|<))', "$1" + "1 iншыйx лудей");
    d = r(d, '(^|>)inne osoby \\(([0-9,]+)\\)(?=($|<))', "$1" + "$2" + " iншыйx луды");
    d = r(d, '(^|>)(1?1) innych osób(?=($|<))', "$1" + "$2" + " iншый");
    d = r(d, '(^|>)([0-9,]+) innych osób(?=($|<))', "$1" + "$2" + " iншыйx");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) dodał\\(a\\) nowe zdjęcie\.(?=($|"|<))', "$1" + "$2" + " додала нову знымку.");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) dodał\\(a\\) (1?1) nowe zdjęcie\.(?=($|"|<))', "$1" + "$2" + " додал(а) " + "$3" + " нову знымку. ");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) dodał\\(a\\) nowe zdjęcia \\((1?[2-4])\\)\.(?=($|"|<))', "$1" + "$2" + " додал(а) " + "$3" + " новы знымкы. ");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) dodał\\(a\\) nowe zdjęcia \\((1?[3-9])\\)\.(?=($|"|<))', "$1" + "$2" + " додал(а) " + "$3" + " новыx знымкы. ");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) dodał\\(a\\) nowe zdjęcia \\(([0-9,]+)\\)\.(?=($|"|<))', "$1" + "$2" + " додал(а) " + "$3" + " новыx знымкы. ");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) zaktualizował swoje zdjęcie w tle\.(?=($|"|<))', "$1" + "$2" + " зминыл свою нову змымку зо заду. ");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) zaktualizowała swoje zdjęcie w tle\.(?=($|"|<))', "$1" + "$2" + " зминыла свою  змымку зо заду. ");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) zaktualizował\\(a\\) swoje zdjęcie w tle\.(?=($|"|<))', "$1" + "$2" + " зминыл(а) свою змымку зо заду. ");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) są teraz znajoэмуmi\.(?=($|"|<))', "$1" + "$2" + " i " + "$3" + " сут тераз знаэмымы.");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) są teraz znajoэмуmi z (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " i " + "$3" + " сут тераз знаэмымы вiд " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>), (<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) są teraz znajoэмуmi\.(?=($|"|<))', "$1" + "$2" + ", " + "$3" + " i " + "$4" + " сут тераз знаэмымы.");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) od\\: (<a [^>]+>[^<]+</a>)(?=($|"|<))', "$1" + "$2" + " вiд: " + "$3" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) lubi (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " Лубытму " + "$3" + "овы.");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentował (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " скоментувал " + "$3" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentowała (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " скоментувалa " + "$3" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentował\\(a\\) (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " скоментувал(a) " + "$3" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) lubią (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " i " + "$3" + " Лубытму " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) lubią to\.(?=($|"|<))', "$1" + "$2" + " i " + "$3" + " Лубыт тото.");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) udostępnili\\(ły\\) (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " i " + "$3" + " далы доступ до " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) udostępnili (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " i " + "$3" + " далы доступ до " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) udostępniły (<a [^>]+>[^<]+</a>)(?=($|"|<))', "$1" + "$2" + " i " + "$3" + " далы доступ до " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) udostępnił (<a [^>]+>)bild</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " далы доступ до " + "$3" + "знымкы" + "</a>" + " вiд " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) udostępniła (<a [^>]+>)bild</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " далы доступ до " + "$3" + "знымкы" + "</a>" + " вiд " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) udostępnił\\(a\\) (<a [^>]+>)bild</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " далы доступ до " + "$3" + "знымкы" + "</a>" + " вiд " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) udostępnili\\(ły\\) (<a [^>]+>)bild</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " i " + "$3" + " далы доступ до " + "$4" + "знымкы" + "</a>" + " вiд " + "$5" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) udostępnił (<a [^>]+>)post</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " далы доступ до " + "$3" + "поста" + "</a>" + " вiд " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) udostępniła (<a [^>]+>)post</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " далы доступ до " + "$3" + "поста" + "</a>" + " вiд " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) udostępnił\\(a\\) (<a [^>]+>)post</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " далы доступ до " + "$3" + "поста" + "</a>" + " вiд " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) udostępnili\\(ły\\) (<a [^>]+>)post</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " i " + "$3" + " далы доступ до " + "$4" + "поста" + "</a>" + " вiд " + "$5" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) udostępnił (<a [^>]+>)status</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " далы доступ до " + "$3" + "статуса" + "</a>" + " вiд " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) udostępniła (<a [^>]+>)status</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " далы доступ до " + "$3" + "статуса" + "</a>" + " вiд " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) udostępnił\\(a\\) (<a [^>]+>)status</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " далы доступ до " + "$3" + "статуса" + "</a>" + " вiд " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) udostępnili\\(ły\\) (<a [^>]+>)status</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " i " + "$3" + " далы доступ до " + "$4" + "статуса" + "</a>" + " вiд " + "$5" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) udostępnił album użytkownika (<a [^>]+>[^<]+</a>)\\: (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " далы доступ до " + "албумa" + "</a>" + " вiд " + "$3" + ": " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) udostępniła album użytkownika (<a [^>]+>[^<]+</a>)\\: (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " далы доступ до " + "албумa" + "</a>" + " вiд " + "$3" + ": " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) udostępnił\\(a\\) album użytkownika (<a [^>]+>[^<]+</a>)\\: (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " далы доступ до " + "албумa" + "</a>" + " вiд " + "$3" + ": " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) udostępnili\\(ły\\) album użytkownika (<a [^>]+>[^<]+</a>)\\: (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " далы доступ до " + "албумa" + "</a>" + " вiд " + "$3" + ": " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) udostępnił (<a [^>]+>)album</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " далы доступ до " + "$3" + "албумa" + "</a>" + " вiд " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) udostępniła (<a [^>]+>)album</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " далы доступ до " + "$3" + "албумa" + "</a>" + " вiд " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) udostępnił\\(a\\) (<a [^>]+>)album</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " далы доступ до " + "$3" + "албумa" + "</a>" + " вiд " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) udostępnili\\(ły\\) (<a [^>]+>)album</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " i " + "$3" + " далы доступ до " + "$4" + "албумa" + "</a>" + " вiд " + "$5" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) udostępnił\\(a\\) (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " дал(a) доступ до " + "$3" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) udostępnił (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " дал доступ до " + "$3" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) udostępniła (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " далa доступ до " + "$3" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) zmienili swoje zdjęcia profilowe\.(?=($|"|<))', "$1" + "$2" + " i " + "$3" + "маюы новы знымкы профылолы" + ".");
 
    d = r(d, '(^|="|>) przez (?=($|"|<))', "$1" + " про ");
    d = r(d, '(^|="|>) przez\\: (?=($|"|<))', "$1" + " про ");
    d = r(d, '(^|="|>)telefon komórkowy(?=($|"|<))', "$1" + "комурку");
    d = r(d, '(^|="|>)Szukaj znajoэмуch(?=($|"|<))', "$1" + "гладай знаэмых");
    d = r(d, '(^|="|>)Wiadomość(?=($|"|<))', "$1" + "вист");
    d = r(d, '(^|="|>) dzisiaj obchodzi urodziny(?=($|"|<))', "$1" + " внескы маэ уродыны");
    d = r(d, '(^|="|>)Zobacz wszystkie komentarze\\: ([0-9,]+)(?=($|"|<))', "$1" + "покаж всзыткы " + "$2" + " коментары.");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) ma nowych znajoэмуch\\: (<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " маэ новых знаэмых: " + "$3" + " i " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) lubi\\: (<a [^>]+>[^<]+</a>)\\.(?=($|"|<))', "$1" + "$2" + " Лубытэму: " + "$3" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) lubi użytkownika (<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " Лубытэму " + "$3" + " i " + "$4" + ".");
    d = r(d, '(^|>)inne strony \\((1?1)\\)(?=($|<))', "$1" + "$2" + " инсзы стороны");
    d = r(d, '(^|>)inne strony \\((1?[2-9])\\)(?=($|<))', "$1" + "$2" + " инсзым стороны");
    d = r(d, '(^|="|>)O czym teraz эмуślisz\\?(?=($|"|<))', "$1" + "О дачым думаш?");
    d = r(d, '(^|="|>)Zdjęcie / film(?=($|"|<))', "$1" + "знымку/фылм");
    d = r(d, '(^|="|>)Udostępniono ([0-9,]+) razy(?=($|"|<))', "$1" + "$2" + "далы доступ до того.");
    d = r(d, '(^|="|>)Dodaj komentarz\.\.\.(?=($|"|<))', "$1" + "скоментуй");
    d = r(d, '(^|="|>)([0-9,]+) wspólnych znajoэмуch(?=($|"|<))', "$1" + "$2" + " спiлных знаэмых");
    d = r(d, '(^|="|>)Zdjęcia na tablicy \\(([0-9,]+)\\)(?=($|"|<))', "$1" + "знымкы на таблыц " + "(" + "$2" + ")");
    d = r(d, '(^|="|>)Zdjęcia profilowe \\(([0-9,]+)\\)(?=($|"|<))', "$1" + "профылове знымкы " + "(" + "$2" + ")");
    d = r(d, '(^|="|>)Zdjęcia w tle \\(([0-9,]+)\\)(?=($|"|<))', "$1" + "знымкы зо заду" + "(" + "$2" + ")");
    d = r(d, '(^|="|>)Ty to lubisz\.(?=($|"|<))', "$1" + "Лубыш тото.");
    d = r(d, '(^|="|>)1 wspólny znajoэму(?=($|"|<))', "$1" + "1 вспилны знаэмы");
    d = r(d, '(^|="|>)Bliscy znajomi(?=($|"|<))', "$1" + "блыже знаэме");
    d = r(d, '(^|="|>)Uczęszczał do\\: (?=($|"|<))', "$1" + "Ходыл до:: ");
    d = r(d, '(^|="|>)Uczęszczała do\\: (?=($|"|<))', "$1" + "Ходылa до:: ");
    d = r(d, '(^|="|>)Uczęszczał\\(a\\) do\\: (?=($|"|<))', "$1" + "Ходыл(a) до:: ");
    d = r(d, '(^|="|>)Pracował\\(a\\) w (?=($|"|<))', "$1" + "Робыл(а) в ");
    d = r(d, '(^|="|>)Pracowała w (?=($|"|<))', "$1" + "Робыл(а) в ");
    d = r(d, '(^|="|>)Pracował w (?=($|"|<))', "$1" + "Робыл в ");
    d = r(d, '(^|="|>)Utwórz reklamę(?=($|"|<))', "$1" + "Зроб рекламу");
    d = r(d, '(^|="|>)Udostępniono 1 raz(?=($|"|<))', "$1" + "1 раз далo доступ до того.");
    d = r(d, '(^|="|>)Utwórz stronę(?=($|"|<))', "$1" + "Зроб сторону");
    d = r(d, '(^|="|>)Pokaż wszystko(?=($|"|<))', "$1" + "Покале вшытко");
    d = r(d, '(^|="|>)Powiadomienia(?=($|"|<))', "$1" + "висти");
    d = r(d, '(^|="|>)Filozofia(?=($|"|<))', "$1" + "Фылозофия");
    d = r(d, '(^|="|>)Pokaż post(?=($|"|<))', "$1" + "Покале пост");
    d = r(d, '(^|="|>)Nie lubię(?=($|"|<))', "$1" + "Не Лубыт мi тото");
    d = r(d, '(^|="|>)Praca(?=($|"|<))', "$1" + "Робота");
    d = r(d, '(^|="|>)Reklama(?=($|"|<))', "$1" + "Реклама");
    d = r(d, '(^|="|>)Pytanie(?=($|"|<))', "$1" + "Запытання");
    d = r(d, '(^|="|>)Twórcy aplikacji(?=($|"|<))', "$1" + "Програмысты");
    d = r(d, '(^|="|>)Rodzina(?=($|"|<))', "$1" + "Родына");
    d = r(d, '(^|="|>)Lubię to!(?=($|"|<))', "$1" + "Лубыт мi тото");
    d = r(d, '(^|="|>)Lubię tę stronę!(?=($|"|<))', "$1" + "Лубыт мi тотa Сторона");
    d = r(d, '(^|="|>)Znajdź więcej stron(?=($|"|<))', "$1" + "Гладай веце сторон");
    d = r(d, '(^|="|>)Wiadomości(?=($|"|<))', "$1" + "Висти");
    d = r(d, '(^|="|>)Polski(?=($|"|<))', "$1" + "Лемкивскый язык");
    d = r(d, '(^|="|>)Wydarzenie z życia(?=($|"|<))', "$1" + "Здарыння з жытя");
    d = r(d, '(^|="|>)Aktualności(?=($|"|<))', "$1" + "Висти");
    d = r(d, '(^|="|>)Profil(?=($|"|<))', "$1" + "Профыл");
    d = r(d, '(^|="|>)Dodaj komentarz(?=($|"|<))', "$1" + "Скоментуй");
    d = r(d, '(^|="|>)Oś czasu(?=($|"|<))', "$1" + "Преглад жытя");
    d = r(d, '(^|="|>)Prywatność(?=($|"|<))', "$1" + "Прыватнiст");
    d = r(d, '(^|="|>)Kliknięcia Lubię to!(?=($|"|<))', "$1" + "Лума клуканого:Лубыт тото");
    d = r(d, '(^|="|>)Mapa(?=($|"|<))', "$1" + "Мапа");
    d = r(d, '(^|="|>)Anuluj(?=($|"|<))', "$1" + "вiдciep");
    d = r(d, '(^|="|>)Wydarzenia(?=($|"|<))', "$1" + "Здарення");
    d = r(d, '(^|="|>)Wyloguj się(?=($|"|<))', "$1" + "вылогуй сiа");
    d = r(d, '(^|="|>)Zdjęcia(?=($|"|<))', "$1" + "Знымкы");
    d = r(d, '(^|="|>)Regulamin(?=($|"|<))', "$1" + "Рехуламын");
    d = r(d, '(^|="|>)Znajomi(?=($|"|<))', "$1" + "Знаэме");
    d = r(d, '(^|="|>)O Facebooku(?=($|"|<))', "$1" + "О Фацебоока");
    d = r(d, '(^|="|>)Więcej(?=($|"|<))', "$1" + "Веце");
    d = r(d, '(^|="|>)Status(?=($|"|<))', "$1" + "Статус");
    d = r(d, '(^|="|>)przez\\:(?=($|"|<))', "$1" + "про:");
    d = r(d, '(^|="|>)Zdjęcie(?=($|"|<))', "$1" + "Знымка");
    d = r(d, '(^|="|>)Miejsca(?=($|"|<))', "$1" + "Мiсца");
    d = r(d, '(^|="|>)Udostępnij(?=($|"|<))', "$1" + "Дай доступ до того");
    d = r(d, '(^|="|>)Albuэму(?=($|"|<))', "$1" + "Ялбумы");
    d = r(d, '(^|="|>)Zobacz wszystko(?=($|"|<))', "$1" + "Обач вшытко");
    d = r(d, '(^|="|>)Zobacz znajomość(?=($|"|<))', "$1" + "Обач знаэмiст");
    d = r(d, '(^|="|>)Zamknij(?=($|"|<))', "$1" + "Запрый");
    d = r(d, '(^|="|>)Pomoc(?=($|"|<))', "$1" + "Помоч");
    d = r(d, '(^|="|>)Miejsce(?=($|"|<))', "$1" + "Мiсца");
    d = r(d, '(^|="|>)Szukaj(?=($|"|<))', "$1" + "Гладай");
    d = r(d, '(^|="|>)Aplikacje(?=($|"|<))', "$1" + "Аплыкацыйи");
    d = r(d, '(^|="|>)Strona główna(?=($|"|<))', "$1" + "Головна сторона");
    d = r(d, '(^|="|>)Teraz(?=($|"|<))', "$1" + "Тераз");
    d = r(d, '(^|="|>)Do:(?=($|"|<))', "$1" + "До:");
    d = r(d, '(^|="|>)Wyszukaj osoby, miejsca i inne(?=($|"|<))', "$1" + "Гладай лудей, мiсца и iнче");
    d = r(d, '(^|="|>)Przejdź do trybu offline(?=($|"|<))', "$1" + "Вылуч сiа");
    d = r(d, '(^|="|>)Pokaż wszystkie(?=($|"|<))', "$1" + "Покале вшытке");
    d = r(d, '(^|="|>)Dodaj do tej listy(?=($|"|<))', "$1" + "Додей до той лысты");
    d = r(d, '(^|="|>)Ukryj(?=($|"|<))', "$1" + "Сховай");
    d = r(d, '(^|="|>)Ostatnie posty innych użytkowników na stronie(?=($|"|<))', "$1" + "Останне посты iншых ужытковныкiв на сторони");
    d = r(d, '(^|="|>)Napisz komentarz\\…(?=($|"|<))', "$1" + "Напыш коментар...");
    d = r(d, '(^|="|>)Odpowiedz(?=($|"|<))', "$1" + "Одповiч");
    d = r(d, '(^|="|>)Pliki cookie(?=($|"|<))', "$1" + "Цоокiе");
    d = r(d, '(^|="|>)Udostępnione dla:(?=($|"|<))', "$1" + "Даны доступ дла:");
    d = r(d, '(^|="|>)Tryb szybkiej odpowiedzi: naciśnij Enter, aby wysłać(?=($|"|<))', "$1" + "Прутка одповид: Втысный ентер, авы вiдповисты");
    d = r(d, '(^|="|>)Wykonaj zdjęcie lub nagraj film(?=($|"|<))', "$1" + "Зроб знымку албо награй выдео");
    d = r(d, '(^|="|>)Dołącz plik(?=($|"|<))', "$1" + "Додай плык");
    d = r(d, '(^|="|>)Osoby\\, które możesz znać(?=($|"|<))', "$1" + "Тых лудей мозеш знаты");
    d = r(d, '(^|="|>)Zdjęcia znajoэмуch(?=($|"|<))', "$1" + "Знымкы знаэмых");
    d = r(d, '(^|="|>)Wyszukaj w konwersacji(?=($|"|<))', "$1" + "Гладай в розмовi");
    d = r(d, '(^|="|>)Działania(?=($|"|<))', "$1" + "Роблення");
    d = r(d, '(^|="|>)Oznacz jako nieprzeczytane(?=($|"|<))', "$1" + "Зазнач яко непречытане");
    d = r(d, '(^|="|>)Prześlij...(?=($|"|<))', "$1" + "Преслий...");
    d = r(d, '(^|="|>)Otwórz w czacie(?=($|"|<))', "$1" + "Отвер в чац");
    d = r(d, '(^|="|>)Usuń wiadomości...(?=($|"|<))', "$1" + "Усун вiстi...");
    d = r(d, '(^|="|>)Zgłoś jako spam...(?=($|"|<))', "$1" + "Зоголос яко спам...");
    d = r(d, '(^|="|>)Zgłoś konwersację...(?=($|"|<))', "$1" + "Зоголос розмову...");
    d = r(d, '(^|="|>)Przenieś do folderu „Inne”(?=($|"|<))', "$1" + "Пренес до каталога :"Iнче"");
    d = r(d, '(^|="|>)Korzystaj z Facebooka w innym języku.(?=($|"|<))', "$1" + "Корыстай з Фацебоока в инчым языку.");
    d = r(d, '(^|="|>)Oznaczeni — (?=($|"|<))', "$1" + "Означены — ");
    d = r(d, '(^|="|>)Ładowanie...(?=($|"|<))', "$1" + "Ладування...");
    d = r(d, '(^|="|>)Polish(?=($|"|<))', "$1" + "Lemko");
    d = r(d, '(^|="|>)Wydarzenie, ważne wydarzenie \\+(?=($|"|<))', "$1" + "Вазне здарiiня");
    d = r(d, '(^|="|>)SORTUJ: OD NAJNOWSZYCH(?=($|"|<))', "$1" + "СОРТУЙ: НАЙПЕРВШЕ НАЙНОВШЕ");
    d = r(d, '(^|="|>)Najnowsze(?=($|"|<))', "$1" + "Найновше");
    d = r(d, '(^|="|>)Najciekawsze zdarzenia(?=($|"|<))', "$1" + "Найпарже гладане");
    d = r(d, '(^|="|>)Powrót do albumu(?=($|"|<))', "$1" + "Зверный сiа до албума");
    d = r(d, '(^|="|>)Dodaj znajomego(?=($|"|<))', "$1" + "Додей знаэмого");
    d = r(d, '(^|="|>)Zobacz tłumaczenie(?=($|"|<))', "$1" + "Покале преклад");
    d = r(d, '(^|="|>)Autor\\: (?=($|"|<))', "$1" + "Аутор: ");
    d = r(d, '(^|="|>)Aplikacje i gry(?=($|"|<))', "$1" + "Аплыкацыйi i гры");
    d = r(d, '(^|="|>)Moje albuэму(?=($|"|<))', "$1" + "Моэ албумы");
    d = r(d, '(^|="|>)Dodaj film(?=($|"|<))', "$1" + "Додей выдео");
    d = r(d, '(^|="|>)Korzystaj z Facebooka jako:(?=($|"|<))', "$1" + "Корыстай з Фацебоока яко::");
    d = r(d, '(^|="|>)Reklamuj się(?=($|"|<))', "$1" + "Рекламуй сiа");
    d = r(d, '(^|="|>)Ustawienia konta(?=($|"|<))', "$1" + "Уставлення конта");
    d = r(d, '(^|="|>)Ustawienia prywatności(?=($|"|<))', "$1" + "Уставлення прыватне");
    d = r(d, '(^|="|>)Pomoc(?=($|"|<))', "$1" + "прыватне");
    d = r(d, '(^|="|>)Zarządzaj listą(?=($|"|<))', "$1" + "Ряд листом");
    d = r(d, '(^|="|>)Zmień nazwę listy(?=($|"|<))', "$1" + "Змiн назву лысты");
    d = r(d, '(^|="|>)Edytuj listę(?=($|"|<))', "$1" + "Едытуй лысту");
    d = r(d, '(^|="|>)Wybierz typy informacji...(?=($|"|<))', "$1" + "Выбер тыпы iнгормацыйi...");
    d = r(d, '(^|="|>)Ustawienia powiadomień...(?=($|"|<))', "$1" + "Уставлення повядамань...");
    d = r(d, '(^|="|>)Usuń listę(?=($|"|<))', "$1" + "Усун лысту");
    d = r(d, '(^|="|>)Pokaż wszystkich(?=($|"|<))', "$1" + "Покале вчыткых");
    d = r(d, '(^|="|>)Proponowane osoby(?=($|"|<))', "$1" + "Пропонованне лудыны");
    d = r(d, '(^|="|>)Na tej liście (?=($|"|<))', "$1" + "На той лысц");
    d = r(d, '(^|="|>)Pokaż więcej sugestii(?=($|"|<))', "$1" + "Покале весе пропозыцыйи");
    d = r(d, '(^|="|>)Dodaj(?=($|"|<))', "$1" + "Додей");
    d = r(d, '(^|="|>)Obecnie jesteś offline. Aby czatować ze znajoэмуm, (?=($|"|<))', "$1" + "Тераз эстес офлайн. Зебы бесiдуваты зе знаэмыма, ");
    d = r(d, '(^|="|>)przejdź do trybu online(?=($|"|<))', "$1" + "перейд до трыбу онлiне");
    d = r(d, '(^|="|>)Moje zdjęcia(?=($|"|<))', "$1" + "Мпйi змымкы");
    d = r(d, '(^|="|>)Dalej(?=($|"|<))', "$1" + "Далiй");
    d = r(d, '(^|="|>)Poprzednia(?=($|"|<))', "$1" + "Попередня");
    d = r(d, '(^|="|>)Zdjęcia na tablicy(?=($|"|<))', "$1" + "Знымкы на таблыц");
    d = r(d, '(^|="|>)Oznacz zdjęcie(?=($|"|<))', "$1" + "Ознале змымку");
    d = r(d, '(^|="|>)Album(?=($|"|<))', "$1" + "Албум");
    d = r(d, '(^|="|>)Tablica(?=($|"|<))', "$1" + "Таблыца");
    d = r(d, '(^|="|>)Informacje(?=($|"|<))', "$1" + "Iнформацыйi");
    d = r(d, '(^|="|>)Zdjęcia(?=($|"|<))', "$1" + "Знымкы");
    d = r(d, '(^|="|>)Żonaty(?=($|"|<))', "$1" + "Женяты");
    d = r(d, '(^|="|>)Czat \\(Offline\\)(?=($|"|<))', "$1" + "Чат (оффлiне)");
    d = r(d, '(^|>)link(?=($|<))', "$1" + "Лынк");
    d = r(d, '(^|>)zdjęcie(?=($|<))', "$1" + "Знымка");
    d = r(d, '(^|>)status(?=($|<))', "$1" + "Статус");
    d = r(d, '(^|="|>)Sponsorowane(?=($|"|<))', "$1" + "Спонсоруване");
    d = r(d, '(^|="|>)Zaproszenia do grona znajoэмуch(?=($|"|<))', "$1" + "Запрошыня до знаэмых");
    d = r(d, '(^|="|>)Brak nowych zaproszeń\\.(?=($|"|<))', "$1" + "Не э новых запрошень.");
    d = r(d, '(^|="|>)Zobacz wszystkie zaproszenia od znajoэмуch(?=($|"|<))', "$1" + "Гладай вшыткы запрошення до знаэмых");
    d = r(d, '(^|="|>)Nie masz już aktywnych zaproszeń\\.(?=($|"|<))', "$1" + "Не маш актывных запрошень.");
    d = r(d, '(^|="|>)Znajdź więcej znajoэмуch(?=($|"|<))', "$1" + "Гладай веце знаэмых");
    d = r(d, '(^|="|>)Wyślij nową wiadomość(?=($|"|<))', "$1" + "Выслiй нову вiдомiст");
    d = r(d, '(^|="|>)Zobacz wszystkie wiadomości(?=($|"|<))', "$1" + "Гладай вшытке вiсты");
    d = r(d, '(^|="|>)Zobacz wszystkie powiadomienia(?=($|"|<))', "$1" + "Гладай вшытке завядувлення");
    d = r(d, '(^|="|>)Nowa wiadomość(?=($|"|<))', "$1" + "Нова вiдомiст");
    d = r(d, '(^|="|>)Wiadomości(?=($|"|<))', "$1" + "Вiстi");
    d = r(d, '(^|="|>)Utwórz grupę\.\.\.(?=($|"|<))', "$1" + "Зроб нову групу...");
    d = r(d, '(^|="|>)Wyszukaj\\:(?=($|"|<))', "$1" + "Гладай:");
    d = r(d, '(^|="|>)Nieprzeczytane wiadomości(?=($|"|<))', "$1" + "Непречытане вiстi");
    d = r(d, '(^|="|>)Zarchiwizowane wiadomości(?=($|"|<))', "$1" + "Висти в архывум");
    d = r(d, '(^|="|>)Tylko za pośrednictwem poczty e-mail(?=($|"|<))', "$1" + "Тылкi перез е-маiл");
    d = r(d, '(^|="|>)Wysłane wiadomości(?=($|"|<))', "$1" + "Выслане вiстi");
    d = r(d, '(^|="|>)Brak wiadomości(?=($|"|<))', "$1" + "Не э жадных выстi");
    d = r(d, '(^|="|>)Usuń(?=($|"|<))', "$1" + "Усун");
    d = r(d, '(^|="|>) także lubi to\\.(?=($|"|<))', "$1" + " циж тото лубыт.");
    d = r(d, '(^|="|>)Oznacz jako nieprzeczytane(?=($|"|<))', "$1" + "Ознацз эко непречытане");
    d = r(d, '(^|="|>)Oznacz jako przeczytane(?=($|"|<))', "$1" + "Ознацз эко пречытане");
    d = r(d, '(^|="|>)Zarchiwizuj(?=($|"|<))', "$1" + "Дай до архывум");
    d = r(d, '(^|="|>)Szukaj wiadomości(?=($|"|<))', "$1" + "Гладай вiстi");
    d = r(d, '(^|="|>)Wyślij wiadomość(?=($|"|<))', "$1" + "Выслый вiдомiст");
    d = r(d, '(^|="|>)Inne(?=($|"|<))', "$1" + "Iнше");
    d = r(d, '(^|="|>)Nieprzeczytane(?=($|"|<))', "$1" + "Hепречытане");
    d = r(d, '(^|="|>)Zarchiwizowane(?=($|"|<))', "$1" + "B архывум");
    d = r(d, '(^|="|>)Zobacz\\:(?=($|"|<))', "$1" + "Гладай:");
    d = r(d, '(^|="|>)Załaduj starsze wątki(?=($|"|<))', "$1" + "Заладуй старше розмовы");
    d = r(d, '(^|="|>)Polecane strony(?=($|"|<))', "$1" + "Полецане стороны");
    d = r(d, '(^|="|>)Strony i reklaэму(?=($|"|<))', "$1" + "Стороны i рекламы");
    d = r(d, '(^|="|>)Proponowane grupy(?=($|"|<))', "$1" + "Пропонуване групы");
    d = r(d, '(^|="|>)Polub tę stronę(?=($|"|<))', "$1" + "Полуб тоту сторону");
    d = r(d, '(^|="|>)Utwórz wydarzenie(?=($|"|<))', "$1" + "Зроб нове здариння");
    d = r(d, '(^|="|>)Pokaż wcześniejsze komentarze(?=($|"|<))', "$1" + "Покале попереднi коментары");
    d = r(d, '(^|="|>)Lubisz to\\!(?=($|"|<))', "$1" + "Лубыш тото");
    d = r(d, '(^|="|>)Pokaż udostępnioną zawartość(?=($|"|<))', "$1" + "Покале доступно завартiст");
    d = r(d, '(^|="|>)Dołącz do grupy(?=($|"|<))', "$1" + "Прыступ до групы");
    d = r(d, '(^|="|>)Kliknięcia \\„Lubię to\\”(?=($|"|<))', "$1" + "Лубыт тото");
    d = r(d, '(^|="|>)Narodziny(?=($|"|<))', "$1" + "Народженя");
    d = r(d, '(^|="|>)LISTY(?=($|"|<))', "$1" + "ЛЫСТЫ");
    d = r(d, '(^|="|>)Zmień zdjęcie w tle(?=($|"|<))', "$1" + "Змин задню знымку");
    d = r(d, '(^|="|>)Edytuj zdjęcie profilowe(?=($|"|<))', "$1" + "Едытуй профылову знымку");
    d = r(d, '(^|="|>)Subskrypcje(?=($|"|<))', "$1" + "Субскрыпцйi");
    d = r(d, '(^|="|>)Zaktualizuj informacje(?=($|"|<))', "$1" + "Заактуалызуй ынформацыйi");
    d = r(d, '(^|="|>)Dziennik aktywności(?=($|"|<))', "$1" + "Твоя актывнiст");
    d = r(d, '(^|="|>)Wyświetl jako\.\.\.(?=($|"|<))', "$1" + "Покале яко...");
    d = r(d, '(^|="|>)Dodaj wizytówkę do swojej strony(?=($|"|<))', "$1" + "Додей вiзытувку до той стороны");
    d = r(d, '(^|="|>)Opublikuj(?=($|"|<))', "$1" + "Опуплыкуй");
    d = r(d, '(^|="|>)Prześlij zdjęcie / film(?=($|"|<))', "$1" + "Переслiй знымку/фылм");
    d = r(d, '(^|="|>)Skorzystaj z kamery internetowej(?=($|"|<))', "$1" + "Скорыстай з камеры iнтернетовой");
    d = r(d, '(^|="|>)Utwórz album ze zdjęciami(?=($|"|<))', "$1" + "Зроб албум зе знымкамы");
    d = r(d, '(^|="|>)Zapytaj o coś\.\.\.(?=($|"|<))', "$1" + "Запытайся о штосы...");
    d = r(d, '(^|="|>)Dodaj opcję\.\.\.(?=($|"|<))', "$1" + "Додей можнiст");
    d = r(d, '(^|="|>)Dodaj opcje ankiety(?=($|"|<))', "$1" + "Додей можнист анкэты");
    d = r(d, '(^|="|>)Zezwalaj wszystkim na dodawanie opcji(?=($|"|<))', "$1" + "Зезвалай вшыткым на додаваня iнсзых можносты");
    d = r(d, '(^|="|>)Tylko ja(?=($|"|<))', "$1" + "Тылкi я");
    d = r(d, '(^|="|>)Znajomi poza dalszymi znajoэмуmi(?=($|"|<))', "$1" + "Знаэме без далшых знаэмех");
    d = r(d, '(^|="|>)Ustawienie niestandardowe(?=($|"|<))', "$1" + "Инакше");
    d = r(d, '(^|="|>)Wróć(?=($|"|<))', "$1" + "Вертай");
    d = r(d, '(^|="|>)Dalsi znajomi(?=($|"|<))', "$1" + "Далше знаэме");
    d = r(d, '(^|="|>) w pobliżu\\: (?=($|"|<))', "$1" + " Блыско ");
    d = r(d, '(^|="|>)Ulubione(?=($|"|<))', "$1" + "Улубэне");
    d = r(d, '(^|="|>)Niedawne(?=($|"|<))', "$1" + "Недавне");
    d = r(d, '(^|="|>)Dołącz(?=($|"|<))', "$1" + "Долуч");
    d = r(d, '(^|="|>)Więcej ostatniej aktywności(?=($|"|<))', "$1" + "Покале веце останных актывнистi");
    d = r(d, '(^|="|>)Zobacz wszystkie listy\.\.\.(?=($|"|<))', "$1" + "Зобале вшыткы лысты...");
    d = r(d, '(^|="|>)Zobacz wszystkie(?=($|"|<))', "$1" + "Зобале вшыткe");
    d = r(d, '(^|>) \\(([0-9,]+) zdjęcie\\)(?=($|<))', "$1" + " (" + "$2" + " знымка)");
    d = r(d, '(^|>) \\(([0-9,]+) zdjęcia\\)(?=($|<))', "$1" + " (" + "$2" + " знымкы)");
    d = r(d, '(^|>) \\(([0-9,]+) zdjęć\\)(?=($|<))', "$1" + " (" + "$2" + " знымок)");
    d = r(d, '(^|>) \\(([0-9,]+) zdjęć\\)(?=($|<))', "$1" + " (" + "$2" + " знымок)");
    d = r(d, '(^|="|>)([0-9,]+) osób(?=($|"|<))', "$1" + "$2" + " Людей");
    d = r(d, '(^|="|>)([0-9,]+) osoby(?=($|"|<))', "$1" + "$2" + " Людей");
    d = r(d, '(^|="|>) lubi to\.(?=($|"|<))', "$1" + " Лубыт тото.");
    d = r(d, '(^|="|>) lubią to\.(?=($|"|<))', "$1" + " Лубыт тото.");
    d = r(d, '(^|="|>)([0-9,]+) osób o tym mówi(?=($|"|<))', "$1" + "$2" + " осiб о тым бесiдуэ");
    d = r(d, '(^|="|>)([0-9,]+) osoby o tym mówią(?=($|"|<))', "$1" + "$2" + " особы о тым бесiдуют");
    d = r(d, '(^|="|>)([0-9,]+).([0-9,]+) osób lubi to \\· ([0-9,]+) osób o tym mówi(?=($|"|<))', "$1" + "$2" + "." + "$3" + " луды лубыт тото , a " + "$4" + " о тым бесiдуэ");
    d = r(d, '(^|="|>)([0-9,]+) osób lubi to \\· ([0-9,]+) osób o tym mówi(?=($|"|<))', "$1" + "$2" + " луды лубыт тото, a " + "$3" + " о тым бесiдуэ");
    d = r(d, '(^|="|>)([0-9,]+) osób lubi to \\· ([0-9,]+).([0-9,]+) osób o tym mówi(?=($|"|<))', "$1" + "$2" + " луды лубыт тото, a " + "$3" + "." + "$4" + " о тым бесiдуэ");
    d = r(d, '(^|="|>)([0-9,]+).([0-9,]+) osoby lubią to \\· ([0-9,]+).([0-9,]+) osoby o tym mówią(?=($|"|<))', "$1" + "$2" + "." + "$3" + " луды лубыт тото, a " + "$4" + "." + "$5" + " о тым бесiдуют");
    d = r(d, '(^|="|>)([0-9,]+).([0-9,]+) osób lubi to \\· ([0-9,]+).([0-9,]+) osoby o tym mówią(?=($|"|<))', "$1" + "$2" + "." + "$3" + " луды лубыт тото, a " + "$4" + "." + "$5" + " о тым бесiдуют");
    d = r(d, '(^|="|>)([0-9,]+).([0-9,]+) osoby lubią to \\· ([0-9,]+).([0-9,]+) osób o tym mówi(?=($|"|<))', "$1" + "$2" + "." + "$3" + " луды лубыт тото, a " + "$4" + "." + "$5" + " о тым бесiдуэ");
    d = r(d, '(^|="|>)([0-9,]+).([0-9,]+) osób lubi to \\· ([0-9,]+).([0-9,]+) osób o tym mówi(?=($|"|<))', "$1" + "$2" + "." + "$3" + " луды лубыт тото, a " + "$4" + "." + "$5" + " о тым бесiдуэ");
    d = r(d, '(^|="|>)([0-9,]+).([0-9,]+) osób lubi to \\· ([0-9,]+) osób o tym mówi(?=($|"|<))', "$1" + "$2" + "." + "$3" + " луды лубыт тото, a " + "$4" + " о тым бесiдуэ");
    d = r(d, '(^|="|>)([0-9,]+).([0-9,]+) osób lubi to \\· ([0-9,]+) osoby o tym mówią(?=($|"|<))', "$1" + "$2" + "." + "$3" + " луды лубыт тото, a " + "$4" + " о тым бесiдуют");
    d = r(d, '(^|="|>)([0-9,]+).([0-9,]+) osoby lubią to \\· ([0-9,]+) osób o tym mówi(?=($|"|<))', "$1" + "$2" + "." + "$3" + " луды лубыт тото, a " + "$4" + " о тым бесiдуэ");
    d = r(d, '(^|="|>)([0-9,]+).([0-9,]+) osoby lubią to \\· ([0-9,]+) osoby o tym mówią(?=($|"|<))', "$1" + "$2" + "." + "$3" + " луды лубыт тото, a " + "$4" + " о тым бесiдуют");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) został oznaczony na zdjęciu użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " э на знымц " + "$3" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) została oznaczona na zdjęciu użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " э на знымц " + "$3" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) został\\(a\\) oznaczony\\(a\\) na zdjęciu użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " э на знымц " + "$3" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) został oznaczony w obiekcie (<a [^>]+>)bild</a> użytkownika (<a [^>]+>[^<]+</a>) z tego miesiąca\.(?=($|"|<))', "$1" + "$2" + " э на " + "$3" + " знымц</a>" + " з того мiсiаца " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) została oznaczona w obiekcie (<a [^>]+>)bild</a> użytkownika (<a [^>]+>[^<]+</a>) z tego miesiąca\.(?=($|"|<))', "$1" + "$2" + " э на " + "$3" + " знымц</a>" + " з того мiсiаца " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) został\\(a\\) oznaczony\\(a\\) w obiekcie (<a [^>]+>)bild</a> użytkownika (<a [^>]+>[^<]+</a>) z tego miesiąca\.(?=($|"|<))', "$1" + "$2" + " э на " + "$3" + " знымц</a>" + " з того мiсiаца " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) został oznaczony na (<a [^>]+>)bild</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " э на " + "$3" + " знымц</a>" + " вiд " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) została oznaczona na (<a [^>]+>)bild</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " э на " + "$3" + " знымц</a>" + " вiд " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) został\\(a\\) oznaczony\\(a\\) na (<a [^>]+>)bild</a> użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " je na " + "$3" + " знымц</a>" + " вiд " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) został oznaczony w albumie (<a [^>]+>[^<]+</a>) użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " э на знымках в албумi " + "$3" + " вiд " + "$4" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) została oznaczona w albumie (<a [^>]+>[^<]+</a>) użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + "$2" + " э на знымках в албумi " + "$3" + " вiд " + "$4" + ".");
    d = r(d, '(^|="|>) \\— z użytkownikiem (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + " з ужытковныком " + "$2" + ".");
    d = r(d, '(^|="|>) \\— z użytkownikiem (<a [^>]+>[^<]+</a>) w miejscu (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + " з ужытковныком " + "$2" + " в " + "$3" + ".");
    d = r(d, '(^|="|>)Twoja bliska rodzina lub rodzina wielopokoleniowa\. (?=($|"|<))', "$1" + "Твоя блыска родына луб родына што маэ веце поколинь. ");
    d = r(d, '(^|="|>)Dowiedz się więcej(?=($|"|<))', "$1" + "Веце iнформацыйi");
    d = r(d, '(^|="|>)Na tej liście \\(([0-9,]+)\\)(?=($|"|<))', "$1" + "На той лысьц" + " ($2)");
    d = r(d, '(^|="|>)Dodaj krewnych do tej listy(?=($|"|<))', "$1" + "Додей кревных до той лысты");
    d = r(d, '(^|="|>)Najbliżsi znajomi, o których chcesz widzieć więcej informacji\. (?=($|"|<))', "$1" + "Найбилше знаэме, о котрых хочеш знату веце iнформацыйi. ");
    d = r(d, '(^|="|>)Pokaż sugestie znajoэмуch dla listy\.(?=($|"|<))', "$1" + "Покале гто мигл бы ищы миглбы быты на той лысьц.");
    d = r(d, '(^|="|>)Strony polecane(?=($|"|<))', "$1" + "Рекомендуване стороны");
    d = r(d, '(^|="|>)Ukryj propozycje(?=($|"|<))', "$1" + "Угрый пропозыцыйi");
    d = r(d, '(^|="|>)Proponowane osoby(?=($|"|<))', "$1" + "Пропонуване особы");
    d = r(d, '(^|="|>)Album\\:(?=($|"|<))', "$1" + " Албум:");
    d = r(d, '(^|="|>)Dodaj znacznik do zdjęcia(?=($|"|<))', "$1" + "Означ знымку");
    d = r(d, '(^|="|>)Dodaj lokalizację(?=($|"|<))', "$1" + "Додай мiсца");
    d = r(d, '(^|="|>)Zakończono oznaczanie(?=($|"|<))', "$1" + "Закiнчено означання");
    d = r(d, '(^|="|>)Gdzie zostało zrobione to zdjęcie\\?(?=($|"|<))', "$1" + "Где была зроблена тота знымка?");
    d = r(d, '(^|="|>)Kliknij zdjęcie, aby zacząć oznaczanie(?=($|"|<))', "$1" + "Клыкный в знымку, абы означыты");
    d = r(d, '(^|="|>)Pobierz(?=($|"|<))', "$1" + "Побер");
    d = r(d, '(^|="|>)Zgłoś to zdjęcie(?=($|"|<))', "$1" + "Зоголос тоту знымку");
    d = r(d, '(^|="|>)([0-9,]+) znajoэмуch(?=($|"|<))', "$1" + "$2" + " знаэмых");
    d = r(d, '(^|="|>) lubi (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + " лубыт " + "$2" + "тото.");
    d = r(d, '(^|="|>) udostępnił\\(a\\) (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + " далы доступ до " + "$2" + ".");
    d = r(d, '(^|="|>) udostępnił (<a [^>]+>[^<]+</a>) użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + " далы доступ до " + "$2" + " вiд " + "$3" + ".");
    d = r(d, '(^|="|>) udostępnił\\(a\\) (<a [^>]+>[^<]+</a>) użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + " далы доступ до " + "$2" + " вiд " + "$3" + ".");
    d = r(d, '(^|="|>) udostępniła (<a [^>]+>[^<]+</a>) użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + " далы доступ до " + "$2" + " вiд " + "$3" + ".");
    d = r(d, '(^|="|>) skomentował\\: (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + " скоментувал " + "$2" + ".");
    d = r(d, '(^|="|>) skomentowała\\: (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + " скоментувалa " + "$2" + ".");
    d = r(d, '(^|="|>) odpowiedział\\(a\\) na pytanie\.(?=($|"|<))', "$1" + " видповидал(a) на запытання.");
    d = r(d, '(^|="|>) udostępnił\\(a\\) (<a [^>]+>[^<]+</a>) dzięki użytkownikowi (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + " далы доступ до " + "$2" + " дякы " + "$3" + ".");
    d = r(d, '(^|="|>) dołączył do grona znajoмуch użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + " э в знаэмых " + "$2" + ".");
    d = r(d, '(^|="|>) dołączyła do grona znajoмуch użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + " э в знаэмых " + "$2" + ".");
    d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) zaktualizował swoje  (<a [^>]+>)zdjęcie w tle</a>\.(?=($|"|<))', "$1" + "$2" + " заактуалызувал свою задню знымку. ");
    d = r(d, '(^|="|>)Pliki(?=($|"|<))', "$1" + "Плiкы");
    d = r(d, '(^|="|>)Dodaj plik(?=($|"|<))', "$1" + "Додей плык");
    d = r(d, '(^|="|>)Przestań obserwować post(?=($|"|<))', "$1" + "Не сускрыбуй поста");
    d = r(d, '(^|="|>)Napisz coś\.\.\.(?=($|"|<))', "$1" + "Напыш штоцы...");
    d = r(d, '(^|="|>)Studiował w\\: (?=($|"|<))', "$1" + "Студювал в:: ");
    d = r(d, '(^|="|>)Mieszka w\\: (?=($|"|<))', "$1" + "Мешка в: ");
    d = r(d, '(^|="|>)Mieszka w\\:(?=($|"|<))', "$1" + "Мешка в:");
    d = r(d, '(^|="|>)Strony(?=($|"|<))', "$1" + "Стороны");
    d = r(d, '(^|="|>)Ulubione cytaty(?=($|"|<))', "$1" + "Мойi улублене цытаты");
    d = r(d, '(^|="|>)Dodaj ulubiony cytat(?=($|"|<))', "$1" + "Додей улублены цытат");
    d = r(d, '(^|="|>)Telefony komórkowe(?=($|"|<))', "$1" + "Комуркы");
    d = r(d, '(^|="|>)Dane kontaktowe(?=($|"|<))', "$1" + "Контакт");
    d = r(d, '(^|="|>)Języki(?=($|"|<))', "$1" + "Языкы");
    d = r(d, '(^|="|>)Data urodzenia(?=($|"|<))', "$1" + "Уродыны");
    d = r(d, '(^|="|>)Status związku(?=($|"|<))', "$1" + "Ма когосы?");
    d = r(d, '(^|="|>)W związku(?=($|"|<))', "$1" + "Так");
    d = r(d, '(^|="|>)Podstawowe informacje(?=($|"|<))', "$1" + "Основне iнформацыйi");
    d = r(d, '(^|="|>)Informacje o Tobie(?=($|"|<))', "$1" + "Пару слов о тобi");
    d = r(d, '(^|="|>)Napisz o sobie(?=($|"|<))', "$1" + "Напыш о собi");
    d = r(d, '(^|="|>)Kobieta(?=($|"|<))', "$1" + "Кобэта");
    d = r(d, '(^|="|>)Mężczyzna(?=($|"|<))', "$1" + "Межчызна");
    d = r(d, '(^|="|>)Miejsce zamieszkania(?=($|"|<))', "$1" + "Мiсца замешканя");
    d = r(d, '(^|="|>)Miasto rodzinne(?=($|"|<))', "$1" + "Родынне мiсто");
    d = r(d, '(^|="|>)Historia \\(wg lat\\)(?=($|"|<))', "$1" + "Гистория ");
    d = r(d, '(^|="|>)Wykształcenie i praca(?=($|"|<))', "$1" + "Кшталцення i робота");
    d = r(d, '(^|="|>)Obserwuj post(?=($|"|<))', "$1" + "Обсервуй поста");
    d = r(d, '(^|="|>)Odwiedzenie ([0-9,]+) miejsc(?=($|"|<))', "$1" + "Одведыны " + "$2" + " мiсц");
    d = r(d, '(^|="|>)([0-9,]+) zdjęcia(?=($|"|<))', "$1" + "$2" + " знымкы");
    d = r(d, '(^|="|>)([0-9,]+) zdjęć(?=($|"|<))', "$1" + "$2" + " знымок");
    d = r(d, '(^|="|>)([0-9,]+) zdjęcie(?=($|"|<))', "$1" + "$2" + " знымка");
    d = r(d, '(^|="|>) był\\(a\\) w miejscu\\: (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + " был в мiсцы " + "$2" + ".");
    d = r(d, '(^|="|>) był\\(a\\) z użytkownikiem (<a [^>]+>[^<]+</a>) w miejscu\\: (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + " был з ужытковныком" + "$2" + "  в " + "$3" + ".");
    d = r(d, '(^|="|>) dodała (<a [^>]+>[^<]+</a>) do albumu \\„(<a [^>]+>[^<]+</a>)\\”\.(?=($|"|<))', "$1" + " додала" + "$2" + " до албума " + "$3" + ".");
    d = r(d, '(^|="|>) dodał (<a [^>]+>[^<]+</a>) do albumu \\„(<a [^>]+>[^<]+</a>)\\”\.(?=($|"|<))', "$1" + " додал" + "$2" + " до албума " + "$3" + ".");
    d = r(d, '(^|="|>) dodał\\(a\\) (<a [^>]+>[^<]+</a>) do albumu \\„(<a [^>]+>[^<]+</a>)\\”\.(?=($|"|<))', "$1" + " додал(а) " + "$2" + " до албума " + "$3" + ".");
    d = r(d, '(^|="|>) był\\(a\\) z\\: (<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) w miejscu\\: (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + ", " + "$2" + " i " + "$3" + " былы в " + "$4" + ".");
    d = r(d, '(^|="|>) był\\(a\\) z użytkownikami (<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) w miejscu\\: (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + ", " + "$2" + " i " + "$3" + " былы в " + "$4" + ".");
    d = r(d, '(^|="|>) zaktualizował\\(a\\) swoje (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + " ма нову " + "$2" + ".");
    d = r(d, '(^|="|>) zaktualizował swoje (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + " ма нову " + "$2" + ".");
    d = r(d, '(^|="|>) zaktualizowała swoje (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1" + " ма нову " + "$2" + ".");
    d = r(d, '(^|="|>)zdjęcie w tle(?=($|"|<))', "$1" + "задню знымку");
    d = r(d, '(^|="|>)zdjęcie profilowe(?=($|"|<))', "$1" + "профылову знымку");
    d = r(d, '(^|="|>)Przejdź do trybu online(?=($|"|<))', "$1" + "Бут офлайн");
    d = r(d, ' korzysta obecnie z wersji serwisu Facebook w języku\\: (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', " корыстат з Фацебоока в версыйi: " + "$1" + ".");
    d = r(d, '(^|="|>)Zdjęcia i filму(?=($|"|<))', "$1" + "Знымкы i фiлмы");
    d = r(d, '(^|="|>)Wszystkie(?=($|"|<))', "$1" + "Веце");
    d = r(d, '(^|="|>)Tylko dokumenty(?=($|"|<))', "$1" + "Тылку документа");
    d = r(d, '(^|="|>)Tylko pliki(?=($|"|<))', "$1" + "Тылку плiкы");
    d = r(d, '(^|="|>)Utwórz dokument(?=($|"|<))', "$1" + "Створ документ");
    d = r(d, '(^|="|>)Porozmawiaj na czacie z grupą(?=($|"|<))', "$1" + "Бесидуй на чац з групаьm");
    d = r(d, '(^|="|>)Dodaj do ulubionych(?=($|"|<))', "$1" + "Додей до улубэных");
    d = r(d, '(^|="|>)Edytuj grupę(?=($|"|<))', "$1" + "Едытуй групу");
    d = r(d, '(^|="|>)Zgłoś grupę(?=($|"|<))', "$1" + "Зголос групу");
    d = r(d, '(^|="|>)Opuść grupę(?=($|"|<))', "$1" + "Выйд з групы");
    d = r(d, '(^|="|>)Brak wyników(?=($|"|<))', "$1" + "Брак выныкув");
    d = r(d, '(^|="|>)W tej grupie nie ma zdjęć i filmów.(?=($|"|<))', "$1" + "В той групи неэ знымок аны вiдео.");
    d = r(d, '(^|="|>)Jeszcze w tym tygodniu(?=($|"|<))', "$1" + "В тым тыжнi");
    d = r(d, '(^|="|>)W następnym tygodniu(?=($|"|<))', "$1" + "В наступным тыжнi");
    d = r(d, '(^|="|>)W tym miesiącu(?=($|"|<))', "$1" + "В тым мисиацы");
    d = r(d, '(^|="|>)W zeszłym tygodniu(?=($|"|<))', "$1" + "Заднi тыжден");
    d = r(d, '(^|="|>)Minione wydarzenia(?=($|"|<))', "$1" + "Давне здарiння");
    d = r(d, '(^|="|>)Nadchodzące wydarzenia(?=($|"|<))', "$1" + "Прышле здарiння");
    d = r(d, '(^|="|>)Proponowane wydarzenia(?=($|"|<))', "$1" + "Пропонуване здарiння");
    d = r(d, '(^|="|>)Odrzucone wydarzenia(?=($|"|<))', "$1" + "Незаакцептуване здарiння");
    d = r(d, '(^|="|>)Urodziny(?=($|"|<))', "$1" + "Уродыны");
    d = r(d, '(^|="|>)Eksportuj zdarzenia\.\.\.(?=($|"|<))', "$1" + "Експортуй здарiня...");
    d = r(d, '(^|="|>) \\· Lubisz tę stronę\.(?=($|"|<))', "$1" + "· Лубыш тоту сторону.");
    d = r(d, '(^|="|>)Organizowane przez\\: (?=($|"|<))', "$1" + "Рыхтуванне перез: ");
    d = r(d, '(^|="|>)Ukryj zdarzenie(?=($|"|<))', "$1" + "Угрый здариння");
    d = r(d, '(^|="|>)Zgłoś zdarzenie lub spam(?=($|"|<))', "$1" + "Зголос здариння луб спам");
    d = r(d, '(^|="|>)Wszystkie zdarzenia(?=($|"|<))', "$1" + "Вшыткiе здарiня");
    d = r(d, '(^|="|>)Większość zdarzeń(?=($|"|<))', "$1" + "Веце здарiнь");
    d = r(d, '(^|="|>)Tylko ważne(?=($|"|<))', "$1" + "Тылкi важне");
    d = r(d, '(^|="|>)Edytuj ustawienia(?=($|"|<))', "$1" + "Эдытуй уставлiня");
    d = r(d, '(^|="|>)Zarchiwizuj listę(?=($|"|<))', "$1" + "Пренес до архiвум");
    d = r(d, '(^|="|>)Polecane wydarzenia(?=($|"|<))', "$1" + "Полецане здариння");
    d = r(d, '(^|="|>)Zapytaj znajoэмуch(?=($|"|<))', "$1" + "Жвидайсиа знаэмых");
    d = r(d, '(^|="|>)Zobacz(?=($|"|<))', "$1" + "Огладный");
    d = r(d, '(^|="|>)Inni(?=($|"|<))', "$1" + "Iншi");
    d = r(d, '(^|="|>)Zadał\\(a\\)(?=($|"|<))', "$1" + "Жвiдуэсiа");
    d = r(d, '(^|="|>)([0-9,]+) więcej(?=($|"|<))', "$1" + "$2" + " веце");
    d = r(d, '(^|="|>)wydarzenia \\(([0-9,]+)\\)(?=($|"|<))', "$1" + "здарiння - " + "$2");
    d = r(d, '(^|="|>) w tym tygodniu(?=($|"|<))', "$1" + " в тым тыжни");
    d = r(d, '(^|="|>)Znajomi \\(([0-9,]+)\\)(?=($|"|<))', "$1" + "$2" + " знаэмых");
    d = r(d, '(^|="|>)Sztuka i rozrywka(?=($|"|<))', "$1" + "Штука i розрывка");
    d = r(d, '(^|="|>)Ulubione zajęcia i zainteresowania(?=($|"|<))', "$1" + "Улубиене");
    d = r(d, '(^|="|>)Ma ([0-9,]+) znajoэмуch na Facebooku\.(?=($|"|<))', "$1" + "Ма " + "$2" + " знаэмых на Фацебооку.");
    d = r(d, '(^|="|>)Edytuj opcje(?=($|"|<))', "$1" + "Змiн опцйi");
    d = r(d, '(^|="|>)Obserwuj(?=($|"|<))', "$1" + "Обсервуй");
    d = r(d, '(^|="|>)Ustawienia powiadomień(?=($|"|<))', "$1" + "Уставлiння новын");
    d = r(d, '(^|="|>)Twoje powiadomienia(?=($|"|<))', "$1" + "Твоi новыны");
    d = r(d, '(^|="|>)Więcej zdarzeń(?=($|"|<))', "$1" + "Веце");
    d = r(d, '(^|="|>)Poleć jej znajoэмуch(?=($|"|<))', "$1" + "Пропонуй му знаэмых");
    d = r(d, '(^|="|>)Poleć mu znajoэмуch(?=($|"|<))', "$1" + "Пропонуй эй знаэмых");
    d = r(d, '(^|="|>)Pomóż znajomemu(?=($|"|<))', "$1" + "Помож знаэмым");
    d = r(d, '(^|="|>)Złóż życzenia(?=($|"|<))', "$1" + "Бажай iм");
    d = r(d, '(^|="|>)Zaczepki(?=($|"|<))', "$1" + "Зачепкы");
    d = r(d, '(^|="|>)Zaczep(?=($|"|<))', "$1" + "Зачеп");
    d = r(d, '(^|="|>)Telewizja(?=($|"|<))', "$1" + "Телевiзуя");
    d = r(d, '(^|="|>)Książki(?=($|"|<))', "$1" + "Кныжкы");
    d = r(d, '(^|="|>)Szkoła średnia(?=($|"|<))', "$1" + "Середнiа школа");
    d = r(d, '(^|="|>)Pracodawcy(?=($|"|<))', "$1" + "Робота");
    d = r(d, '(^|="|>)Usuń podgląd(?=($|"|<))', "$1" + "Усун подглад");
    d = r(d, '(^|="|>)Dodaj znajoэмуch do czatu\.\.\.(?=($|"|<))', "$1" + "Додей знаэмых до чату...");
    d = r(d, '(^|="|>)Zobacz pełną konwersację(?=($|"|<))', "$1" + "Огладай цилу розмову");
    d = r(d, '(^|="|>)Wyczyść okno(?=($|"|<))', "$1" + "Вычыст вiкно");
    d = r(d, '(^|="|>)Music(?=($|"|<))', "$1" + "Музыка");
    d = r(d, '(^|="|>)Menedżer reklam(?=($|"|<))', "$1" + "Менеджер реглам");
    d = r(d, '(^|="|>)Dziś są jej urodziny\.(?=($|"|<))', "$1" + "Внеска суд эй уродуны.");
    d = r(d, '(^|="|>)Dziś są jego urodziny\.(?=($|"|<))', "$1" + "Внеска суд эго уродуны.");
    d = r(d, '(^|="|>)Inne wiadomości(?=($|"|<))', "$1" + "Iнше вiстi");
    d = r(d, '(^|="|>)Właściciele strony(?=($|"|<))', "$1" + "Сторона належыт до:");
    d = r(d, '(^|="|>)Tablica&nbsp;(?=($|"|<))', "$1" + "Таблыца&nbsp;");
    d = r(d, '(^|="|>)Informacje&nbsp;(?=($|"|<))', "$1" + "Iнформацыйi&nbsp;");
    d = r(d, '(^|="|>)Zdjęcia&nbsp;(?=($|"|<))', "$1" + "Знымкы&nbsp;");
    d = r(d, '(^|="|>)Znajomi&nbsp;(?=($|"|<))', "$1" + "Знаэме&nbsp;");
    d = r(d, '(^|="|>)Subskrypcje&nbsp;(?=($|"|<))', "$1" + "Субскрыбуцыйi&nbsp;");
    d = r(d, '(^|="|>)Data urodzenia\\: ', "$1" + "Дата народын: ");
    d = r(d, '(^|="|>)Dzisiaj(?=($|"|<))', "$1" + "Внеска");
    d = r(d, '(^|="|>)W toku(?=($|"|<))', "$1" + "Тераз");
    d = r(d, '(^|="|>)Zobacz\\: (?=($|"|<))', "$1" + "Гладай: ");
    d = r(d, '(^|="|>)Znajomi na czacie(?=($|"|<))', "$1" + "Знаэмы на чац");
    d = r(d, '(^|="|>)W związku małżeńskim z użytkownikiem\\:(?=($|"|<))', "$1" + "Женiаты з/вышла за муж за: ");
    d = r(d, '(^|="|>)Dodaj swoje miejsce pracy(?=($|"|<))', "$1" + "Додей своэ мисца працы");
    d = r(d, '(^|="|>)W związku małżeńskim z użytkownikiem\\: (<a [^>]+>[^<]+</a>)(?=($|"|<))', "$1" + "Женiаты з/вышла за муж за: " + "$2");
  d = r(d, '(^|="|>)\, aby zobaczyć\, kto jest dostępny na czacie\.(?=($|"|<))', "$1"+", абы огладаты гто э на чац.");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) dołączyli do grupy(?=($|"|<))', "$1"+"$2"+" i "+"$3"+" прыступылы до групы.");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) lubi (<a [^>]+>[^<]+</a>) użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1"+"$2"+" лубыт "+"$3"+"ужытковныка "+"$4"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) lubi (<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1"+"$2"+" лубыт "+"$3"+" ы "+"$4"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) są teraz znajoэмуmi użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1"+"$2"+" i "+"$3"+" сут тераз знаэмыми  "+"$4"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) zmieniło swoje zdjęcia profilowe\.(?=($|"|<))', "$1"+"$2"+" i "+"$3"+" зминыло свою профылову знымку.");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) zmienił\\(a\\) swoje zdjęcie profilowe\.(?=($|"|<))', "$1"+"$2"+" зминыл(a) свою профылову знымку.");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) na pytanie (<a [^>]+>[^<]+</a>) odpowiedział (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1"+"$2"+" на запытання "+"$3"+" вiдповидал "+"$4"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) na pytanie (<a [^>]+>[^<]+</a>) odpowiedział (<a [^>]+>[^<]+</a>)(?=($|"|<))', "$1"+"$2"+" на запытання "+"$3"+" вiдповидал "+"$4"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) na pytanie (<a [^>]+>[^<]+</a>) odpowiedziała (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1"+"$2"+" на запытання "+"$3"+" вiдповидалa "+"$4"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) na pytanie (<a [^>]+>[^<]+</a>) odpowiedziała (<a [^>]+>[^<]+</a>)(?=($|"|<))', "$1"+"$2"+" на запытання "+"$3"+" вiдповидалa "+"$4"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) lubią\\: (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1"+"$2"+" i "+"$3"+" лубют "+"$4"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>) także to lubią\.(?=($|"|<))', "$1"+"$2"+" i "+"$3"+" циж тото лубят.");
  d = r(d, '(^|="|>)Grupa (<a [^>]+>[^<]+</a>) nie ma żadnych minionych wydarzeń\. (?=($|"|<))', "$1"+"Група "+"$2"+" не ма старых здаринь. ");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) weźmie udział w wydarzeniu \\„(<a [^>]+>[^<]+</a>)\\” \\– (<a [^>]+>[^<]+</a>)\, w miejscu\\:', "$1"+"$2"+" возме участ в здаринню "+"$3"+" – "+"$4"+", "+"в:");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) zadał\\(a\\) pytanie \\„(<a [^>]+>[^<]+</a>)\\”(?=($|"|<))', "$1"+"$2"+" pytŏ: "+"„"+"$3"+"”");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) ma (1?1) nowy post opublikowany przez użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1"+"$2"+" ма "+"$3"+" новы пост вiд "+"$4"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) ma (1?[2-4]) nowych postów opublikowanych przez użytkownika (<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1"+"$2"+" ма "+"$3"+" нове посты вiд "+"$4"+" i "+"$5"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) ma (1?[5-9]) nowych postów opublikowanych przez użytkownika (<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1"+"$2"+" ма "+"$3"+" новых постiв вiд "+"$4"+" i "+"$5"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) ma ([0-9,]+) nowych postów opublikowanych przez użytkownika (<a [^>]+>[^<]+</a>) i (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1"+"$2"+" ма "+"$3"+" новых постiв вiд "+"$4"+" i "+"$5"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) ma (1?[2-4]) nowych postów opublikowanych przez użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1"+"$2"+" ма "+"$3"+" нове посты вiд "+"$4"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) ma (1?[5-9]) nowych postów opublikowanych przez użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1"+"$2"+" ма "+"$3"+" новых постiв вiд "+"$4"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) ma ([0-9,]+) nowych postów opublikowanych przez użytkownika (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1"+"$2"+" ма "+"$3"+" новых постiв вiд "+"$4"+".");
  d = r(d, '(^|>)Zobacz 1 post więcej użytkownika ', "$1"+"Огладай 1 пост веце ужытковныка ");
  d = r(d, '(^|>)Zobacz więcej postów \\((1?1)\\) użytkownika\\: ', "$1"+"Гладай веце постив "+"$2"+"  ужытковныка: ");
  d = r(d, '(^|>)Zobacz więcej postów \\((1?[2-4])\\) użytkowników\\: ', "$1"+"Гладай веце постив "+"$2"+" ужытковныкув: ");
  d = r(d, '(^|>)Zobacz więcej postów \\((1?[5-9])\\) użytkowników\\: ', "$1"+"Гладай веце постив "+"$2"+" ужытковныкув: ");
  d = r(d, '(^|>)Zobacz więcej postów \\(([0-9,]+)\\) użytkowników\\: ', "$1"+"Гладай веце постив "+"$2"+" ужытковныкув: ");
  d = r(d, '(^|>)Zobacz więcej \\((1?1)\\) postów użytkownika\\: ', "$1"+"Гладай веце  "+"$2"+" постив ужытковныка: ");
  d = r(d, '(^|>)Zobacz więcej \\((1?[2-4])\\) postów użytkownika ', "$1"+"Гладай веце  "+"$2"+" постив ужытковныка: ");
  d = r(d, '(^|>)Zobacz więcej \\((1?[5-9])\\) postów użytkownika ', "$1"+"Гладай веце  "+"$2"+" постив ужытковныка: ");
  d = r(d, '(^|>)Zobacz więcej \\(([0-9,]+)\\) postów użytkownika ', "$1"+"Гладай веце "+"$2"+" постив ужытковныка: ");
d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentowała swój własny (<a [^>]+>)link</a>\.(?=($|"|<))', "$1"+"$2"+" скоментувала свiй власну "+"$3"+"лынк</a>"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentowała swoje własne (<a [^>]+>)bild</a>\.(?=($|"|<))', "$1"+"$2"+" скоментувала свою власну  "+"$3"+"знымку</a>"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentowała swój własny (<a [^>]+>)post</a>\.(?=($|"|<))', "$1"+"$2"+" скоментувала свiй власну  "+"$3"+"пост</a>"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentowała swój własny (<a [^>]+>)status</a>\.(?=($|"|<))', "$1"+"$2"+" скоментувала свiй власну "+"$3"+"статус</a>"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentowała swój własny (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1"+"$2"+" скоментувала свiй власну "+"$3"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentował swój własny (<a [^>]+>)link</a>\.(?=($|"|<))', "$1"+"$2"+" скоментувал свiй власну "+"$3"+"лынк</a>"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentował swój własny (<a [^>]+>)bild</a>\.(?=($|"|<))', "$1"+"$2"+" скоментувал свою власну "+"$3"+"знымку</a>"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentował swój własny (<a [^>]+>)post</a>\.(?=($|"|<))', "$1"+"$2"+" скоментувал свiй власну "+"$3"+"пост</a>"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentował swój własny (<a [^>]+>)status</a>\.(?=($|"|<))', "$1"+"$2"+" скоментувал свiй власну "+"$3"+"статус</a>"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentował swój własny (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1"+"$2"+" скоментувал свiй власну "+"$3"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentował twój (<a [^>]+>)link</a>\.(?=($|"|<))', "$1"+"$2"+"скоментувал твий "+"$3"+"лынк</a>"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentował twoje (<a [^>]+>)bild</a>\.(?=($|"|<))', "$1"+"$2"+" скоментувал twōj "+"$3"+"знымку</a>"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentował twój (<a [^>]+>)post</a>\.(?=($|"|<))', "$1"+"$2"+"скоментувал твий "+"$3"+"пост</a>"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentował twój (<a [^>]+>)status</a>\.(?=($|"|<))', "$1"+"$2"+"скоментувал твий "+"$3"+"статус</a>"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentował twój (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1"+"$2"+"скоментувал твий "+"$3"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentowała twój (<a [^>]+>)link</a>\.(?=($|"|<))', "$1"+"$2"+"скоментувал(a) твий "+"$3"+"лынк</a>"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentowała twoje (<a [^>]+>)bild</a>\.(?=($|"|<))', "$1"+"$2"+"скоментувал(a) твою "+"$3"+"знымку</a>"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentowała twój (<a [^>]+>)post</a>\.(?=($|"|<))', "$1"+"$2"+"скоментувал(a) твий "+"$3"+"пост</a>"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentowała twój (<a [^>]+>)status</a>\.(?=($|"|<))', "$1"+"$2"+"скоментувал(a) твий "+"$3"+"статус</a>"+".");
  d = r(d, '(^|="|>)(<a [^>]+>[^<]+</a>) skomentowała twój (<a [^>]+>[^<]+</a>)\.(?=($|"|<))', "$1"+"$2"+"скоментувал(a) твий "+"$3"+".");
 
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) dodał post na stronie grupy (<span [^>]+>[^<]+</span>)', "$1"+"$2"+" напысал пост в групi "+"$3");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) dodała post na stronie grupy (<span [^>]+>[^<]+</span>)', "$1"+"$2"+" напысалa пост в групi "+"$3");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) dodał\\(a\\) post do grupy (<span [^>]+>[^<]+</span>)', "$1"+"$2"+" напысал(a) пост в групи "+"$3");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) skomentował Twój wpis na stronie grupy (<span [^>]+>[^<]+</span>)', "$1"+"$2"+" скоментувал твiй пост на сторонi групы "+"$3");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) skomentowała Twój wpis na stronie grupy (<span [^>]+>[^<]+</span>)', "$1"+"$2"+" скоментувалa твiй пост на сторонi групы "+"$3");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) także skomentował wpis w grupie (<span [^>]+>[^<]+</span>)', "$1"+"$2"+" цж скоментувал пост в групы "+"$3");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) także skomentowała wpis w grupie (<span [^>]+>[^<]+</span>)', "$1"+"$2"+" цж скоментувалa пост в групi "+"$3");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) także skomentował zdjęcie w grupie (<span [^>]+>[^<]+</span>)', "$1"+"$2"+" цж скоментувал пост в групi "+"$3");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) także skomentowała zdjęcie w grupie (<span [^>]+>[^<]+</span>)', "$1"+"$2"+" цж скоментувалa пост в групi"+"$3");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) i (<span [^>]+>[^<]+</span>) także skomentowali post w grupie (<span [^>]+>[^<]+</span>)', "$1"+"$2"+" i "+"$3"+" цж скоментувалы пост в групi "+"$4");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) i (<span [^>]+>[^<]+</span>) skomentowali Twoje zdjęcie w grupie (<span [^>]+>[^<]+</span>)', "$1"+"$2"+" i "+"$3"+" скоментувалы Твою знымку в групi "+"$4");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) i (<span [^>]+>[^<]+</span>) także skomentowali status użytkownika (<span [^>]+>[^<]+</span>)', "$1"+"$2"+" i "+"$3"+" цж скоментувалы Твiй статус "+"$4"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) i (<span [^>]+>[^<]+</span>) skomentowali Twój status\.', "$1"+"$2"+" i "+"$3"+" скоментувалы Твiй статус.");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) zaczepił Cię\. ', "$1"+"$2"+" зачепыл тебе.");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) zaczepiła Cię\. ', "$1"+"$2"+" зачепылa тебе.");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) zaczepił\\(a\\) Cię\. ', "$1"+"$2"+" зачепыл(a) тебе.");
  d = r(d, '(^|="|>) zaczepił Cię(?=($|"|<))', "$1"+" зачепыл тебе.");
  d = r(d, '(^|="|>) zaczepiła Cię(?=($|"|<))', "$1"+" зачепылa тебе.");
  d = r(d, '(^|="|>) zaczepił\\(a\\) Cię(?=($|"|<))', "$1"+" зачепыл(a) тебе.");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>)\, (<span [^>]+>[^<]+</span>) i inni \\(([0-9,]+)\\) także skomentowali (<span [^>]+>[^<]+</span>) status\.', "$1"+"$2"+", "+"$3"+" i iнчый"+"$4"+" цж скоментувалы статус "+"$5"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) \\(znajoму użytkownika (<span [^>]+>[^<]+</span>)\\) lubi Twój komentarz\\:', "$1"+"$2"+" (знаэмы ужытковныка "+"$3"+") "+"лубыт твiй коментар: ");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) \\(znajoму użytkownika (<span [^>]+>[^<]+</span>)\\) skomentował link użytkownika (<span [^>]+>[^<]+</span>)\\:', "$1"+"$2"+" (знаэмы ужытковныка "+"$3"+") "+"скоментувал лунк ужытковныка "+"$4");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) lubi Twój komentarz\\:', "$1"+"$2"+" лубыт Твiй коментар: ");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) lubi link użytkownika (<span [^>]+>[^<]+</span>)\.', "$1"+"$2"+" лубыт лынк ужытковныка "+"$3"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) \\(znajoму użytkownika (<span [^>]+>[^<]+</span>)\\) skomentował\\(a\\) status użytkownika (<span [^>]+>[^<]+</span>)', "$1"+"$2"+" (знаэмы ужытковныка "+"$3"+") "+"скоментувал(a) статус ужытковныка "+"$4");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>)\, (<span [^>]+>[^<]+</span>) i inne osoby \\(([0-9,]+)\\) lubią stronę \\„(<span [^>]+>[^<]+</span>)\\”\.', "$1"+"$2"+", "+"$3"+" i iнчe особы "+"$4"+" лубют сторону "+"$5"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>)\, (<span [^>]+>[^<]+</span>) i inni \\(([0-9,]+)\\) skomentowali zdjęcie użytkownika (<span [^>]+>[^<]+</span>)\.', "$1"+"$2"+", "+"$3"+" i iнчый"+"$4"+" скоментувалы змымку ужытковныка "+"$5"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>)\, (<span [^>]+>[^<]+</span>) i inni \\(([0-9,]+)\\) skomentowali link  użytkownika (<span [^>]+>[^<]+</span>)\. ', "$1"+"$2"+", "+"$3"+" i iнчый"+"$4"+" скоментувалы лунк ужытковныка "+"$5"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>)\, (<span [^>]+>[^<]+</span>) i inni \\(([0-9,]+)\\) skomentowali status użytkownika (<span [^>]+>[^<]+</span>)\.', "$1"+"$2"+", "+"$3"+" i iнчый"+"$4"+" скоментувалы статус ужытковныка "+"$5"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>)\, (<span [^>]+>[^<]+</span>) i inne osoby \\(([0-9,]+)\\) lubią Twoje zdjęcie na Tablicy użytkownika (<span [^>]+>[^<]+</span>)\. ', "$1"+"$2"+", "+"$3"+" i iнчый особы "+"$4"+" inkszych przaje twojimu bildowi na ścianie вiд "+"$5"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>)\, (<span [^>]+>[^<]+</span>) i inne osoby \\(([0-9,]+)\\) lubi album ', "$1"+"$2"+", "+"$3"+" i iнчe особы "+"$4"+" лубют албум ");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>)\, (<span [^>]+>[^<]+</span>) i ([0-9,]+) inne osoby lubią Twój komentarz\\: ', "$1"+"$2"+", "+"$3"+" i "+"$4"+" лубют Твiй коментар: ");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>)\, (<span [^>]+>[^<]+</span>) i ([0-9,]+) innych znajoэмуch lubi Twoje zdjęcie\.', "$1"+"$2"+", "+"$3"+" i "+"$4"+" лубют Твою знымку: ");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>)\, (<span [^>]+>[^<]+</span>) i (<span [^>]+>[^<]+</span>) lubią zdjęcie użykownika (<span [^>]+>[^<]+</span>)\. ', "$1"+"$2"+", "+"$3"+" i "+"$4"+" лубют знымку ужытковныка "+"$5"+". ");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>)\, (<span [^>]+>[^<]+</span>) i (<span [^>]+>[^<]+</span>) lubią Twój komentarz\\: ', "$1"+"$2"+", "+"$3"+" i "+"$4"+" лубют Твiй коментар: ");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) lubi zdjęcie użytkownika (<span [^>]+>[^<]+</span>)\.', "$1"+"$2"+" лубют знымку ужытковныка "+"$3"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) i (<span [^>]+>[^<]+</span>) także skomentowali\\(ły\\) link użytkownika (<span [^>]+>[^<]+</span>)', "$1"+"$2"+" i "+"$3"+" цж скоментувалы лынк ужытковныка"+"$4"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) i (<span [^>]+>[^<]+</span>) lubią zdjęcie użytkownika (<span [^>]+>[^<]+</span>)\.', "$1"+"$2"+" i "+"$3"+" лубют знымку ужытковныка "+"$4"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>)\, (<span [^>]+>[^<]+</span>) i (<span [^>]+>[^<]+</span>) także skomentowali\\(ły\\) link użytkownika (<span [^>]+>[^<]+</span>)\. ', "$1"+"$2"+", "+"$3"+" i "+"$4"+" цж скоментувалы лунк ужытковныка "+"$5"+". ");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) i (<span [^>]+>[^<]+</span>) lubią Twój komentarz\\: ', "$1"+"$2"+" i "+"$3"+" лубют Твiй коментар: ");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) skomentowała zdjęcie użytkownika (<span [^>]+>[^<]+</span>)\.', "$1"+"$2"+" скоментувалa змымку ужытковныка "+"$3"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) skomentował zdjęcie użytkownika (<span [^>]+>[^<]+</span>)\.', "$1"+"$2"+" скоментувал змымку ужытковныка "+"$3"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) skomentowała link użytkownika (<span [^>]+>[^<]+</span>)\.', "$1"+"$2"+" скоментувалa змымку ужытковныка "+"$3"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) skomentował link użytkownika (<span [^>]+>[^<]+</span>)\.', "$1"+"$2"+" скоментувал змымку ужытковныка "+"$3"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) skomentował\\(a\\) status użytkownika (<span [^>]+>[^<]+</span>)\.', "$1"+"$2"+" скоментувал(a) статус ужытковныка "+"$3"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) skomentowała status użytkownika (<span [^>]+>[^<]+</span>)\.', "$1"+"$2"+" скоментувалa статус ужытковныка "+"$3"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) skomentował status użytkownika (<span [^>]+>[^<]+</span>)\.', "$1"+"$2"+" скоментувалы статус ужытковныка "+"$3"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) lubi status użytkownika (<span [^>]+>[^<]+</span>)\.', "$1"+"$2"+" лубыт статус ужытковныкa "+"$3"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>)\, (<span [^>]+>[^<]+</span>) i inne osoby \\(([0-9,]+)\\) lubią zdjęcie użytkownika (<span [^>]+>[^<]+</span>)\.', "$1"+"$2"+", "+"$3"+" i "+"$4"+" лубют знымку ужытковныка "+"$5"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>)\, (<span [^>]+>[^<]+</span>) i inne osoby \\(([0-9,]+)\\) lubi link użytkownika (<span [^>]+>[^<]+</span>)\.', "$1"+"$2"+", "+"$3"+" i "+"$4"+" лубыт лунк ужытковныкa "+"$5"+".");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>)\, (<span [^>]+>[^<]+</span>) i (<span [^>]+>[^<]+</span>) lubią link użykownika (<span [^>]+>[^<]+</span>)\. ', "$1"+"$2"+", "+"$3"+" i "+"$4"+" лубыт лунк ужытковныкa "+"$5"+". ");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) i (<span [^>]+>[^<]+</span>) także skomentowali\\(ły\\) zdjęcie użytkownika (<span [^>]+>[^<]+</span>)\. ', "$1"+"$2"+" i "+"$3"+" цж скоментувалы змымку ужытковныка "+"$4"+". ");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) i (<span [^>]+>[^<]+</span>) lubią link użytkownika (<span [^>]+>[^<]+</span>)\. ', "$1"+"$2"+" i "+"$3"+" лубыт лунк ужытковныкa "+"$4"+". ");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) i (<span [^>]+>[^<]+</span>) skomentowali\\(ły\\) zdjęcie użytkownika (<span [^>]+>[^<]+</span>)\. ', "$1"+"$2"+" i "+"$3"+" скоментувалы змымку ужытковныка "+"$4"+". ");
  d = r(d, '(^|="|>)(<span [^>]+>[^<]+</span>) lubi album ', "$1"+"$2"+" лубют албум ");
 
  return d;
}
 
function translateOnInsert( node ) {
 
  //var logmsg = 'inserted a ' + node.nodeName + ' node; untranslated elements: ';
  for (n = 0; n < tags.length; n++) {
    var tagmatches = node.getElementsByTagName(tags[n]);
    for ( i = 0; i < tagmatches.length; i++ ) {
      // innerHTML often empty (never null)
      if (!tagmatches[i].hasAttribute('indigenous') &&
           tagmatches[i].innerHTML != '') {
        // logmsg = logmsg + tagmatches[i].nodeName + ' ';
        tagmatches[i].innerHTML = translate(tagmatches[i].innerHTML);
        tagmatches[i].setAttribute('indigenous', true);
      }
    }
  }
 
  var divs = node.getElementsByTagName('div');
  for (i = 0; i < divs.length; i++ ) {
    if (!divs[i].hasAttribute('indigenous')) {
      for (n = 0; n < divclasses.length; n++) {
        if (divs[i].className == divclasses[n]) {
          // logmsg = logmsg + 'DIV.' + divclasses[n] + ' ';
          divs[i].innerHTML = translate(divs[i].innerHTML);
          divs[i].setAttribute('indigenous', true);
          break;
        }
      }
    }
  }
 
  var spans = node.getElementsByTagName('span');
  for (i = 0; i < spans.length; i++ ) {
    if (!spans[i].hasAttribute('indigenous')) {
      for (n = 0; n < spanclasses.length; n++) {
        if (spans[i].className == spanclasses[n]) {
          // logmsg = logmsg + 'SPAN.' + spanclasses[n] + ' ';
          spans[i].innerHTML = translate(spans[i].innerHTML);
          spans[i].setAttribute('indigenous', true);
          break;
        }
      }
    }
  }
  // GM_log(logmsg);
}
 
// This is (only) needed to handle updates to time stamps
function listen_for_change(evt)
{
  var node = evt.target;
  //GM_log('in change node, data='+node.data+'; was='+evt.prevValue);
  document.body.removeEventListener( 'DOMCharacterDataModified', listen_for_change, false );
  node.data = translate(node.data);
  document.body.addEventListener( 'DOMCharacterDataModified', listen_for_change, false );
}
 
function listen_for_add(evt)
{
  var node = evt.target;
  if (node.nodeType == document.ELEMENT_NODE &&
      node.nodeName != 'SCRIPT' &&
      node.nodeName != 'INPUT') {
    document.body.removeEventListener( 'DOMNodeInserted', listen_for_add, false );
    translateOnInsert(node);
    document.body.addEventListener( 'DOMNodeInserted', listen_for_add, false );
  }
}
 
function initme()
{
  document.body.addEventListener( 'DOMNodeInserted', listen_for_add, false );
  document.body.addEventListener( 'DOMCharacterDataModified', listen_for_change, false );
  document.body.innerHTML = translate(document.body.innerHTML);
}
 
document.addEventListener( "DOMContentLoaded", initme, false);