// ==UserScript==
// @name        [魔物狩猎者]日服wiki部分汉化
// @namespace   http://seesaawiki.jp/guardianc/
// @description [魔物狩猎者]日服wiki部分汉化
// @include     http://seesaawiki.jp/guardianc/*
// @version     1.05
// @grant       none
// ==/UserScript==

var replacements, regex, key, textnodes, node, s;

replacements = {
//术语
    "ブレイク": "BREAK",
    "レア度": "稀有度",
    "獣": "兽",
    "鳥": "鸟",
    "発光体": "发光体",
    "竜": "龙",
    "浮遊体": "浮游体",
    "シルエット": "魔影",
    "リロード": "RELOAD",
    "ハンティング": "狩猎",
    "コロシアム": "斗兽场",
    "クエスト": "任务",
    "タイプ": "类型",
    "ダメージ": "伤害",
    "カード": "卡牌",
    "機械": "机械",
    "名前": "名称",
    "出現場所": "出现场所",
    "グレイブロウ": "葛雷布罗",
    "ストームリーチ": "风暴降临",
    "バーンサイド": "伯恩赛德",
	
//其他词汇
    "イベ限定": "活动限定",
    "雑誌配布": "杂志特典",
    "イベント": "活动",
    "モンスター": "怪物",
    "図鑑": "图鉴",


//技能
    "スキル": "技能",
    "アビリティ": "能力",
    "デバフ": "Debuff",
    "バフ": "Buff",
    "アップ": "UP",
    "効果": "效果",
    "ダウン": "DOWN",
    "その他": "其他",
    "が出た際に": "登场时",
    "補助": "辅助",

//技能攻击    
    "ハードスラッシュ": "重斩",
    "クロススラッシュ": "凶斩",
    "スラッシュ": "猛斩",
    "ヘビーブロー": "重击",
    "ハードブロー": "强击",
    
    "バーニングストライク": "燃烧强击",
    "バーニングビート": "燃烧打击",
    
    "アクアショット": "水之射击",
    "アクアスプラッシュ": "水之飞溅",
    
    "アースニードル": "大地针刺",
    "アーススパイク": "大地尖峰",
        
    "サンダーボルト": "雷霆万钧",
    "コールライトニング": "召唤闪电",
    
    "ウィンドエッジ": "风之利刃",
    "ウィンドカッター": "风之斩刀",
    
    "ホーリーライト": "圣光",
    "シャインスマイト": "圣光打击",
    
    "ダークネス": "黑暗",
    "ダークペイン": "黑暗痛楚",
    "ナイトメア": "梦魇",
    
    "ポイズンバブル": "剧毒泡沫",

    "クイックストライク": "快攻",

   
//辅助：自能力UP/Buff
    "グレーターマイト": "高级英勇",
    "マイト": "英勇",
    "グレーターカニング": "高级诡诈",
    "カニング&ヘイスト": "诡诈急速",
    "賢早": "急智",
    "プロテクト": "庇护",
    
//辅助：敵能力DOWN/Debuff
    "マインドブラスト": "意志冲击",
    "スロー": "缓速",

//辅助：其他	
    "ヒール": "治愈",
    "ラストスタンド": "背水一战",
    "一撃耐える": "承受一击",

//性格
    "エース": "精英",
    "クール": "冷酷",
    "カオス": "混乱",
//    "ワイルド": "DOWN",
    "セクシー": "性感",
//    "バージン": "超绝",
    "パワフル": "强大",
//    "バーサク": "神族",
    "ブレイブ": "勇敢",
//    "ヒーロー": "全种族",
    "ヘイスト": "急速",
//    "ソニック": "UP",
    "インテリ": "聪明",
//    "ワイズ": "DOWN",

//属性
    "素早さ": "急速",
    "賢さ": "智慧",
    "攻撃": "攻击",
    
//史莱姆系
    "レッドスライム": "红史莱姆",
    "ゴールドスライム": "金史莱姆",
    "シルバースライム": "银史莱姆",
    "スライム": "史莱姆",

//特典招待等卡
    "カリュブディス": "漩涡海魔",
    "バンシ－・レクイエム": "班西女妖·安魂曲",
    "リッチ": "巫妖",
    "エキドナ": "艾奇德娜",
    "スフィンクス": "斯芬克斯·海拉克",


//平原五星
    "リヴァイアサン": "利维坦",
    "タイタン": "泰坦",
    "ヴァンパイアロード": "吸血鬼领主",
    "フェニックス": "凤凰",
    "ヴァルキリー": "女武神",
    "アプサラス": "飞天女神",
    "アジ・ダカーハ": "阿基·达卡哈",
    "ガルガンチュア": "卡冈都亚",
    "フランケンシュタイン": "科学怪人",
//平原四星
    "ヨルムンガンド": "耶梦加得",
    "ヴァンパイア": "吸血鬼",
    "ヘカトンケイル": "百臂巨神",
    "窮奇": "穷奇",
    "パズズ": "帕祖祖",
    "エンジェル": "天使",
    "クラーケン": "海怪",
    "レブナント": "还魂亡灵",
//平原三星
    "ナーガ": "娜迦",


//火山五星
    "バハムート": "巴哈姆特",
    "イフリート": "伊夫里特",
    "ジャガーノート": "人族",
    "ドミニオン": "主天使",
    "メフィストフェレス": "墨菲斯托菲雷斯",
    "スケルス": "斯凯尔斯",
    "チャリオット": "古战车",
    "エティン": "双头巨人",
    "アグニ": "阿格尼",
    "ジャガーノート": "刚力战车",
    "ギルガメッシュ": "吉尔伽美什",
//火山四星
    "ゴーレム": "土偶",
    "バグベア": "妖怪",
    "ドワーフギア": "矮人装备",
    "バロール": "巴罗尔",

//雪原五星
    "アトラス": "阿特拉斯",
    "ステュムパリデス": "青铜鸟",
    "シヴァ": "湿婆",
    "ブリザード": "暴风雪",
    "プロケル": "布诺鲸教授",
    "トール": "托尔",
    "モリガン": "莫莉卡",
//雪原四星
    "スペクター": "冥斗士",
    "フォルネウス": "弗内乌斯",
    "スカジ": "斯嘉蒂",
    "パワー": "能天使",
    "ヨツン": "霜巨人",
    "タロス": "塔罗斯",
//雪原三星	
    "アミィ": "阿弥伊",
	
	


    };
regex = {};
for (key in replacements) {
    regex[key] = new RegExp(key, 'g');
}

textnodes = document.evaluate(
    "//text()",
    document,
    null,
    XPathResult.UNORDERED_NODE_SNAPSHOT_TYPE,
    null);
for (var i = 0; i < textnodes.snapshotLength; i++) {
    node = textnodes.snapshotItem(i);
    s = node.data;
    for (key in replacements) {
	s = s.replace(regex[key], replacements[key]);
    }
    node.data = s;
}

//
// ChangeLog
// 
// by 热辣蘑菇君