// ==UserScript==
// @name           Arion.Social.Command@Plurk
// @namespace      http://summerwxy.blogspot.com/
// @description    Arion social command at Plurk
// @include        http://www.plurk.com/*
// ==/UserScript==

(function() {
  var socials = [
    [
        "3q",
        "謝謝",
        "你俏皮的說了聲謝啦",
        "$n 俏皮的眨眼說了聲謝啦.",
        "你俏皮的搥$M的肩說謝啦.",
        "$n 俏皮的搥 $N 的肩說謝啦.",
        "$n 俏皮的搥你的肩說謝啦.",
        "你俏皮的說了聲謝啦.",
        "$n 俏皮的說了聲謝啦."
    ],
    
	  [
        "accuse",
        "責備",
        "你要控告誰?",
        "$n 怒髮衝冠, 在媒體們的面前按著法院控告鈴.",
        "你要控告$M始亂終棄.",
        "$n 控訴著 $N 的始亂終棄.",
        "$n 控訴你對他(她)始亂終棄.",
        "你自責的認為自己不應該.",
        "$n 為自己的不應該自責不已."
    ],

    [
        "applaud",
        "喝采",
        "你興高采烈的拍拍手.",
        "$n 高興的拍起手來.",
        "你對$S行為喝采, 拍起手來.啪!啪!啪...",
        "$n 對 $N 的行為喝采, 拍起手來.啪!啪!啪...",
        "$n 對著你高興的拍手.你一定做了些好事!",
        "你給你自己熱烈的掌聲.孩子,不要太自大喔.",
        "$n 給自己熱烈的掌聲.一付很得意的樣子."
    ],

    [
        "agree",
        "贊同",
        "你似乎同意了。",
        "$n 看來同意了。",
        "你贊同$S意見。",
        "$n 贊同 $N 的意見。",
        "$n 贊同你的意見。",
        "嗯....希望你是真的同意你自己的意見!",
        "$n 同意$m自己的意見，這是當然的。"
    ],

    [
        "aluba",
        "阿魯巴",
        "你想阿魯巴誰啊？",
        "$n 不懷好意的想要找人來阿魯巴。",
        "你瘋狂的往 $S 的跨下'阿'下去！",
        "$n 把 $N 抓起來瘋狂的阿魯巴！",
        "$n 把你抓起來瘋狂的阿魯巴！",
        "你的胯下開始癢了起來。",
        "$n 的胯下好像很癢，希望大家幫 $M 阿一下。"
    ],

    [

        "apologize",
        "道歉",
        "你為你的魯莽行為道歉。",
        "$n 為$s粗魯行為道歉。",
        "你對 $N 道歉。",
        "$n 對 $N 道歉。",
        "$n 對你道歉。",
        "你對你自己道歉。",
        "$n 對$m自己道歉。嗯......"
    ],

    [

        "attract",
        "誘惑",
        "你想誘惑誰啊 ?? ",
        "$n 一直拋著媚眼，不知道想誘惑誰。",
        "你對 $N 頻拋著媚眼，似乎想暗示$M什麼。",
        "$n 對 $N 頻拋著媚眼，似乎想暗示著什麼。",
        "$n 對你頻拋著媚眼，似乎想暗示著什麼。",
        "你對你自己頻拋著媚眼，幹嘛??自戀啊!!",
        "$n 的眼睛一直轉啊轉著，好像不太舒服的樣子"
    ],

    [
        "badjoke",
        "冷笑話",
        "你四處找著人要講冷笑話。",
        "$n 左顧右盼的想找人講冷笑話。",
        "$N 的冷笑話把你凍傷了！",
        "$N 的冷笑話把 $n 凍傷了！",
        "$n 被你的冷笑話凍傷了！",
        "你開始唸著 冷笑話 咒語。",
        "$n utters the words, '冷笑話'."
    ],

    [
        "bangwall",
        "撞牆",
        "你四處找尋著可以拿去撞牆的人頭。",
        "$n 左顧右盼的找尋著可以拿去撞牆的人頭。",
        "你用力的把 $N 往牆上撞下去，一圈兩圈三圈 啾？啾？啾？",
        "$n 用力的把 $N 往牆上撞下去，一圈兩圈三圈 啾？啾？啾？",
        "$n 用力的把你的頭往牆上撞下去，一圈兩圈三圈 啾？啾？啾？",
        "你拼命用頭猛敲著牆壁。",
        "$n 大喊一聲：鐵頭功！$n 開始瘋狂的用頭狂敲著牆壁。"
    ],

    [
        "bark",
        "吠叫",
        "汪～～",
        "$n 像狗一樣吠叫.",
        "你對著$M吠叫.",
        "$n 對著 $N 吠叫.",
        "$n 對著你吠叫.",
        "你對著你自己吠叫.汪～～",
        "$n 對著$m自己吠叫.汪～～"
    ],
/* $S : 性別(第三人稱)加的(ex: 他的) $M :性別(第三人稱) 無的
   大寫為 target 之性別，小寫為本身*/
    [
        "beer",
        "喝酒",
        "你喝下了又冰又涼的啤酒，啊, 好棒啊!",
        "$n 喝下了又冰又涼的啤酒，露出滿意的笑容。",
        "你請 $N 喝又冰又涼的啤酒。",
        "$n 請 $N 喝又冰又涼的啤酒。",
        "$n 請你喝又冰又涼的啤酒。",
        "你請自己喝又冰又涼的啤酒。",
        "$n 請自己喝又冰又涼的啤酒。"
    ],

    [
        "beg",
        "要錢",
        "你祈禱眾神的善意救助。",
        "天使輕蔑地嘲笑 $n 的請求。",
        "你低著頭向 $N 要錢。",
        "$n 低著頭向 $N 要錢。",
        "$n 低著頭向你要錢。",
        "嘿！白痴！向自己要的到錢嗎？",
        "$n 那個白痴竟然向自己要錢....！！！"
    ],

    [
        "bench",
        "板凳",
        "好！折！凳！",
        "$n 不停的搖晃著手中的絕世好折凳。",
        "你對著 $N 大叫：看七武器之首！好折凳凳凳凳凳凳凳凳凳凳！",
        "$n 從背後拿出超級好折凳，以狂風暴雨之勢猛烈地攻擊 $N ！",
        "$n's 板凳攻擊 *[0m*[35;1m. . .V   O   I   D   E   S. . .*[0m you !",
        "你很仔細的擦拭著你最心愛的武器─超級好折凳。",
        "$n 不知道從哪邊搬出一張板凳來，還大搖大擺的坐在那邊？！"
    ],

    [
        "bite",
        "咬人",
        "你在長牙齒嗎, 很癢嗎？",
        "$n 用力的在磨自己的牙.",
        "你大力的咬了 $N 一下!",
        "$n 大力的咬了 $N 一下!",
        "$n 大力的咬了你一下! 唉呦! 痛啊~~~",
        "你輕輕的咬著自己的手指頭..",
        "$n 輕輕的咬著自己的手指頭.."
    ],

    [
        "bleat",
        "羊叫",
        "咩～～～咩～～～咩～～～",
        "$n 咩咩地學著羊叫..",
        "你低頭對著 $N 訴苦.. 唉～好哀怨啊～",
        "$n 低頭對著 $N 訴苦，一副很哀怨的樣子..",
        "$n 低頭對著你訴苦，一副很哀怨的樣子..",
        "碎碎唸～碎碎唸～碎碎唸～",
        "$n 低聲對著自己碎碎唸，不知在唸些什麼.."
    ],

    [
        "bless",
        "祝福",
        "你想要祝福誰呢?",
        "$n 雙手合十,好像想幹嘛.",
        "你祝福 $N 心想事成。",
        "$n 祝福 $N 心想事成。",
        "$n 祝福你心想事成。",
        "你祈求天神的祝福。",
        "$n 誠摯的向天神祈求。"
    ],

    [
        "blush",
        "臉紅",
        "你的臉不禁紅了起來.真不好意思.",
        "$n 的臉紅了起來,一付很不好意思的樣子.",
        "你一臉狼狽地看著$M.",
        "$n 滿臉通紅地看著 $N.",
        "$n 滿臉通紅地看著你.",
        "你因不好意思而臉紅了起來.",
        "$n 因不好意思而臉紅了起來."
    ],

    [
        "bone",
        "丟骨頭",
        "你從浪跡天涯小包包內拿出一根狗骨頭。",
        "$n 從浪跡天涯小包包內拿出一根狗骨頭。",
        "你用力往 $N 的方向丟了一根狗骨頭。",
        "$n 用力往 $N 的方向丟了一根狗骨頭， $N 朝著狗骨頭狂奔而去。",
        "你往 $n 丟骨頭的地方跑去。",
        "你開心的啃著不知道從哪邊叼來的大骨頭。",
        "$n 開心的蹲在地上啃著不知道從哪邊叼來的大骨頭。"
    ],

    [
        "boring",
        "無聊",
        "你快生蜘蛛網了啦.",
        "$n 無聊到蹲在地上畫著圈圈.",
        "不會吧，你居然閒到在幫 $N 抓跳蚤了..",
        "$n 無聊到幫 $N 抓跳蚤了.",
        "哇，$n 閒到在幫你抓跳蚤了.",
        "你真是太閒了，無聊到在數自己的頭髮....啊 !! 分岔 >_<",
        "$n 無聊到在數自己的頭髮，一根、兩根、三根......."
    ],

    [
        "bounce",
        "亂跳",
        "你像瘋了似的跳來跳去.",
        "$n 在四周跳來跳去的.",
        "你在$S四周跳來跳去的.",
        "$n 在 $N 的四周跳來跳去的.",
        "$n 在你的四周跳來跳去的.",
        "對自己誇獎了一番, 真是了不起啊!",
        "$n 對自己用力的褒許一下."
    ],

    [
        "bow",
        "鞠躬",
        "你深深的一鞠躬.",
        "$n 深深的一鞠躬.",
        "你對$M深深的一鞠躬.",
        "$n 對 $N 深深的一鞠躬,表示了$s謝意及敬意.",
        "$n 對你深深的一鞠躬,以表示$s謝意.",
        "你無緣無故鞠恭幹嘛?",
        "$n 彎下腰來不知要幹嘛."
    ],

    [
        "burp",
        "打嗝",
        "你大聲地打嗝。",
        "$n 大聲地打嗝。",
        "你沒禮貌地對著 $N 打嗝。",
        "$n 沒禮貌地對著 $N 打嗝 , 好嘔喔。",
        "$n 沒禮貌地對你打嗝 , ㄜ , 是榴槤嗎?",
        "你用力地打嗝。",
        "$n 大聲地打嗝 , ㄜ , 是榴槤."
    ],

    [
        "cackle",
        "咯咯地笑",
        "你像隻母雞一樣的咯咯地笑!!",
        "$n 像隻母雞一樣的咯咯地笑!!",
        "你像隻母雞一樣的對 $N 咯咯地笑!",
        "$n 像隻母雞一樣的對 $N 咯咯地笑!",
        "$n 像隻母雞一樣的對你咯咯地笑!  你最好離$m這隻老母雞遠一點!!。",
        "你對自己咯咯地笑!  你是不是發瘋了?!",
        "$n 真的發瘋了!  $e竟然對自己咯咯笑!?"
    ],

    [
        "chuckle",
        "輕笑",
        "你輕掩嘴角，淡淡地笑了笑。",
        "$n 輕掩嘴角，淡淡地笑了笑。",
        "你對$m開的玩笑輕蔑地笑笑!",
        "$n 對 $N 開的玩笑輕蔑地笑笑!",
        "$n 對你開的玩笑輕蔑地笑笑!",
        "你楞楞地對自己笑笑，即使沒人欣賞你的笑話。",
        "$n 楞楞地對自己笑笑，即使沒人欣賞$s笑話。"
    ],

    [
        "clap",
        "拍手",
        "你高興地拍起手來。",
        "$n 高興地拍起手來表示$s贊同!!",
        "你高興地拍起手來表示支持$S舉動。",
        "$n 高興地拍起手來表示支持 $N 的舉動。",
        "$n 高興地拍起手來表示支持你的舉動。",
        "你高興地拍起手來以堅定自己行動的信心!",
        "$n 高興地拍起手來以堅定自己行動的信心!"
    ],

    [
        "comb",
        "梳髮",
        "你輕柔地梳著你的頭髮.",
        "$n 輕柔地梳著$s頭髮.",
        "你幫$S梳理他的頭髮!",
        "$n 幫 $N 梳理他的頭髮.",
        "$n 幫你梳理你的頭髮",
        "你整一整自己的頭髮, 嗯! 這樣帥多了.",
        "$n 整理自己有點亂的頭髮."
    ],

    [
        "comfort",
        "安慰",
        "你覺得不舒服嗎?",
        "$n 似乎覺得有點不舒服.",
        "你試著安慰$M.",
        "$n 正在安慰 $N.",
        "$n 試著安慰你.",
        "你覺得很空虛，你試著安慰你自己.",
        "沒有人安慰 $n，所以 $n 只好自己安慰自己."
    ],

    [
        "confuse",
        "疑惑",
        "你覺得頭腦裡一陣混亂.",
        "$n 似乎感到很迷惑的樣子..",
        "你對 $N 這樣的行為不太了解..",
        "$n 似乎不太了解 $N $S意思..",
        "$n 似乎不太了解你的意思..",
        "你惱怒自己的膚淺, 自怨自艾的..",
        "$n 似乎惱怒著自己的膚淺, 站在一旁自怨自艾.."
    ],

    [
        "cong",
        "恭喜",
        "你大聲的向大家說恭喜.",              /*無target時，自己看到的訊息*/
        "$n 大聲的向所有人說恭喜.",           /*無target時，旁人看到的訊息*/
        "你握著 $N 的手,大聲的向$M說恭喜.",     /*有target時，自己看到的訊息*/
        "$n 握著 $N 的手,大聲的向$M說恭喜.",    /*有target時，旁人看到的訊息*/
        "$n 用力握著你的手向你說恭喜.",       /*有target時，target看到的訊息*/
        "你對著自己說--恭喜恭喜,你到底不愧是整人界的第一高手.",       /*target為自己時，自己看到的訊息*/
        "$n 對著自己說--恭喜恭喜,你到底不愧是整人界的第一高手."       /*target為自己時，旁人看到的訊息*/
    ],

    [
        "coquet",
        "撒嬌",
        "你在思春啊.",
        "$n 無緣無故的露出怪異的表情，是春天到了嗎?",
        "你幹嘛賴在 $N 身上啊.",
        "$n 撒嬌似的賴在 $N 身上不肯起來.",
        "$n 撒嬌的賴在你的身上.",
        "跟自己撒嬌幹嘛啊，笨蛋!",
        "$n 顧影自憐的自言自語著"
    ],

    [
        "cpr",
        "急救",
        "你捲起袖子嘟起嘴準備進行心肺復甦術.",
        "$n 捲起袖子嘟起嘴準備示範心肺復甦術.",
        "你用力的把拳頭打在 $N 的心臟位置,嘴一直往下壓去.",
        "$n 用拳頭用力的敲 $N 的心臟,試圖用嘴悶昏 $N.",
        "$n 用力的把拳頭打在你的心臟位置.",
        "有正常人能 CPR 自己嗎，笨蛋!",
        "$n 用力的把拳頭打在自己的心臟位置."
    ],

    [
        "crazy",
        "發狂",
        "你覺得快受不了! 快發瘋了～～",
        "$n 瘋狂的抓著自己的頭髮!",
        "你對著 $N 瘋狂似的大叫!",
        "$n 像瘋了似的對著 $N 又叫又跳!",
        "$n 瘋狂的對著你狂嘯! 又叫又跳!",
        "你真的瘋了?!",
        "$n 看起來真的發瘋了! 邊抓著自己的頭髮又叫又跳的!"
    ],

    [
        "cringe",
        "畏懼",
        "你忍不住恐懼躲在牆角顫抖～～",
        "$n 忍不住恐懼躲在牆角顫抖～～",
        "你像躲著鬼神般地躲著 $N。",
        "$n 像躲著鬼神般地躲著 $N。",
        "$n 像躲著鬼神般地躲著你。",
        "你做了啥事令你自己也感到恐懼!?",
        "$n 像個神經病般的躲到牆角去."
    ],

    [
        "cry",
        "哭泣",
        "你大聲的哭叫...",
        "$n 傷心的流下眼淚.",
        "你傷心的躺在$S胸懷,大聲的哭起來.",
        "$n 傷心的躺在 $N 的胸懷,大聲的哭起來.",
        "$n 傷心的躺在你的胸懷,大聲的哭起來.",
        "你傷心的哭起來.",
        "$n 傷心的對著自己哭."
    ],

    [
        "cuddle",
        "擁抱",
        "你想要抱著誰睡覺呢？",
        "寂寞的 $n 正期待一個可以相擁而眠的人。",
        "你沈浸在愛情的懷抱裡擁吻著 $N。",
        "$n 沈浸在愛情的懷抱裡擁吻著 $N。",
        "$n 沈浸在愛情的懷抱裡擁吻著你。",
        "擁抱自己的感覺是不是很棒呢？",
        "$n 沈浸在愛情的懷抱裡擁吻著自己，唉! 多寂寞的一個人啊!"
    ],

    [
        "curse",
        "咒罵",
        "你藉著大聲的咒罵來發洩心中的不滿.",
        "$n 心有不滿的大聲咒罵著: @*&^%@*&!",
        "你大聲咒罵著$M.",
        "$n 大聲咒罵著 $N.",
        "$n 大聲咒罵著你! 你哪裡得罪了人家啊?",
        "你為自己的錯而責備自己.",
        "$n 正在為自己的錯而責備自己. 你要不要幫忙他啊?"
    ],

    [
        "curtsey",
        "行禮",
        "你很有禮貌的向大家鞠躬行禮.",
        "$n 優雅的屈膝鞠了躬.",
        "你很有禮貌的向$M鞠了躬.",
        "$n 很優雅的向 $N 鞠了個躬.",
        "$n 優雅的對你鞠了個躬.",
        "你對鏡中的自己鞠躬???!?!?!?",
        "$n 正站在鏡子前面練習如何鞠躬才好看."
    ],

    [
        "dance",
        "跳舞",
        "你高興的說--shall we dance!",
        "$n 高興的在$s自己身邊飛舞起來...!",
        "你高興的拉起$M的手跳起舞來.",
        "$n 高興的拉起 $N 的手跳起舞來.",
        "$n 歡喜的跳起舞來,轉啊轉....",
        "你歡喜的跳起舞來,轉啊轉....",
        "$n 高興的跳起恰恰來."
    ],

    /*
     * This one's for Baka, Penn, and Onethumb!
     */

    [
        "die",
        "裝死",
        "你躺在地上裝死!",
        "$n 直躺躺的死了!",
        "你冷冷的視線盯著 $N 看!",
        "不知怎麼的.. $n 以冰冷的視線盯著 $N.",
        "$n 冷冷的盯著你看!",
        "你冷冷的環顧四週.",
        "$n 冷冷的環顧四週."
    ],

    [
        "drool",
        "垂涎",
        "哇!你的口水流出來了.",
        "$n 的口水流出來了.",
        "你張大嘴對 $N 流著口水.",
        "$n 張大嘴對 $N 流著口水.",
        "$n 像隻大色狼一樣的對你流著口水!",
        "你的口水滴到自己了啦!",
        "$n 滴著口水, 露出一臉白癡像."
    ],

    [
        "dryeye",
        "拭淚 ",
        "你拭去了臉上的眼淚..",
        "$n 拭去了臉上的眼淚..",
        "你輕輕的拭去 $N 臉上的眼淚..",
        "$n 伸出手拭去了 $N 臉上的眼淚..",
        "$n 輕輕的拭去你臉上的眼淚..",
        "你自己勇敢的擦掉淚水.",
        "$n 勇敢的擦乾自己的淚水."
    ],

    [
        "doubt",
        "懷疑",
        "你臉上露出了懷疑的表情.",
        "$n 的臉上露出懷疑的表情.",
        "你對著 $N 投以懷疑的眼神.",
        "$n 對著 $N 投以懷疑的眼神.",
        "$n 對著你露出了懷疑的表情.",
        "你在懷疑你自己嗎?",
        "$n 似乎不敢相信自己的舉動.."
    ],

    [
        "egomania",
        "自大狂",
        "口胡！我是真正強者啊！",                /*無target時，自己看到的訊息*/
        "$n 這廢材，竟妄想要逆天！",             /*無target時，旁人看到的訊息*/
        "口桀！看我把你轟殺！",                  /*有target時，自己看到的訊息*/
        "$n 和 $N 這兩個未夠班的，拿著折凳在PK！",/*有target時，旁人看到的訊息*/
        "大鑊了！$n 帶著殺意朝你衝過來.",         /*有target時，target看到的訊息*/
        "你目中無人的放聲狂笑！",                /*target為自己時，自己看到的訊息*/
        "$n 目中無人的放聲狂笑！",               /*target為自己時，旁人看到的訊息*/

    ],

    [
        "faint",
        "昏倒",
        "你昏倒了.",
        "$n 突然昏倒了.",
        "哇, $N 實在太誇張,昏倒.",
        "$N 實在太誇張, $n 昏倒了.",
        "你實在太誇張, $n 昏倒了.",
        "你直挺挺的昏下去.",
        "$n 直挺挺的倒下去親地球."
    ],

    [
        "fart",
        "放屁",
        "喂! 你真沒水準說!",
        "$n 放了一個響徹雲霄的大屁!",
        "你抬起屁股對準了$M. 噗!.....必殺奧義!臭死你!",
        "$n 抬起屁股對準 $N .噗! 噗! 噗! 趕快逃啊! 下一個目標說不定就是你!",
        "$n 對你放了個又大又臭的屁. 噁!",
        "你深吸一口! 自己的屁果然是比較香.",
        "$n 用力吸了一口自己放的屁! 真是噁心!"
    ],

    [
        "fever",
        "發燒",
        "你用右手背按了按額頭 , 好像有點發燒.",
        "$n 挑起眉頭說 : 有誰發燒了嗎 ? 還是瘋了 ?",
        "你按了按 $N 的額頭 , 喃喃地說 : 沒發燒啊 , 怎麼一直瘋言瘋話.",
        "$n 按了按 $N 的額頭 , 喃喃地說 : 沒發燒啊 , 怎麼一直瘋言瘋話.",
        "$n 按了按你額頭 , 喃喃地說 : 沒發燒啊 , 怎麼一直瘋言瘋話.",
        "你用右手背按了按額頭 , 好像有點發燒.",
        "$n 挑起眉頭說 : 有誰發燒了嗎 ? 還是瘋了 ?"
    ],

    [
        "flop",
        "摔跤",
        "你不小心的摔了一跤.",
        "$n 突然跌了一跤, 真是不小心啊.",
        "你在 $N 面前跌了一跤, 真不好意思.",
        "$n 在 $N 面前跌了一跤, 臉都紅了..",
        "$n 在你面前突然跌了一跤, 真是不小心啊.",
        "你左腳踩到了右腳 , 跌了個狗吃屎.",
        "$n 左腳踩到了右腳 , 跌了個狗吃屎."
    ],

    [
        "fondle",
        "輕撫",
        "誰需要撫摸啊?",
        "$n 伸出手來 , 想摸什麼?",
        "你溫柔的撫摸著$M.",
        "$n 溫柔的撫摸著 $N.",
        "$n 溫柔的撫摸著你.",
        "你輕輕的摸著自己的全身 , 嗯 , 感覺不錯?",
        "$n 輕輕的摸著自己的全身 , 天啊 , 該死的性感 !!"
    ],

    [
        "foot",
        "踹人",
        "你抬起短短的肥腿，想要踹誰發洩啊？",
        "$n 抬起短短的肥腿，不知道想要幹嘛？",
        "你抬起短短的肥腿，狠狠的把 $N 踹的死去活來。",
        "$n 抬起短短的肥腿，狠狠的把 $N 踹的死去活來。",
        "$n 抬起短短的肥腿，狠狠的踹了你一腳，哇～～～好痛喔！",
        null,
        null
    ],

    [
        "french",
        "熱吻",
        "要親誰啊?",
        "$n 你嘟起嘴伸出舌頭 , 想幹嘛?",
        "你給 $N 深深的永恆的一吻.",
        "$n 給 $N 深深的永恆的一吻.",
        "$n 給你深深的永恆的一吻.",
        "你試著想親自己.",
        "$n 努力的歪嘴想親自己 , 看來不知在幻想什麼."
    ],

    [
        "frown",
        "困擾",
        "什麼事困擾著你?",
        "$n 似乎很困擾的樣子.",
        "你困擾在於$E做了什麼.",
        "$n 困擾在於$E做了什麼.",
        "$n 困擾在於你作了什麼.",
        "你像個笨蛋的鑽牛角尖.",
        "$n 像個笨蛋的在鑽牛角尖."
    ],

    [
        "gasp",
        "訝異",
        "你驚訝的大聲喘氣著.",
        "$n 因為訝異而用力的喘氣著.",
        "你對$M做的事情感到非常的訝異!",
        "$n 對 $N 所做的事情感到相當的驚訝!",
        "$n 對於你做的事情訝異的跳了起來!!",
        "你對自己做的事都感到很訝異!",
        "$n 對於自己做的事情都感到相當的訝異呢!!"
    ],

    [
        "giggle",
        "格格笑",
        "你格格的笑.",
        "$n 格格的笑.",
        "你在$S面前格格的笑.",
        "$n 在 $N 面前格格的笑.",
        "$n 對著你格格的笑.!",
        "你對自己格格的笑,你覺得太爽了.",
        "$n 對著$m格格的笑.$e覺得太爽了."
    ],

    [
        "glare",
        "瞪人",
        "你雙眼露出憤怒的眼神.",
        "$n 對著$m露出憤怒的眼神.",
        "你冷冷的瞪著$M.",
        "$n 冷冷的瞪著 $N.",
        "$n 冷冷的瞪著你, 你是不是有做錯啥啊?",
        "你瞪著自己的雙手.",
        "$n 瞪著遠方."
    ],

    [
        "godie",
        "去死團",
        "你發出強烈的怨念，希望天下的情侶都去死",      /*無target時，自己看到的訊息*/
        "$n 架起天線，強力放送情侶去死去死的怨念.",    /*無target時，旁人看到的訊息*/
        "你集中意念，招換井澤和前野一起咒殺 $N.",      /*有target時，自己看到的訊息*/
        "$n 對著 $N 發出十萬伏特的忌妒和怨念.",        /*有target時，旁人看到的訊息*/
        "$n 對你發出無限大的怨念，讓你感到脊背發涼.",  /*有target時，target看到的訊息*/
        "情侶的分手，就是我的快樂啊！",                /*target為自己時，自己看到的訊息*/
        "榮譽團員 $n 宣誓將永遠效忠去死去死團."        /*target為自己時，旁人看到的訊息*/

    ],

    [
        "glassy",
        "眼無神",
        "你看起來超級無神，小心爆肝喔！！",                 /*無target時，自己看到的訊息*/
        "$n 應該很累吧，看起來很無神⊙_____⊙。",             /*無target時，旁人看到的訊息*/
        "你對著 $N 露出無神的眼神⊙_____⊙。",                /*有target時，自己看到的訊息*/
        "$n 對著 $N 露出無神的眼神，似乎累壞了⊙_____⊙。",      /*有target時，旁人看到的訊息*/
        "$n 對著你露出無神的眼神⊙_____⊙，勸他好好休息吧。", /*有target時，target看到的訊息*/
        "你顯的超級無神，看起來像個呆子⊙_____⊙。",          /*target為自己時，自己看到的訊息*/
        "$n 顯的超級無神，似乎看不到任何人⊙_____⊙。"       /*target為自己時，旁人看到的訊息*/

    ],

    [
        "grin", 
        "邪笑",
        "你露出邪惡的笑容.",
        "$n 露出邪惡的笑容.",
        "你對$M露出邪惡的笑容.",
        "$n 對 $N 露出邪惡的笑容.",
        "$n 對你露出邪惡的笑容.嗯,最好趕快離開這裡.",
        "你露出邪惡的笑容. 你是不是有啥邪惡的念頭啊?",
        "$n 露出邪惡的笑容. 他一定有了非常邪惡的念頭!"
    ],

    [
        "grimace",
        "扮鬼臉",
        "你吐吐舌頭，扮了個鬼臉.",
        "$n 俏皮的扮了個鬼臉.",
        "你對$M頑皮的扮了個鬼臉.",
        "$n 對 $N 頑皮的扮了個鬼臉.",
        "$n 對你頑皮的扮了個鬼臉.",
        "你心虛的吐了吐舌頭，是不是做了什麼壞事啊?",
        "$n 心虛的吐了吐舌頭，不知道做了啥事."
    ],

    [
        "groan",
        "呻吟",
        "你大聲的呻吟著.",
        "$n 大聲的呻吟著.",
        "你一看見$M就大聲呻吟著.",
        "$n 一看見 $N 就大聲呻吟著.",
        "$n 一看見你就大聲呻吟著.",
        "你正為了自己遭受的痛苦而呻吟著.",
        "$n 正為了自己遭受的痛苦而呻吟著."
    ],

    [
        "grovel",
        "卑微",
        "你像隻毛毛蟲一樣在地上爬.",
        "$n 像隻毛毛蟲一樣在地上爬.",
        "你對著$M奴顏婢膝著.",
        "$n 對著 $N 奴顏婢膝著.",
        "$n 對著你奴顏婢膝著.",
        "你在地上努力的爬啊爬 , 滾啊滾.",
        "$n 在地上爬來爬去 , 向你爬來 ."
    ],

    [
        "growl",
        "吼叫",
        "啊嗚...........",
        "$n 大聲的吼叫著!",
        "啊嗚........... 啊嗚..........",
        "$n 大聲的對 $N 吼叫著. 好像有很多不滿的樣子.",
        "$n 大聲的對你吼叫著. 你是不是有地方得罪他啊?",
        "你大聲的吼叫.",
        "$n 大聲的吼叫."
    ],

    [
        "grumble",
        "發牢騷",
        "@#$@#%$###.",
        "$n 因為不滿而大發牢騷.",
        "@$%#$%$&##.",
        "$n 正對著 $N 大發牢騷.",
        "$n 正對著你大發牢騷, 他對你哪裡不滿啊?",
        "@#$@%#%$%#.",
        "$n 大聲的發著牢騷! 好像全世界都欺負他!"
    ],

    [
        "grunt",
        "咕嚕叫",
        "咕嚕..咕嚕..",
        "$n 像隻豬一樣的發出咕嚕的聲音.",
        "你咕嚕咕嚕的對著$M叫.",
        "$n 像隻豬一樣咕嚕咕嚕的對著 $N 叫.",
        "$n 像隻豬一樣咕嚕咕嚕的對著你叫.",
        "你因為無聊而學豬叫.",
        "$n 學著豬一樣的對自己叫."
    ],

    [
        "hammer",
        "敲頭",
        "你想要敲誰的頭啊?",
        "$n 舉起了跟惠香借來的鎚子.",
        "你拿起一把上面寫著「天譴」的大榔頭往 $N 頭上敲去!",
        "$n 拿起一把大榔頭把 $N 敲的不省人事!",
        "$n 拿起一把上面寫著「天譴」的大榔頭往你頭上敲去!",
        "你敲自己的頭幹嘛啊? :P",
        "$n 拿起大榔頭往自己頭上敲去! 你看見蝴蝶在$s頭上飛來飛去說.",
    ],

    [
        "hand",
        "吻手",
        "你要親誰的手?",
        "$n 正在找手親.",
        "你親吻著$S手.",
        "$n 親吻著 $N 的手.",
        "$n 親吻著你的手.",
        "你親吻自己的手.",
        "$n 親吻著$s的手."
    ],

    [
        "handshake",
        "握手",
        "你要跟誰握手?",
        "$n 正在找手握.",
        "你跟 $N 握手表示友善.",
        "$n 跟 $N 握了握手.",
        "$n 跟你握了握手.",
        "你兩手交握.. 想表示什麼呢?",
        "$n 將雙手交握在一起."
    ],

    [
        "hello",
        "打招呼",
        "你熱情的跟所有人打招呼。",
        "$n 很熱情的跟所有人打招呼。",
        "你對著 $N 用力的揮手打招呼。",
        "$n 對著 $N 熱情的揮手打招呼。",
        "$n 對著你非常的熱情的打著招呼。",
        "你很帥氣的替自己做了個自我介紹！",
        "$n 很帥氣的對所有人自我介紹著！"
    ],

    [
        "hmm",
        "嗯",
        "你嗯了一聲.",
        "$n 嗯了一聲似乎欲言又止的.",
        "你對著 $N 皺眉地嗯了一聲欲言又止的.",
        "$n 對著 $N 皺眉地嗯了一聲欲言又止的.",
        "$n 對著你皺眉地嗯了一聲欲言又止的.",
        "你嗯了一聲似乎欲言又止的 , 不知在考慮什麼?",
        "$n 嗯了一聲似乎欲言又止的 , 不知在考慮什麼?"
    ],

    [
        "hop",
        "跳起來",
        "你很高興的跳起來.",
        "$n 高興得跳了起來.",
        "你興奮的拉著 $N 的衣袖跳了起來.",
        "$n 興奮的拉著 $N 的衣袖跳了起來.",
        "$n 興奮的拉著你的衣袖跳了起來.",
        "你興奮的想跳起來.",
        "$n 興奮的跳得老高."
    ],

    [
        "howl",
        "狼嚎",
        "你像隻狼一樣的嗥叫著！",
        "$n 像隻狼一樣的嗥叫著！",
        "你大聲喊叫著 $N 名字！",
        "$n 大聲喊叫著 $N 名字！",
        "$n 大聲喊叫著你名字！",
        null,
        null
    ],

    [
        "hug",
        "擁抱",
        "你要擁抱誰?",
        "$n 到處找人要抱抱.",
        "你熱情的擁抱$M.",
        "$n 熱情的擁抱 $N.",
        "$n 熱情的擁抱你.",
        "你熱情的擁抱自己.",
        "$n 熱情的擁抱$m."
    ],

    [
        "hungry",
        "餓了",
        "你的肚子不爭氣的叫了起來..咕嚕咕嚕～～",
        "$n 餓到肚子都發出咕嚕咕嚕的聲音..",
        "你餓的不顧面子向$M要食物吃..",
        "$n 餓到面子都不顧啦, 伸出手向 $N 要吃的..",
        "$n 厚著臉皮跟你要東西吃..",
        null,
        null

    ],

    [
        "idle",
        "發呆",
        "你一動也不動的站在這裡發呆..",
        "$n 一動也不動的站這這裡發呆..",
        "你癡癡的望著$M 看的都呆掉了..",
        "$n 癡癡的望著 $N 看的都呆掉了..",
        "$n 癡癡的望著你..",
        "你對著自己發呆..",
        "$n 對著自己發呆..",
    ],

    [
        "inject",
        "打針",
        "你揮了揮手中的大型針筒說 : 有誰的臭屁屁癢了啊 ?",
        "$n 揮了揮手中的大型針筒說 : 有誰的臭屁屁癢了啊 ?",
        "你揮了揮手中的大型針筒迅速用力的往$M的屁屁插下去.",
        "$n 揮了揮手中的大型針筒迅速用力的往 $N 的屁屁插下去.",
        "$n 揮了揮手中的大型針筒迅速用力的往你的屁屁插下去.",
        "你揮了揮手中的大型針筒說 : 有誰的臭屁屁癢了啊 ?",
        "$n 揮了揮手中的大型針筒說 : 有誰的臭屁屁癢了啊 ?",
    ],

    [
        "jealous",
        "嫉妒",
        "你在嫉妒誰啊 ?",
        "$n 不知道在對誰吃悶醋.",
        "你一臉嫉妒的看著 $N，一副打翻三大缸醋的樣子",
        "$n 一臉嫉妒的看著 $N，一副打翻三大缸醋的樣子",
        "$n 一臉嫉妒的看著你，一副打翻三大缸醋的樣子",
        "你在對自己吃啥醋啊 ?",
        "$n 莫名其妙的對自己吃起醋來了 .."
    ],

   [
        "kanbade",
        "加油",
        "你拿出小旗子,大聲的加油.",                 /*無target時，自己看到的訊息*/
        "$n 拿出加油旗,大聲的加油.",                /*無target時，旁人看到的訊息*/
        "你拿出小旗子,大聲的幫 $N 加油.",             /*有target時，自己看到的訊息*/
        "$n 拿出加油旗,大聲的幫 $N 加油.",            /*有target時，旁人看到的訊息*/
        "$n 拿出小旗子,大聲的幫你加油.",            /*有target時，target看到的訊息*/
        "你雙手高舉揮舞著小旗子.",                  /*target為自己時，自己看到的訊息*/
        "$n 像白痴一樣的拿著加油旗亂叫亂跳著."      /*target為自己時，旁人看到的訊息*/
    ],

    [
        "kiss",
        "親吻",
        "你要親誰啊!",
        null,
        "你輕輕的吻著$M.",
        "$n 輕輕的吻著 $N.",
        "$n 輕輕的吻著你.",
        "你只親自己, 大家看起來很不高興.",
        null
    ],

    [
        "kuso",
        "惡搞",
        "你立志要惡搞整個亞雷恩.",               /*無target時，自己看到的訊息*/
        "$n 大聲疾呼-----歡樂、惡搞、亞雷恩！",  /*無target時，旁人看到的訊息*/
        "你正經八百地的邀請 $N 加入惡搞的行列.", /*有target時，自己看到的訊息*/
        "$n 和 $N 聯手，要一起惡搞亞雷恩了.",    /*有target時，旁人看到的訊息*/
        "$n 握著你的手，一起奔向夕陽.",          /*有target時，target看到的訊息*/
        "你覺整個世界只有惡搞才是王道.",         /*target為自己時，自己看到的訊息*/
        "$n 碎碎唸著：先行者、蘿莉、兄貴、顏文字……." /*target為自己時，旁人看到的訊息*/

    ],

    [
        "lag",
        "緩慢",
        "你的手指頭在空中慢慢的劃著.. 好慢啊～～",
        "$n 的手指在空中緩緩的移動著, 好像很慢的樣子..",
        "你對著 $M 揮動著你的手指頭.. 慢慢的～～",
        "$n 對著 $N 揮動著他的手指頭.. 時間彷彿慢了下來..",
        "$n 對著你揮動著他的手指頭.. 好慢啊～",
        "你對著自己揮動自己的手指.. 動作好像慢動作一樣..",
        "$n 的動作好像慢了下來.. 一動也不動.."
    ],

    [
        "lay",
        "躺著",
        "$n 累的躺在地上休息, 賴著不起來.",
        "$n 賴在地上休息, 看起來很累的樣子.",
        "你靜靜的躺在$M的懷裡休息.",
        "$n 靜靜的躺在 $N 的懷裡休息.",
        "$n 靜靜的躺在你的懷裡休息.",
        "想躺在自己懷裡?! 撲通! 你跌了一跤!.",
        "$n 想躺在自己的懷裡?! 八成是瘋了."
    ],

    [
        "laugh",
        "大笑",
        "你大笑著.",
        "$n 大笑著.",
        "你對著 $N 大笑,哈!哈哈...哈哈哈.",
        "$n 對著 $N 大笑,哈!哈!哈哈..哈.哈哈.",
        "$n 對著你大笑,哈!哈...哈哈..!.",
        "你對著自己大笑,哈!哈....哈哈哈...",
        "$n 對著$m自己大笑,哈!哈..哈哈哈...哈.!!"
    ],

    [
        "lick",
        "舔人",
        "你舔舔自己.",
        "$n 舔舔自己並喵喵的叫.",
        "你舔舔$M.",
        "$n 舔了舔 $N.",
        "$n 舔舔你",
        "你舔了舔自己並喵喵的叫.",
        "$n 舔舔自己並喵喵的叫."
    ],

    [
        "love",
        "愛意",
        "你想對誰表達你的愛意啊?",
        "$n 找不到人可以讓他表達他的愛意.",
        "你對 $N 款款柔柔地訴說著你心中無限的愛意.",
        "$n 正對著$N訴說著他對 $N 的愛意有多深.",
        "$n 正對你傾訴著他是多麼的愛你.",
        "你有自戀傾向喔!",
        "嗯! $n 是不是有點過度自戀啊?"
    ],

    [
        "massage",
        "按摩",
        "你想替誰按摩啊?",
        "按摩師 $n 又手養了, 有誰要讓他抓一抓啊?",
        "你很溫柔的為 $N 按摩著.",
        "$n 很輕很柔的為 $N 按摩著, 多恩愛的一對啊!",
        "$n 很輕很柔的替你按摩著. Ahhh....好舒服啊!",
        "嗯! 練瑜珈對身體有好處喔!",
        "$n 慢慢把腳舉到頭上來, 準備要表演瑜珈了."
    ],

    [
        "moan",
        "呻吟",
        "你開始呻吟.",
        "$n 開始呻吟.",
        "你難過的開始呻吟起來.",
        "$n 難過的開始呻吟起來.",
        "$n 難過的開始呻吟起來.",
        null,
        null
    ],

    [
        "muhaha",
        "凶狠笑",
        "你凶狠的笑著.. MUHAHAHA..",
        "$n 凶狠的笑著.. MUHAHAHA..",
        "你對著 $N 凶狠的笑著.. MUHAHAHA..",
        "$n 對著 $N 凶狠的笑著.. MUHAHAHA..",
        "$n 對著你凶狠的笑著.. MUHAHAHA..",
        "對自己笑個什麼勁啊?..",
        "$n 對著他自己凶狠的笑著.. MUHAHAHA..",
    ],

    [
        "nerves",
        "緊張",
        "你顯的很緊張, 戰戰兢兢的注意著四周!",
        "$n 顯的很緊張, 戰戰兢兢的注意著四周!",
        "你神情緊張的看著 $N 你做錯了什麼嗎?",
        "$n 神情緊張的看著 $N 好像做錯了事一樣..",
        "$n 神情緊張的看著你, 好像有什麼事不敢對你說..",
        "你一個人緊張兮兮的, 不知道在緊張什麼..",
        "$n 緊張兮兮的樣子.. 看了真是好笑.."
    ],

    [
        "nibble",
        "悄悄話",
        "你要跟誰講悄悄話?",
        null,
        "你在 $N 的耳朵旁滴滴咕咕,講一些悄悄話.",
        "$n 在 $N 的耳朵旁滴滴咕咕,講一些悄悄話.",
        "$n 在你的耳朵旁滴滴咕咕,講一些悄悄話.",
        "你一個人滴滴咕咕不知道在說什麼.",
        "$n 在$s耳朵旁滴滴咕咕,講一些悄悄話."
    ],

    [
        "nod",
        "點頭",
        "你點點你的頭.",
        "$n 點點$s頭.",
        "你對$M點點你的頭.",
        "$n 對著 $N 點點$s頭.",
        "$n 對著你點點$s頭. 你知道$e是對的!",
        "你點點你的頭. 你覺得很同意!",
        "$n 點點$s頭. $m覺得很同意!"
    ],

    [
        "nothx",
        "不謝",
        "你豪爽的說了聲不必客氣.",
        "$n 豪爽的說了聲隴細嘎機狼, 免兜蝦啦.",
        "你對$M豪爽的說了聲隴細嘎機狼, 免兜蝦啦.",
        "$n 對著 $N 豪爽的說了聲隴細嘎機狼, 免兜蝦啦.",
        "$n 對著你豪爽的說了聲隴細嘎機狼, 免兜蝦啦.",
        "你擺擺手說小事一樁",
        "$n 說小事一樁, 何足掛齒."
    ],

    [
        "nudge",
        "輕碰",
        "想對誰打暗號啊?",
        null,
        "你用手肘輕碰$M.",
        "$n 用手肘輕碰 $N, 好像他們之間有祕密喔.",
        "$n 用手肘輕輕碰碰你.",
        null,
        null
    ],

    [
        "nuzzle",
        "鼻子碰",
        "你想用鼻子???碰誰?",
        null,
        "你像隻豬一樣用鼻子碰碰$S脖子.",
        "$n 像隻豬一樣用鼻子碰碰 $N 脖子.",
        "$n 像隻豬一樣用鼻子碰碰你的脖子.",
        null,
        null
    ],

    [
        "orz",
        "挫敗",
        "你充滿挫折感的跪倒在地上... ○rz",
        "$n 充滿挫折感的倒在地上... ○rz",
        "$N 的愚蠢讓你充滿挫感的跪倒在地上...○rz",
        "$N 的愚蠢讓 $n 充滿挫感的跪倒在地上...○rz",
        "你的愚蠢讓 $n 充滿挫感的跪倒在地上...○rz",
        "你充滿挫折感的跪倒在地上... ○rz",
        "$n 因為自己的愚蠢而充滿挫折感的跪倒在地上... ○rz"
    ],

    [
        "pat",
        "拍肩膀",
        "拍誰呢?",
        null,
        "你拍拍 $N 的肩膀.",
        "$n 拍拍 $N 的肩膀.",
        "$n 拍拍你的肩膀.",
        "你摸摸你的頭.",
        "$n 摸摸 $m 自己的頭."
    ],

    [
        "please",
        "請求",
        "你用手絞著衣角, 睜大水汪汪的眼睛說：好啦！好啦！",
        "$n 用手絞著衣角, 睜大水汪汪的眼睛說：好啦！好啦！",
        "你用手絞著衣角, 用水汪汪的大眼對 $N 說：好嘛！幫幫人家？",
        "$n 用手絞著衣角, 用水汪汪的大眼對 $N 說：好嘛！幫幫人家？",
        "$n 用手絞著衣角, 用水汪汪的大眼對你說：好嘛！幫幫人家？",
        "你用手絞著衣角, 睜大水汪汪的眼睛說：好啦！好啦！",
        "$n 用手絞著衣角, 睜大水汪汪的眼睛說：好啦！好啦！"
    ],

    [
        "point",
        "指人",
        "你要指誰?",
        null,
        "你生氣的用手指著$M鼻子.",
        "$n 生氣的用手指著 $N 鼻子.",
        "$n 生氣的用手指著你的鼻子.",
        "你指著自己,說:「就是我啦!」.",
        "$n 指著$m自己,說:「就是我啦!」."
    ],

    [
        "poke",
        "戳人",
        "想戳誰啊?",
        null,
        "你用手戳戳$M.",
        "$n 用手戳戳 $N.",
        "$n 用手戳你.",
        "你玩弄著自己的手指,看來很愚蠢的樣子.",
        "$n 玩弄著自己的手指,一付很害羞的樣子."
    ],

    [
        "ponder",
        "沉思",
        "你閉起眼睛,沉思了一會兒.",
        "$n 閉起眼睛,沉思了一會兒.",
        null,
        null,
        null,
        null,
        null
    ],

    [
        "pout",
        "翹嘴",
        "翹起嘴來,鬧彆扭.",
        "$n 翹起嘴來.",
        null,
        null,
        null,
        null,
        null
    ],

    [
        "pray",
        "祈求",
        "你祈求著上天的憐憫.",
        "$n 祈求著上天的憐憫.",
        "你向$M低頭乞求著.",
        "$n 在跟 $N 低頭乞求著.",
        "$n 低頭跟你乞求著.",
        null,
        null
    ],

    [
        "puke",
        "嘔吐",
        "你吐的到處都是.",
        "$n 開始嘔吐.",
        "你對著$M嘔吐.",
        "$n 對著 $N 嘔吐.",
        "$n 對著你嘔吐,哇～全身都髒了.",
        "你吐的自己滿身都是.",
        "$n 吐的自己的衣服都是噁心的東西."
    ],

    [
        "pull",
        "拉衣角",
        "你想拉誰的衣角啊?",
        null,
        "你害羞的拉著$S衣角..",
        "$n 害羞的拉著 $N 的衣角..",
        "$n 害羞的拉著你的衣角..",
        "你整理整理自己的衣服, 嗯! 看起來整齊多了.",
        "$n 整理整理自己的衣服, 嗯! 看起來整齊多了.",
    ],

    [
        "push",
        "推人",
        "你想推誰啊?",
        null,
        "你用力的推開了$M..",
        "$n 用力的推了 $N 一下..",
        "$n 用力的推開了你..",
        "我推我推我推推推...ㄟ..推空氣嗎?.",
        "$n 伸出手在空中揮舞著..不知道是不是在打蚊子.",
    ],

    [
        "punch",
        "打人",
        "想打誰啊?",
        null,
        "你開玩笑的用拳頭打著$M.",
        "$n 開玩笑的用拳頭打著 $N.",
        "$n 開玩笑的用拳頭打著你. OUCH!",
        "你用力地搥打著自己.",
        "$n 用力地搥打著自己."
    ],

    [
        "purr",
        "喵喵叫",
        "喵嗚～喵嗚～.",
        "$n 像貓一樣地喵喵叫.",
        "你對著$M喵喵的叫.",
        "$n 對著 $N 喵喵的叫.",
        "$n 對著你喵喵的叫.",
        "你學貓一樣的喵喵叫.",
        "$n 學貓一樣的喵喵叫."
    ],

    [
        "raisehand",
        "舉手",
        "你高舉著手,大聲答「有!」.",          /*無target時，自己看到的訊息*/
        "$n 高舉著手,大聲答「有!」.",         /*無target時，旁人看到的訊息*/
        "你高舉著手,對 $N 大聲答「有!」.",      /*有target時，自己看到的訊息*/
        "$n 高舉著手,對 $N 大聲答「有!」.",     /*有target時，旁人看到的訊息*/
        "$n 高舉著手,對你大聲答「有!」.",     /*有target時，target看到的訊息*/
        "你雙手高舉學著猩猩的動作.",          /*target為自己時，自己看到的訊息*/
        "$n 像猩猩一樣的高舉雙手亂叫著."      /*target為自己時，旁人看到的訊息*/
    ],
/* $S 他的、她的、它的 ，target 用
   $M 他、她、它，本身用
   $N target的cname
   $n 自己的cname */
    [
        "relax",
        "放鬆",
        "你活動了筋骨, 試著讓自己放鬆下來..",
        "$n 活動著他的筋骨, 似乎在試著放鬆心情..",
        "你輕輕拍著 $N 的肩膀, 想試著讓他放鬆下來..",
        "$n 輕輕拍著 $N 的肩膀, 想試著讓他放鬆下來..",
        "$n 輕輕拍著你的肩膀, 讓你感覺輕鬆了起來..",
        null,
        null
    ],

    [
        "roll",
        "翻滾",
        "你在地上滾來滾去作什麼~ 髒死了~>_<~",
        "$n 笑翻在地上滾來滾去.",
        "你不停地在 $N 的身旁繞來繞去的.",
        "$n 不停地在 $N 的身旁繞來繞去的，好像對 $N 不懷好意的樣子.",
        "$n 不停地在你的身旁繞來繞去的，好像對你不懷好意的樣子.",
        "你在床上滾來滾去~ 不小心就睡著了~ z Z Z",
        "$n 在床上滾來滾去~ 不小心就睡著了~ z Z Z"
    ],

    [
        "ruffle",
        "心煩",
        "你是不是激怒了誰啊?",
        null,
        "你開玩笑的弄皺 $N 的頭髮.",
        "$n 開玩笑的弄皺 $N 的頭髮.",
        "$n 開玩笑的弄皺你的頭髮.",
        "你刻意的把自己頭髮弄亂以表示自己心亂如麻.",
        "$n 刻意的把自己頭髮弄亂以表示自己心亂如麻."
    ],

    [
        "sad",
        "傷心",
        "你傷心的哭了.. 淚水流滿了整個臉頰.",
        "$n 難過的哭了起來.. 眼淚流滿了整個臉頰.",
        "你傷心的靠在$M的肩膀上, 眼淚不停的流下..",
        "$n 靠在 $N 的肩膀上傷心的哭泣.. 眼淚弄濕了 $N 的衣衫..",
        "$n 靠在你的肩膀上, 傷心的哭了起來..",
        null,
        null
    ],

    [
        "scream",
        "尖叫",
        "啊！ARRRRRRRRRRGH！！",
        "$n 大聲的尖叫著！",
        "ARRRRRRRRRRGH!!!!! 一定是$S錯！！",
        "$n 對 $N 大聲尖叫著.  最好在 $n 責備你前離開！！",
        "$n 對你尖叫著！喔！不太妙喔！",
        null,
        null
    ],

    [
        "shake",
        "搖頭",
        "你搖搖你的頭.",
        "$n 搖搖$m自己的頭.",
        "你搖搖$S頭.",
        "$n 搖搖 $N 的頭.",
        "$n 搖搖你的頭.",
        "你搖搖你自己的頭.",
        "$n 搖搖頭."
    ],

    [
        "shiver",
        "抖動",
        "Brrrrrrrrr.",
        "$n 很不舒服的抖動著.",
        "你因為懼怕某事而顫抖著.",
        "$n 因為懼怕某事而顫抖著.",
        "$n 因為懼怕某事而顫抖著.",
        null,
        null
    ],

    [
        "shrug",
        "聳肩",
        "你聳聳肩膀.",
        "$n 無奈的聳聳肩膀.",
        "對於$s問題,你聳聳肩膀以示回答.",
        "$n 對 $N 的問題聳聳肩膀以示回答.",
        "對於你的問題, $n 只能聳聳肩膀來回答你.",
        "你對自己聳聳肩膀.",
        "$n 對自己聳聳肩膀. 嗯, 好奇怪的人喔."
    ],

    [
        "shy",
        "害羞",
        "你害羞的低下頭來.",
        "$n 害羞的低下頭來.",
        "你害羞的偷瞄著$M.",
        "$n 一臉害羞的偷瞄著 $N.",
        "$n 似乎一直在偷瞄著你.",
        "你為自己過於害羞的心態而不知所措.",
        "$n 顯的一副坐立不安的樣子. 嗯, $m是不是不舒服啊?"
    ],

    [
        "sigh",
        "嘆氣",
        "你嘆氣,表示無奈.",
        "$n 嘆息著說,唉啊!",
        "你對著$M嘆息,唉啊!",
        "$n 對著 $N 嘆息,唉啊!",
        "$n 對著你嘆息,唉啊!",
        "你自怨自艾的嘆息著.",
        "$n 自怨自艾的嘆息著."
    ],

    [
        "sing",
        "唱歌",
        "你仰著脖子清了清喉嚨, 準備高歌一曲.",
        "$n 開始唱歌. 啦～～～.",
        "你對著$M唱首情歌.",
        "$n 對著 $N 唱情歌.",
        "$n 對著你唱情歌. 感覺好甜蜜喔!",
        "你低聲唱首小調. 感覺好淒涼喔.",
        "$n 低聲唱首小調, 一付很淒涼的樣子."
    ],

    [
        "slap",
        "耳光",
        "你想要打誰的耳光啊?",
        null,
        "你伸出手大力的給了 $N 一個耳光!",
        "$n 伸出手往 $N 的臉上打去!",
        "$n 伸出手往你的臉上打來!",
        "你伸出手猛往自己臉上打, 像在賠不是似的.",
        "$n 伸出手往自己臉上打去, 像在賠不是似的."
    ],

    [
        "smile",
        "微笑",
        "你愉快的微笑.",
        "$n 愉快的微笑.",
        "你對著$M愉快的笑.",
        "$n 喜氣洋洋對著 $N 笑.",
        "$n 愉快的對著你笑.",
        "你對自己愉快的笑.",
        "$n 對自己愉快的笑."
    ],

    [
        "smirk",
        "傻笑",
        "你傻傻的笑著.",
        "$n 傻傻的笑著.",
        "你傻傻的對$S笑著.",
        "$n 傻傻的對 $N 笑著.",
        "$n 傻傻的對你笑著.",
        "你得意的對自己笑著.",
        "$n 得意的對自己笑著."
    ],

    [
        "snap",
        "彈指",
        "啪!你手指發出清脆聲音, 想引起別人注意",
        "$n 用手指發出清脆的聲音, 似乎想引起別人注意",
        "你用手指對著$M發出清脆的聲音, 要你專心的一點",
        "$n 用手指對著 $N 發出親脆的聲音.",
        "$n 用手指對你發出清脆的聲音. 嗯, $e大概是覺得你不專心吧.",
        "哈! 懂了!",
        "$n 突然想通啥事而彈彈自己手指頭."
    ],

    [
        "snarl",
        "吼罵",
        "你大聲的吼罵著以發洩心中的不滿.",
        "$n 十分憤怒地吼罵著.",
        "你大聲地罵著$M.",
        "$n 大聲地罵著 $N.",
        "$n 大聲地罵著你, 你哪裡得罪他了?",
        "你大聲地罵著自己.",
        "$n 大聲地罵著自己, $s有沒有問題啊?"
    ],

    [
        "sneeze",
        "打噴嚏",
        "! 哈 啾 !",
        "$n 打了個大噴嚏.",
        null,
        null,
        null,
        null,
        null
    ],

    [
        "snicker",
        "竊笑",
        "你在爽啥啊？一直在偷笑？",
        "$n 莫名其妙在角落偷笑著。",
        "你賊賊的對 $N 偷笑著。",
        "$n 賊賊的對 $N 偷笑著。",
        "你是不是拉鍊忘記拉所以 $n 一直在一旁偷笑著。",
        null,
        null
    ],

    [
        "snore",
        "打呼",
        "Zzzzzzzzzzzzzzzzz.",
        "$n 大聲的打呼著.",
        null,
        null,
        null,
        null,
        null
    ],

    [
        "snowball",
        "雪球",
        "你要把雪花球丟向誰?",
        null,
        "你拿出雪花球丟向 $N 的臉.",
        "$n 拿出雪花球丟向 $N 的臉.",
        "$n 拿出雪花球丟向你的臉.",
        "你拿雪花球丟自己的臉.",
        "$n 拿雪花球往自己的臉上砸."
    ],

    [
        "snuggle",
        "依偎",
        "想找地方停靠嗎?",
        "$n 似乎想找個東西靠.",
        "你緊緊地依偎$M的懷裡.",
        "$n 緊緊地依偎 $N 的懷裡.",
        "$n 緊緊地依偎你的懷裡.",
        "你準備好要去睡大頭覺了.",
        "$n 準備好要睡覺了."
    ],

    [
        "soka",
        "恍然大悟",
        "喔，原來如此。",
        "$n 敲彈著手指說「原來如此啊！」",
        "原來 $N 要表達的是這個啊？",
        "$n 忽然間聽懂了 $N 說的火星話。",
        "$n 終於聽懂了你說的話，真是秀才遇到兵啊。",
        "喔，原來如此。",
        "$n 敲彈著手指說「原來如此啊！」"
    ],

    [
        "sorry",
        "對不起",
        "要跟誰?對不起?",
        "$n 代表自己跟大家說聲對不起.",
        "你低著頭輕輕低跟$M說對不起.",
        "$n 低著頭輕輕低跟 $N 說對不起.",
        "$n 低著頭輕輕低跟你說對不起.",
        "你激動的表示都是你不好.",
        "$n 叫著對不起, 都是我的錯."
    ],

    [
        "spank",
        "打屁股",
        "想打誰的屁屁啊?",
        null,
        "你開玩笑地打打$M的屁股.",
        "$n 開玩笑地打打 $N 的屁股.",
        "$n 開玩笑地打打你的屁股..  OUCH!",
        "你拍拍你自己的屁股.  Kinky!",
        "$n 拍拍自己的屁股. Kinky!"
    ],

    [
        "squeeze",
        "緊抱",
        "你要抱啥啊?",
        null,
        "你深情的緊抱著$M.",
        "$n 深情的緊抱著 $N.",
        "$n 深情地緊緊抱住你.",
        "你緊緊的抱住自己, 讓自己好過一點!",
        "$n 緊緊的抱住自己."
    ],

    [
        "stamp",
        "跺腳",
        "你氣的直跺腳!",
        "$n 生氣的跺著腳! 似乎不太高興.",
        "你生氣的跺著 $N 的腳!",
        "$n 生氣的跺著 $N 的腳!",
        "$n 生氣的跺著你的腳! 哎呀～ 好痛!",
        "你跺著自己的腳, 是有事忘了嗎?",
        "$n 似乎有急事似的, 跺著自己的腳."
    ],

    [
        "stare",
        "凝視",
        "你凝視著天空發呆.",
        "$n 對著天空凝視發呆.",
        "你深情的凝視著 $N , 似乎這世界只剩下你們兩個.",
        "$n 深情無限的看著 $N.",
        "$n 情深許許的看著你, 似乎這世上除了你他誰也看不見了.",
        "你是不是自戀狂啊?",
        "$n 似乎有點過度自戀喔!"
    ],

    [
        "strut",
        "搖擺 ",
        "你大搖大擺的走著.",
        "$n 昂首闊步大搖大擺的走著!",
        "你大搖大擺的走著為了得到$S的注意.",
        "$n 大搖大擺的走著希望能得到 $N 注意.",
        "$n 大搖大擺的走著希望能得到你的注意.",
        "你陶醉在自己的世界裡, 好像全世界就你最威風.",
        "$n 陶醉在自己的世界裡, 好像全世界就他最威風."
    ],

    [
        "sulk",
        "生悶氣",
        "你不高興.",
        "$n 躲在角落,獨自生悶氣.",
        null,
        null,
        null,
        null,
        null
    ],

    [
        "tear",
        "流眼淚  ",
        "你眼中含著淚.",
        "$n 眼中含著淚!",
        "你對著$S滴下了兩滴英雄淚.",
        "$n 對著 $N 滴下了兩滴英雄淚.",
        "$n 對著你滴下了兩滴英雄淚.",
        "你滴下了兩滴英雄淚 , 男兒有淚不輕彈只因為到傷心時.",
        "$n 滴下了兩滴英雄淚 , 似乎做了某種決定."
    ],

    [
        "thank",
        "感謝",
        "你真誠的感謝.",
        "$n 滿懷一顆感謝的心.",
        "你真誠的向 $N 感謝.",
        "$n 真誠的向 $N 感謝.",
        "$n 真誠的向你感謝.",
        null,
        null
    ],

    [
        "tickle",
        "呵癢",
        "你想呵誰的癢啊?",
        null,
        "你正努力逗 $N 開心.",
        "$n 嘗試著逗 $N 開心.",
        "$n 正在逗你和呵你癢 - 哈哈哈! 好癢喔!",
        "你因為覺得無聊而自己在找東西玩.",
        "$n 無聊到自己在替自己呵癢."
    ],

    [
        "wave",
        "告別",
        "你揮揮手告別.",
        "$n 愉快著揮著手告別.",
        "你揮著手跟 $N 告別.",
        "$n 揮著手跟 $N 告別.",
        "$n 揮著手跟你告別.希望你玩的愉快.",
        "你對周遭揮揮手說再見.",
        "$n 跟所有人揮手說再見."
    ],

    [
        "twiddle",
        "玩手指",
        "你低頭玩弄著自己的手指頭.",
        "$n 低頭玩弄著$s手指頭.",
        "你頑皮的玩著$S頭髮.",
        "$n 頑皮的玩著 $N 的頭髮.",
        "$n 頑皮的玩著你的頭髮.",
        "你像白癡一樣的玩著自己的耳朵.",
        "$n 像白癡一樣玩著$s耳朵."
    ],

    [
        "whistle",
        "口哨",
        "你吹了吹口哨.",
        "$n 快樂的吹了吹口哨.",
        "你對$M所做的事讚許地吹了吹口哨.",
        "$n 對 $N 所做的事讚許地吹了吹口哨.",
        "$n 對你讚許的吹了吹口哨! 做的不錯喔.",
        "你很得意的吹著口哨.",
        "$n 很得意的吹著口哨."
    ],

    [
        "wiggle",
        "扭屁股",
        "你搖搖你的屁股.",
        "$n 用力扭一扭他的屁股.",
        "你抬起你的屁屁, 對$M用力的搖一搖.",
        "$n 對 $N 用力搖一搖他的大屁股.",
        "$n 抬起他的大屁股對你用力的搖一搖.",
        "你像隻鴨子一樣用力扭著他的大屁股.",
        "$n 像隻鴨子一樣用力扭著他的大屁股."
    ],

    [
        "wince",
        "退縮",
        "退縮? 不好喔! 鼓起勇氣吧!",
        "$n 因為受了阻礙, 退縮了.",
         null,
         null,
         null,
         null,
         null
    ],

    [
        "wink",
        "眨眼",
        "你眨了眨眼.",
        "$n 眨了眨眼.",
        "你對 $N 眨眨眼使個眼色.",
        "$n 對 $N 眨眨眼使了個眼色.",
        "$n 對你眨眼使眼色, 好像在跟你暗示啥!",
        null,
        null
    ],

    [
        "yawn",
        "打哈欠",
        "你覺得好累.",
        "$n 打著哈欠.",
        "你對著 $N 打哈欠,似乎對 $N 不以為意.",
        "$n 對著 $N 打哈欠,似乎對 $N 不以為意.",
        "$n 對著你打哈欠,一付不以為意的樣子.",
        null,
        null
    ],

    [
        "zzz",
        "想睡",
        "你覺得有點想睡了..",
        "$n 好像快睡著了..",
        "你覺得昏昏沈沈的.. 眼睛模糊的只看到 $N 在念念有詞..",
        "$n 似乎快睡著了.. 對著 $N 猛點頭..打瞌睡..",
        "$n 對著你猛點頭, 看起來好像快睡著了..",
        "你像隻貓一樣的捲成一團準備睡覺了。",
        "$n 像貓咪一樣捲成一團準備睡覺了。"
    ],

    [
        "happynewyear",
        "新年快樂",
        "恭喜發財！",
        "$n 對大家說著：恭喜發財、新春如意、好運連連。",
        "你非常開心的對 $N 說著：恭喜發財、新春如意、好運連連。",
        "$n 十分開心的對 $N 說著：恭喜發財、新春如意、好運連連。",
        "$n 對你說著：恭喜發財、新春如意、好運連連。",
        "你祝福著自己未來的一年萬事如意、事事順心。",
        "$n 祝福著自己未來的一年萬事如意、事事順心。"
    ],

    [
        "", "",
        null, null, null, null, null, null, null
    ]
  ];

  var user;
  var _uTrim;

  var init = function() {
    // 有 .nick_name, .karma, .location, .full_name, .display_name, .gender... 可以用
    user = unsafeWindow.user; 
    _uTrim = unsafeWindow._uTrim;
  
    addEvent();
  };

  var timer;
  function addEvent() {
    if (timer) {
      window.clearTimeout(timer);
    }
    var t1 = document.getElementById('input_big');
    var t2 = document.getElementById('input_small');
    var t3 = document.getElementById('input_big_cu');
    if (t1 == null || t2 == null || t3 == null) {
      timer = window.setTimeout(addEvent, 500);      
      return;
    }
    
    t1.addEventListener('keydown', input_function, false);
    t2.addEventListener('keydown', input_function, false);
        
    // 畫面上的提醒
    GM_addStyle("#input_big_cu {display: inline; }");
    var span = document.createElement('span');
    span.innerHTML = ' (Arion Social Enabled)';
    span.style.fontSize = '11px';
    t3.parentNode.appendChild(span);
  }
 
  var input_function = function(e) {
    if (!(e.keyCode == 45 || e.keyCode == 9)) { // keyCode: 45 = Insert, 9 = Tab
      return;
    }
    var foo = this.value.match(/^chat\*\s+([^\s]+)(\s+([^\s]+))?\s*$/);
    if (!foo) {
      return;
    }
    e.preventDefault();
    e.stopPropagation(); 
    var s = _uTrim(foo[1]);
    var t = (foo[3]) ? _uTrim(foo[3]) : foo[3];
    if (s.length < 2) {
      return;
    }
    var idx;
    for (var i = 0; i < socials.length; i++) {
      if (socials[i][0].indexOf(s) == 0) {
        idx = i;
        break;
      }
    }
    if (!idx) {
      return;
    }
    var s = socials[idx];
    var txt;
    if (!!t && (t == user.nick_name || t == '@' + user.nick_name)) { // target = me
      txt = s[8];
    } else if (!!t) { // target = others
      txt = s[5];
    } else { // target = null
      txt = s[3];
    }
    if (!txt) {
      this.value = '';
      return;
    }
    txt = txt.replace(/^\$n/, ''); // start with $n 
    txt = txt.replace(/\$[ne]/g, '@' + user.nick_name); // other $n, $e <--這個不確定
    txt = txt.replace(/\$[NE]/g, t); // $N, $E <--這個不確定
    var sex = (user.gender == 0) ? '她' : ((user.gender == 1) ? '他' : '它');
    txt = txt.replace(/\$m/g, sex); // $m
    txt = txt.replace(/\$M/g, '他'); // $M, 無法判斷 一律使用 '他'
    txt = txt.replace(/\$s/g, sex + '的'); // $s
    txt = txt.replace(/\$S/g, '他的'); // $S, 無法判斷 一律使用 '他的'

    this.value = _uTrim(txt);
  };

  window.addEventListener('load', init, false); 
})();

// v 0.3 
// 為了不同鍵盤使用者方便, 現在除了 Insert 之外, Tab 也有同樣效果.
// 加上提醒字眼, 知道可以使用此 userjs.
// FIX: plurk 上面的 element 也是透過 js 動態產生, 有 load 順序問題.

// TODO: prefix 改成空白.
// TODO: 找出 friends list.
// TODO: 實作 autocomplete.
// TODO: 有些 social 是 null value, 做點提醒. 
//
// $e / $E : ??
// $e 是執行 social command 者的第三人稱，當 target 為自己時，自己看到的
// $E 是執行 social command target 的第三人稱，當 target 為自己時，其他人看到的
