// --------------------------------------------------------------------------------
// Copyright (C) 2009  Cui Mingda [ https://twitter.com/cuimingda ]
// Dual licensed under the MIT (http://www.opensource.org/licenses/mit-license.php) 
// and GPL (http://www.gnu.org/licenses/) licenses.
//
// ==UserScript==
// @name            Koubei Nickname Converter
// @namespace       http://userscripts.org/scripts/show/50812
// @description     Convert realname to nickname on SPS
// @include         http://sps/commerce/*
// @include         http://sps.yahoo.ali.com/commerce/*
// @require         http://ajax.googleapis.com/ajax/libs/jquery/1.3/jquery.min.js
// ==/UserScript==
//
// This is a Greasemonkey 0.8 script, you need to install Firefox (http://www.mozilla.com/firefox/)
// and Greasemonkey (https://addons.mozilla.org/firefox/addon/748) first.
// --------------------------------------------------------------------------------

;(function() {
  var users = {
    184 : "当归",
    190 : "剑南春",
    343 : "烧酒",
    494 : "红糖",
    522 : "柑橘",
    540 : "三七",
    761 : "小芹菜",
    868 : "决明子",
    916 : "玉兰",
    920 : "蛋壳",
    957 : "甜菜",
    1033 : "金银花",
    1070 : "粽子",
    1209 : "芥兰",
    1263 : "木兰",
    1279 : "白果",
    1468 : "东坡肉",
    1469 : "红烧肉",
    1470 : "番茄",
    1492 : "柿子",
    1497 : "薯条",
    1498 : "花蛤",
    1499 : "鲨鱼",
    1500 : "金枪鱼",
    1502 : "朱古力",
    1504 : "洋葱",
    1505 : "凉茶",
    1507 : "碧螺春",
    1509 : "木瓜",
    1510 : "蓝莓",
    1513 : "南瓜子",
    1514 : "茴香豆",
    1517 : "毛蟹",
    1521 : "黑豆",
    1522 : "油菜",
    1529 : "牛柳",
    1535 : "提子",
    1536 : "大眼睛",
    1537 : "包子",
    1538 : "饺子",
    1540 : "萝卜",
    1541 : "节节根",
    1543 : "甜瓜",
    1544 : "小烤饼",
    1546 : "雪饼",
    1548 : "丸子",
    1553 : "木耳",
    1555 : "叶子",
    1557 : "泡泡糖",
    1558 : "果冻",
    1567 : "毛峰",
    1577 : "铁观音",
    1578 : "菠萝",
    1579 : "荔枝",
    1583 : "榆钱",
    1584 : "鱼翅",
    1585 : "小冬瓜",
    1587 : "龙井茶",
    1588 : "蜗牛",
    1589 : "窝头",
    1590 : "冰糖",
    1596 : "月饼",
    1601 : "西芹",
    1604 : "豆汁",
    1605 : "腰花",
    1607 : "小核桃",
    1609 : "可可",
    1610 : "西瓜",
    1611 : "粉丝",
    1613 : "乌龙茶",
    1614 : "菜根",
    1615 : "布林",
    1616 : "灵芝",
    1617 : "木头",
    1618 : "蜜蜂",
    1621 : "竹笋",
    1622 : "蚂蚁",
    1623 : "大米",
    1626 : "白粥",
    1629 : "柚子",
    1635 : "杨梅",
    1637 : "山竹",
    1641 : "龙眼",
    1642 : "大头菜",
    1643 : "金针菇",
    1644 : "锅巴",
    1645 : "七喜",
    1646 : "四季豆",
    1647 : "常青藤",
    1649 : "佛手",
    1650 : "沙枣",
    1651 : "香槟",
    1652 : "鱼片",
    1653 : "豆皮",
    1654 : "麻辣烫",
    1655 : "青菜",
    1657 : "火烧",
    1658 : "乳猪",
    1666 : "红豆",
    1667 : "沙拉",
    1668 : "莴笋",
    1669 : "三文鱼",
    1670 : "上口爱",
    1674 : "饼干",
    1675 : "雪菜",
    1676 : "朱砂",
    1678 : "苦丁",
    1679 : "芝华士",
    1680 : "凤梨",
    1681 : "枇杷",
    1682 : "可颂",
    1684 : "酸奶",
    1686 : "无花果",
    1689 : "银耳",
    1691 : "菠菜",
    1692 : "柳丁",
    1693 : "奇异果",
    1695 : "玉米",
    1696 : "绿茶",
    1697 : "刨冰",
    1698 : "雪碧",
    1699 : "抹茶",
    1700 : "奶昔",
    1704 : "胖头鱼",
    1707 : "藕粉",
    1708 : "泡菜",
    1709 : "山芋",
    1716 : "米兰",
    1730 : "面包",
    1734 : "月桂",
    1742 : "圆子",
    1743 : "咖啡",
    1753 : "拉菲",
    1754 : "葱油饼",
    1757 : "片儿川",
    1791 : "绿豆",
    1794 : "大蒜",
    1796 : "黑啤",
    1798 : "桔子",
    1799 : "维C",
    1805 : "素面",
    1808 : "石榴",
    1809 : "豆丹",
    1811 : "燕窝",
    1812 : "花旗参",
    1814 : "蛋塔",
    1815 : "黑方",
    1819 : "奶茶",
    1821 : "焦圈",
    1822 : "大馄饨",
    1824 : "水煮鱼",
    1826 : "布丁",
    1827 : "苜蓿",
    1831 : "茯苓",
    1833 : "米线",
    1835 : "牛奶",
    1837 : "木棉",
    1838 : "香草",
    1839 : "生姜",
    1842 : "凉虾"
  };

  $("a[href^=/commerce/_layouts/userdisp.aspx?ID=]").each(function() {
    var reUrl = /\/commerce\/_layouts\/userdisp\.aspx\?ID=(\d+)/;
    var userId = reUrl.test($(this).attr("href")) ? parseInt(RegExp.$1) : 0;
    var userName = users[userId];
    
    if(userName !== undefined) {
      $(this).text(users[userId]);
    }
  });
  
})();

/* Update History
 * 0.1 @ 2009/06/04 # Initial Release
 * 0.2 @ 2009/06/04 # update to 160 persons
 */