// ==UserScript==
// @name        繁简转换
// @namespace   http://userscripts.org/scripts/show/0
// @description 网页上的繁体中文字转为简体。Traditional Chinese chars to Simplified Chinese.
// @include     *
// @updateURL   https://userscripts.org/scripts/source/0.meta.js
// @downloadURL https://userscripts.org/scripts/source/0.user.js
// @version     1.0
// @author      tomchen1989 <tomchen1989[AT]yahoo.com.cn>
// @license     MIT/Expat License
// ==/UserScript==

(function() {

var docLang = document.documentElement.lang.toLowerCase(),
	docCharset = ( document.characterSet || document.charset ).toLowerCase();

if (docLang === "zh-cn" || docLang === "zh-hans" || docLang === "zh-sg" || docLang === "zh-my"
	|| docCharset.substring(0, 2) === "gb") {//avoid converting pages that are already in Simplified Chinese for sure
	return;
}

//the lists are based on kSimplifiedVariant by Hongkong user "京典"

//Traditional Chinese chars
var chtList  = "「」『』丟亂亞佇來侖侶俁俔俠倀倆倉個們倫偉側偵偽傖傘備傯傳傴債傷傾僂僅僉僑僥僨儀儂億儈儉儐儔儕償儲儷儸儺儻儼兌兗內兩冊冪凈凍凜凱別刪剄則剎剛剝剮剴創劇劉劊劌劍劑勁動務勛勞勢勩勱勵勸勻匭匱區協卻厙厭厲厴參叢吒吳吶呂咼員唄唚問啞啟啢喎喚喪喬單喲嗆嗇嗊嗎嗚嗩嗶嘆嘍嘔嘖嘗嘜嘩嘮嘯嘰嘵嘸嘽噓噚噠噥噦噯噲噴嚀嚇嚌嚕嚙嚦嚨嚲嚳嚴嚶囀囁囂囅囈囑囪圇國圍園圓圖團垵埡執堅堊堝堯報場塊塋塏塒塢塤塵塹墊墜墮墳墾壓壘壙壚壟壢壩壯壺壼壽夠夢夾奐奧奩奪奮奼妝姍娛婁婦婭媧媯媼媽嫗嫵嫻嫿嬈嬋嬌嬙嬡嬤嬪嬰嬸孌孫學孿宮寢實審寫寬寵寶將專尋對導尷屆屜屢層屨屬岡峴島峽崍崗崢嵐嶁嶄嶇嶔嶗嶠嶢嶧嶮嶴嶸嶼巋巒巔巰帥師帳帶幀幃幗幘幟幣幫幬庫廁廂廄廈廚廝廟廡廢廣廩廬廳弒弳張強彈彌彎彥徑從徠徹恆恥悅悵悶惡惱惲惻愛愜愨愴愷愾態慍慘慚慟慣慪慫慮慳慶憂憊憑憒憚憤憫憮憲憶懇應懌懍懟懣懨懲懶懸懼懾戀戇戔戧戩戰戲戶拋挩挾捫掃掄掗掙揀揚換揮損搖搗搵搶摑摜摟摯摳摶摻撈撏撐撓撝撟撣撥撫撳撻撾撿擁擄擇擊擋擔擠擬擯擰擱擲擴擷擺擻擼攄攆攏攔攖攙攛攜攝攢攣攤攪攬敗敘敵數斂斃斕斬斷時晉晝暈暉暘暢暫曄曇曉曖曠曨書會朧東杴柵梔條梟梲棄棖棗棟棧棶椏楊楓楨業榪榮榿槍槧槨槳樁樂樅樓標樞樣樹樺橈橋橢橫檁檉檔檜檟檢檣檮檳檸檻櫓櫚櫛櫝櫞櫟櫥櫧櫨櫪櫫櫬櫱櫳櫸櫻欄權欏欒欖欞欽歐歟歡歲歸歿殘殞殤殫殮殯殰殲殺殼毀毆毿氂氈氌氫氬氳決沒況洶浹涇涼淚淥淪淵淶淺渙減渦測渾湊湞湯溈溝溫滄滅滌滎滬滯滲滸滻滾滿漁漚漢漣漬漲漵漸漿潁潑潛潤潯潰潷潿澀澆澇澗澠澤澦澩澮濁濃濕濟濤濫濰濱濺濼濾瀅瀆瀇瀉瀏瀕瀘瀝瀟瀠瀦瀧瀨瀲瀾灃灄灘灝灠灣灤災為烏烴無煉煒煙煢煥煩煬熅熒熗熱熲熾燁燈燒燙燜營燦燭燴燼燾爍爐爛爭爺爾牆牘牽犖犢犧狀狹狽猙猶猻獄獅獎獨獪獫獮獰獵獷獸獺獻獼玀現琺琿瑋瑒瑣瑤瑩瑪瑲璉璣璦璫環璽瓊瓏瓔瓚甌產畝畢疇疊痙痾瘋瘍瘓瘞瘡瘧瘲瘺療癆癇癉癘癟癤癩癬癭癮癰癱癲皚皰皸皺盜盞監盤盧眥眾睜睞瞜瞞瞶瞼矓矚矯硜硤硨硯碩碭碼磑磚磣磧磯磽礎礙礦礪礫礬礱祿禍禎禕禡禪禮禰禱禿秈稅稈稟稱穌積穎穠穡穢穩穭窩窮窯窵窶窺竄竅竇竊競筆筍筧筴箋箏節篋篔篤篩篳簀簍簞簡簣簫簹簽籃籌籙籜籟籠籩籪籮粵糝糞糧糲糴糶糾紀紂約紅紆紇紈紉紋納紐紓純紕紖紗紘紙級紛紜紝紡紬細紱紲紳紵紹紺紼紿絀終組絅絆絎結絕絛絞絡絢給絨絰統絲絳絹綁綃綆綈綌綏經綜綞綠綢綣綬維綯綰綱綴綵綸綹綺綻綽綾綿緄緇緊緋緒緗緘緙線緝緞締緡緣緦編緩緬緯緱緲練緶緹縈縉縊縋縐縑縕縗縛縝縞縟縣縫縭縮縱縲縳縵縶縷縹總績繃繅繆繒織繕繚繞繡繢繩繪繯繰繳繸繹繼繽繾纈纊續纏纓纖纘纜缽罌罰罵罷羅羆羈羋羥義習翹耬聞聯聰聲聳聵聶職聹聾肅脅脈脛脫脹腎腡腦腫腳腸膃膚膠膩膽膾膿臉臍臏臚臠臢臨興舉舊艙艤艦艫艱艷芻苧茲荊莖莢莧華萇萊萵葉葒著葦葷蒔蒞蒼蓀蓋蓮蓯蓴蓽蔞蔣蔥蔦蔭蕁蕆蕎蕕蕘蕢蕪蕭蕷薀薈薊薌薔薘薟薩薳薺藍藎藝藪藶藹藺蘄蘆蘇蘊蘚蘞蘢蘭蘺蘿處虛虜號虧虯蛺蛻蜆蝕蝟蝦蝸螄螞螢螮螻螿蟄蟈蟬蟯蟶蟻蠅蠆蠐蠑蠣蠨蠱蠻術衛袞裊補裝褌褘褲褳褸褻襏襖襝襠襤襪襬襯襲見規覓視覘覡覦親覬覯覲覷覺覽覿觀觴觶訂訃計訊訌討訐訒訓訕訖託記訛訝訟訢訣訥訪設許訴訶診詁詆詎詐詒詔評詖詗詘詛詞詠詡詢詣試詩詫詬詭詮詰話該詳詵詼詿誄誅誆認誑誒誕誘誚語誠誡誣誤誥誦誨說誰課誶誹誼誾調諂諄談諉請諍諏諑諒論諗諛諜諝諞諢諤諦諧諫諭諮諱諳諶諷諸諺諼諾謀謁謂謄謅謊謎謐謔謖謗謙謚講謝謠謨謫謬謳謹謾譅證譎譏譖識譙譚譜譫譯議譴護譸譽譾讀變讎讒讓讕讖讜讞豈豎豬豶貓貙貝貞負財貢貧貨販貪貫責貯貰貲貳貴貶買貸貺費貼貽貿賀賁賂賃賄賅資賈賊賑賒賓賕賙賚賜賞賠賡賢賣賤賦賧質賬賭賰賴賵賺賻購賽賾贄贅贇贈贊贍贏贐贓贔贖贗贛赬趙趨趲跡踐蹌蹕蹣蹤蹺躂躉躊躋躍躑躒躓躕躚躡躥躦躪軀車軋軌軍軑軒軔軛軟軫軸軹軺軻軼軾較輅輇輈載輊輒輔輕輛輜輝輞輟輥輦輩輪輬輯輳輸輻輾輿轀轂轄轅轆轉轍轎轔轟轡轢轤辦辭辮辯農逕這連進運過達違遙遜遞遠遲遷選遺遼邁還邇邊邏邐郟郵鄆鄉鄒鄔鄖鄧鄭鄰鄲鄴鄶鄺酇酈醞醫醬醱釀釁釃釅釋釓釔釕釗釘釙針釣釤釧釩釵釷釹鈀鈁鈃鈄鈉鈍鈐鈑鈒鈔鈕鈞鈣鈥鈦鈧鈮鈰鈳鈴鈷鈸鈹鈺鈽鈾鈿鉀鉅鉈鉉鉋鉍鉑鉗鉚鉛鉞鉤鉦鉬鉭鉶鉸鉺鉻鉿銀銃銅銍銑銓銖銘銚銛銜銠銣銥銦銨銩銪銫銬銳銷銻銼鋁鋃鋅鋇鋌鋏鋒鋙鋝鋟鋤鋦鋨鋩鋪鋮鋯鋰鋱鋸鋼錁錄錆錈錏錐錒錕錙錚錛錟錠錡錢錦錨錩錫錮錯錳錸鍆鍇鍋鍍鍔鍘鍚鍛鍠鍤鍥鍬鍰鍵鍶鍺鎂鎊鎔鎖鎘鎛鎡鎢鎣鎦鎧鎩鎪鎬鎮鎰鎲鎳鎵鏃鏇鏈鏌鏍鏐鏑鏗鏘鏜鏝鏞鏟鏡鏢鏤鏨鏵鏷鏹鏽鐃鐋鐐鐒鐓鐔鐙鐠鐨鐫鐮鐲鐳鐵鐶鐸鐺鐿鑄鑊鑌鑒鑕鑞鑠鑣鑭鑰鑱鑲鑷鑼鑽鑾鑿钁長門閂閃閆閈閉開閌閎閏閑間閔閘閡閣閥閨閩閫閬閭閱閶閹閻閼閽閾閿闃闈闊闋闌闍闐闒闓闔闕闖關闞闠闡闤闥阪陘陝陣陰陳陸陽隉隊階隕際隨險隱隴隸雋雖雙雛雜雞難電霢霧霽靂靄靈靚靜靨鞀鞏鞝韁韃韉韋韌韍韓韙韜韞韻響頁頂頃項順頇頊頌頎頏預頑頒頓頗領頜頡頤頦頭頰頲頷頸頹頻顆題額顎顏顒顓顙顛類顢顥顧顫顯顰顱顳顴風颭颮颯颶颸颺颻颼飀飄飆飛飣飥飩飪飫飭飯飲飴飼飽飾餃餅餉養餌餑餒餓餕餖餛餞餡館餱餳餺餼餾餿饁饃饅饈饉饋饌饒饗饜饞馬馭馮馱馳馴馹駁駐駑駒駔駕駘駙駛駝駟駢駭駰駱駸駿騁騂騅騍騎騏騖騙騤騧騫騭騮騰騶騷騸騾驀驁驂驃驄驅驊驌驍驏驕驗驛驟驢驤驥驦驪驫髏髕髖鬢鬧鬩鬮魎魘魚魛魨魯魴魷魺鮐鮑鮒鮓鮚鮞鮦鮪鮫鮭鮮鮶鯀鯁鯇鯉鯊鯔鯕鯖鯗鯛鯡鯢鯤鯧鯨鯪鯫鯷鯽鰈鰉鰍鰒鰓鰜鰣鰥鰨鰩鰭鰱鰲鰳鰷鰹鰻鰼鰾鱈鱉鱒鱔鱖鱗鱘鱟鱠鱣鱧鱨鱭鱷鱸鱺鳥鳧鳩鳲鳳鳴鳶鴆鴇鴉鴒鴕鴛鴝鴞鴟鴣鴦鴨鴯鴰鴷鴻鴿鵁鵂鵃鵑鵒鵓鵜鵝鵠鵡鵪鵬鵯鵲鵷鶄鶇鶉鶊鶖鶘鶚鶡鶩鶪鶬鶯鶲鶴鶹鶺鶻鶼鶿鷁鷂鷈鷊鷓鷖鷗鷙鷚鷥鷦鷫鷯鷲鷳鷸鷹鷺鷽鷿鸂鸇鸏鸕鸚鸛鸝鸞鹺鹽麗麥麩黃黌點黲黶黷黽黿鼉鼴齊齋齎齏齒齔齕齗齙齜齟齠齡齦齪齬齲齶齷龍龐龔龕龜匯壇歷沖獲當盡臟葯蕩錘須飢鹵發藥㠏㩜䋻䝼䯀䰾䱽䲁倈剗劏劚噝壋壠屓崬悞擓梘榲灧煱燶獁獱瘂癧瞘碸礆糹絝緓繿耮腖葤蕒蟎襇覥訩貟軤軲釺鈈鉕銱鋣鋥鋶錇鍀鍃鍈鍩鎄鎇鎿鏰鐦鐧鑔鑥鑹鞽頮頴顬飈飠餎餜餷饊饢騌鮁鮃鮋鮍鮎鯝鯴鯿鰂鰟鰠鰵鰺鱅鱝鴴鵐鵮鵾鶓鶥鸌鸘龎䋙堖訁釒䊷戱槤殨瘮稏綐覎飿餄餏餶魢鮊鮜鮳鮺鯒鰁鰃鰏鰮鱂鱤鱯鳾傑傭僕價優兒劃勝噸塗壞姦寧屍嶺幾廠後徵憐懷懺捨掛撲據擾於曬桿棲極構樸機櫃氣潔澱濘灑燉異癢確禦種窪範築簾籬網繭聖聽臘與莊萬薦蘋蟣蟲蠟蠶製觸註誇豐趕踴輓適醜離雲願颳餚驚骯體鬆鬥鬱鹹麼黨採並係幹復隻裡瀋畫鍾鐘靦餘鯰鹼";

//Simplified Chinese chars
var chsList = "“”‘’丢乱亚伫来仑侣俣伣侠伥俩仓个们伦伟侧侦伪伧伞备偬传伛债伤倾偻仅佥侨侥偾仪侬亿侩俭傧俦侪偿储俪㑩傩傥俨兑兖内两册幂净冻凛凯别删刭则刹刚剥剐剀创剧刘刽刿剑剂劲动务勋劳势勚劢励劝匀匦匮区协却厍厌厉厣参丛咤吴呐吕呙员呗吣问哑启唡㖞唤丧乔单哟呛啬唝吗呜唢哔叹喽呕啧尝唛哗唠啸叽哓呒啴嘘㖊哒哝哕嗳哙喷咛吓哜噜啮呖咙亸喾严嘤啭嗫嚣冁呓嘱囱囵国围园圆图团埯垭执坚垩埚尧报场块茔垲埘坞埙尘堑垫坠堕坟垦压垒圹垆垄坜坝壮壶壸寿够梦夹奂奥奁夺奋姹妆姗娱娄妇娅娲妫媪妈妪妩娴婳娆婵娇嫱嫒嬷嫔婴婶娈孙学孪宫寝实审写宽宠宝将专寻对导尴届屉屡层屦属冈岘岛峡崃岗峥岚嵝崭岖嵚崂峤峣峄崄岙嵘屿岿峦巅巯帅师帐带帧帏帼帻帜币帮帱库厕厢厩厦厨厮庙庑废广廪庐厅弑弪张强弹弥弯彦径从徕彻恒耻悦怅闷恶恼恽恻爱惬悫怆恺忾态愠惨惭恸惯怄怂虑悭庆忧惫凭愦惮愤悯怃宪忆恳应怿懔怼懑恹惩懒悬惧慑恋戆戋戗戬战戏户抛捝挟扪扫抡挜挣拣扬换挥损摇捣揾抢掴掼搂挚抠抟掺捞挦撑挠㧑挢掸拨抚揿挞挝捡拥掳择击挡担挤拟摈拧搁掷扩撷摆擞撸摅撵拢拦撄搀撺携摄攒挛摊搅揽败叙敌数敛毙斓斩断时晋昼晕晖旸畅暂晔昙晓暧旷昽书会胧东锨栅栀条枭棁弃枨枣栋栈梾桠杨枫桢业杩荣桤枪椠椁桨桩乐枞楼标枢样树桦桡桥椭横檩柽档桧槚检樯梼槟柠槛橹榈栉椟橼栎橱槠栌枥橥榇蘖栊榉樱栏权椤栾榄棂钦欧欤欢岁归殁残殒殇殚殓殡㱩歼杀壳毁殴毵牦毡氇氢氩氲决没况汹浃泾凉泪渌沦渊涞浅涣减涡测浑凑浈汤沩沟温沧灭涤荥沪滞渗浒浐滚满渔沤汉涟渍涨溆渐浆颍泼潜润浔溃滗涠涩浇涝涧渑泽滪泶浍浊浓湿济涛滥潍滨溅泺滤滢渎㲿泻浏濒泸沥潇潆潴泷濑潋澜沣滠滩灏漤湾滦灾为乌烃无炼炜烟茕焕烦炀煴荧炝热颎炽烨灯烧烫焖营灿烛烩烬焘烁炉烂争爷尔墙牍牵荦犊牺状狭狈狰犹狲狱狮奖独狯猃狝狞猎犷兽獭献猕猡现珐珲玮玚琐瑶莹玛玱琏玑瑷珰环玺琼珑璎瓒瓯产亩毕畴叠痉疴疯疡痪瘗疮疟疭瘘疗痨痫瘅疠瘪疖癞癣瘿瘾痈瘫癫皑疱皲皱盗盏监盘卢眦众睁睐䁖瞒瞆睑眬瞩矫硁硖砗砚硕砀码硙砖碜碛矶硗础碍矿砺砾矾砻禄祸祯祎祃禅礼祢祷秃籼税秆禀称稣积颖秾穑秽稳稆窝穷窑窎窭窥窜窍窦窃竞笔笋笕䇲笺筝节箧筼笃筛筚箦篓箪简篑箫筜签篮筹箓箨籁笼笾簖箩粤糁粪粮粝籴粜纠纪纣约红纡纥纨纫纹纳纽纾纯纰纼纱纮纸级纷纭纴纺䌷细绂绁绅纻绍绀绋绐绌终组䌹绊绗结绝绦绞络绚给绒绖统丝绛绢绑绡绠绨绤绥经综缍绿绸绻绶维绹绾纲缀䌽纶绺绮绽绰绫绵绲缁紧绯绪缃缄缂线缉缎缔缗缘缌编缓缅纬缑缈练缏缇萦缙缢缒绉缣缊缞缚缜缟缛县缝缡缩纵缧䌸缦絷缕缥总绩绷缫缪缯织缮缭绕绣缋绳绘缳缲缴䍁绎继缤缱缬纩续缠缨纤缵缆钵罂罚骂罢罗罴羁芈羟义习翘耧闻联聪声耸聩聂职聍聋肃胁脉胫脱胀肾脶脑肿脚肠腽肤胶腻胆脍脓脸脐膑胪脔臜临兴举旧舱舣舰舻艰艳刍苎兹荆茎荚苋华苌莱莴叶荭着苇荤莳莅苍荪盖莲苁莼荜蒌蒋葱茑荫荨蒇荞莸荛蒉芜萧蓣蕰荟蓟芗蔷荙莶萨䓕荠蓝荩艺薮苈蔼蔺蕲芦苏蕴藓蔹茏兰蓠萝处虚虏号亏虬蛱蜕蚬蚀猬虾蜗蛳蚂萤䗖蝼螀蛰蝈蝉蛲蛏蚁蝇虿蛴蝾蛎蟏蛊蛮术卫衮袅补装裈袆裤裢褛亵袯袄裣裆褴袜䙓衬袭见规觅视觇觋觎亲觊觏觐觑觉览觌观觞觯订讣计讯讧讨讦讱训讪讫讬记讹讶讼䜣诀讷访设许诉诃诊诂诋讵诈诒诏评诐诇诎诅词咏诩询诣试诗诧诟诡诠诘话该详诜诙诖诔诛诓认诳诶诞诱诮语诚诫诬误诰诵诲说谁课谇诽谊訚调谄谆谈诿请诤诹诼谅论谂谀谍谞谝诨谔谛谐谏谕谘讳谙谌讽诸谚谖诺谋谒谓誊诌谎谜谧谑谡谤谦谥讲谢谣谟谪谬讴谨谩䜧证谲讥谮识谯谭谱谵译议谴护诪誉谫读变雠谗让谰谶谠谳岂竖猪豮猫䝙贝贞负财贡贫货贩贪贯责贮贳赀贰贵贬买贷贶费贴贻贸贺贲赂赁贿赅资贾贼赈赊宾赇赒赉赐赏赔赓贤卖贱赋赕质账赌䞐赖赗赚赙购赛赜贽赘赟赠赞赡赢赆赃赑赎赝赣赪赵趋趱迹践跄跸蹒踪跷跶趸踌跻跃踯跞踬蹰跹蹑蹿躜躏躯车轧轨军轪轩轫轭软轸轴轵轺轲轶轼较辂辁辀载轾辄辅轻辆辎辉辋辍辊辇辈轮辌辑辏输辐辗舆辒毂辖辕辘转辙轿辚轰辔轹轳办辞辫辩农迳这连进运过达违遥逊递远迟迁选遗辽迈还迩边逻逦郏邮郓乡邹邬郧邓郑邻郸邺郐邝酂郦酝医酱酦酿衅酾酽释钆钇钌钊钉钋针钓钐钏钒钗钍钕钯钫钘钭钠钝钤钣钑钞钮钧钙钬钛钪铌铈钶铃钴钹铍钰钸铀钿钾钜铊铉铇铋铂钳铆铅钺钩钲钼钽铏铰铒铬铪银铳铜铚铣铨铢铭铫铦衔铑铷铱铟铵铥铕铯铐锐销锑锉铝锒锌钡铤铗锋铻锊锓锄锔锇铓铺铖锆锂铽锯钢锞录锖锩铔锥锕锟锱铮锛锬锭锜钱锦锚锠锡锢错锰铼钔锴锅镀锷铡钖锻锽锸锲锹锾键锶锗镁镑镕锁镉镈镃钨蓥镏铠铩锼镐镇镒镋镍镓镞镟链镆镙镠镝铿锵镗镘镛铲镜镖镂錾铧镤镪锈铙铴镣铹镦镡镫镨镄镌镰镯镭铁镮铎铛镱铸镬镔鉴锧镴铄镳镧钥镵镶镊锣钻銮凿镢长门闩闪闫闬闭开闶闳闰闲间闵闸阂阁阀闺闽阃阆闾阅阊阉阎阏阍阈阌阒闱阔阕阑阇阗阘闿阖阙闯关阚阓阐阛闼坂陉陕阵阴陈陆阳陧队阶陨际随险隐陇隶隽虽双雏杂鸡难电霡雾霁雳霭灵靓静靥鼗巩绱缰鞑鞯韦韧韨韩韪韬韫韵响页顶顷项顺顸顼颂颀颃预顽颁顿颇领颌颉颐颏头颊颋颔颈颓频颗题额颚颜颙颛颡颠类颟颢顾颤显颦颅颞颧风飐飑飒飓飔飏飖飕飗飘飙飞饤饦饨饪饫饬饭饮饴饲饱饰饺饼饷养饵饽馁饿馂饾馄饯馅馆糇饧馎饩馏馊馌馍馒馐馑馈馔饶飨餍馋马驭冯驮驰驯驲驳驻驽驹驵驾骀驸驶驼驷骈骇骃骆骎骏骋骍骓骒骑骐骛骗骙䯄骞骘骝腾驺骚骟骡蓦骜骖骠骢驱骅骕骁骣骄验驿骤驴骧骥骦骊骉髅髌髋鬓闹阋阄魉魇鱼鱽鲀鲁鲂鱿鲄鲐鲍鲋鲊鲒鲕鲖鲔鲛鲑鲜鲪鲧鲠鲩鲤鲨鲻鲯鲭鲞鲷鲱鲵鲲鲳鲸鲮鲰鳀鲫鲽鳇鳅鳆鳃鳒鲥鳏鳎鳐鳍鲢鳌鳓鲦鲣鳗鳛鳔鳕鳖鳟鳝鳜鳞鲟鲎鲙鳣鳢鲿鲚鳄鲈鲡鸟凫鸠鸤凤鸣鸢鸩鸨鸦鸰鸵鸳鸲鸮鸱鸪鸯鸭鸸鸹䴕鸿鸽䴔鸺鸼鹃鹆鹁鹈鹅鹄鹉鹌鹏鹎鹊鹓䴖鸫鹑鹒鹙鹕鹗鹖鹜䴗鸧莺鹟鹤鹠鹡鹘鹣鹚鹢鹞䴘鹝鹧鹥鸥鸷鹨鸶鹪鹔鹩鹫鹇鹬鹰鹭鸴䴙㶉鹯鹲鸬鹦鹳鹂鸾鹾盐丽麦麸黄黉点黪黡黩黾鼋鼍鼹齐斋赍齑齿龀龁龂龅龇龃龆龄龈龊龉龋腭龌龙庞龚龛龟汇坛历冲获当尽脏药荡锤须饥卤发药㟆㨫䌾䞍䯅鲃䲝鳚俫刬㓥㔉咝垱垅屃岽悮㧟枧榅滟㶽㶶犸㺍痖疬眍砜硷纟绔绬䍀耢胨荮荬螨裥觍讻贠轷轱钎钚钷铞铘锃锍锫锝锪锳锘锿镅镎镚锎锏镲镥镩鞒颒颕颥飚饣饹馃馇馓馕骔鲅鲆鲉鲏鲇鲴鲺鳊鲗鳑鳋鳘鲹鳙鲼鸻鹀鹐鹍鹋鹛鹱鹴厐䌺垴讠钅䌶戯梿㱮瘆䅉䌼觃饳饸饻馉鱾鲌鲘鲓鲝鲬鳈鳂鲾鳁鳉鳡鳠䴓杰佣仆价优儿划胜吨涂坏奸宁尸岭几厂后征怜怀忏舍挂扑据扰于晒杆栖极构朴机柜气洁淀泞洒炖异痒确御种洼范筑帘篱网茧圣听腊与庄万荐苹虮虫蜡蚕制触注夸丰赶踊挽适丑离云愿刮肴惊肮体松斗郁咸么党采并系干复只里渖画锺钟䩄馀鲶碱";

//inspired by augor and phoenix from proxomitron.cn, and "繁簡轉換" script by yecao
function handleTextNode(prtNode) {
	var nodes = prtNode.childNodes,
		i = 0,
		l = nodes.length;
	for (; i < l; i++) {
		if (nodes[i].nodeType === 3) {
			nodes[i].data = conv(nodes[i].data);
		} else if (nodes[i].childNodes) {
			handleTextNode(nodes[i]);
		}
	}
}

function conv(str) {
	var ret = "",
		find,
		i = 0,
		l = str.length;
	for (; i < l; i++) {
		var cha = str.charAt(i);
		if (/[\u4E00-\u9FFF「」『』“”‘’\u3400-\u4DBF]/.test(cha) === false) {
			find = -1;
		} else {
			find = chtList.indexOf(cha);
		}
		if (find != -1) {
			ret += chsList.charAt(find);
		} else {
			ret += cha;
		}
	}
	return ret;
}

handleTextNode(document.documentElement);

})();