// ==UserScript==
// @name        Dospy Rapid Reply
// @namespace   exzhawk2
// @description Dospy Rapid Reply
// @include     http://bbs.dospy.com/*
// @version     1
// ==/UserScript==

(function() {
	var rcontent = new Array("沙发！支持楼主的软件更新……","软件多多，帖子不错，谢谢提供分享，大力支持！","辛苦了！感谢楼主的无私奉献！","关注楼主提供的软件更新，感谢提供分享……","如此好资源一定要强顶，多谢楼主每天更新！","帖子不错，谢谢提供分享，辛苦了，软件多多！","很有用呀，我下了一个有用的，支持你！谢谢","谢谢楼主的无私奉献！！","软件多多，帖子不错，感谢楼主提供分享，辛苦了！","好软件要好的支持，支持楼主，希望能出更好的软件","谢谢楼主提供感谢分享，您辛苦啦，谢谢","楼主发的东西真的不错支持楼主！！以后要发更好的帖子啊！谢谢","表示支持一下啊！谢谢LZ提供！！谢谢","不错的软件，支持一下楼主，非常感谢，有几款还不错下来看看。","谢谢楼主的每日更新，今天全力支持你！！谢谢","精品软件不少，有需要的啊，收藏了，感谢分享！","感谢更新~~~ 谢谢：）","楼主辛苦了，支持一下，收藏了其中的一个！谢谢","楼主辛苦了，十分感谢","感谢楼主,辛苦了，非常感谢，有几款还不错下来看看。","不错的软件，支持一下楼主，非常感谢，太好了","先回贴在收藏，谢谢楼主！！","感谢楼主的精心整理，支持您……","感谢楼主,辛苦了，非常感谢，有几款还不错下来看看。","真的好棒！绝对是精华贴！","谢谢楼主提供分享！！谢谢","很不错的贴子！谢谢提供了！！","非常感谢楼主的分享！全力支持！！","支持一下 谢谢楼主分享","不错，有的确实很需要，谢谢分享！","这个应该很多人用得到，感谢分享","感谢了支持辛苦了","谢谢提供，正需要。谢谢","不错，不错。谢谢！！","非常不错的经典贴子！谢谢提供！","冒个泡，支持！谢谢","强烈顶。。太强大了，真是让我大开眼界啊！","果然都是好东西，谢谢楼主了！辛苦了，以后多发点","支持楼主了，辛辛苦苦为大家，敬佩您啊！","这样的好帖，不顶不行阿！","感谢楼主提供每日更新！！谢谢","感谢楼主！！辛苦了！！","很不错，谢谢提供。谢谢分享！","不错不错！！占个位置支持！！","不错，支持楼主的帖子。","谢谢楼主发帖分享辛苦！！！","辛苦了，我来下载。","辛苦了搂主，天天准时，谢谢","大家都辛苦了:)","回贴支持。谢谢：）","酷呆了~~楼主真是个好人","好东西，支持一下！！","感谢楼主提供分享！！支持一下","谢谢楼主发帖分享，辛苦了，支持！！","楼主的用心良苦！谢谢！","谢谢楼主了、你的热心值得学习。","谢谢楼主发布。 谢谢分享。","呵呵，不错，好东西哦~~","感谢更新~~~ 辛苦了：）","很不错呀，谢谢楼主的分享啦！","楼主顶你一个哦！！ 谢谢分享。","谢谢楼主了、你的人品值得学习。","看上去真的不错，回复支持一下！！","感谢楼主发贴，有些东东一直用的。","不错，好资源，支持你，谢谢！！","谢谢分享，辛苦了，支持！","好东西，居然还有这样的好东西，谢谢了","不错，谢谢楼主好贴子。。","您的帖子很精彩，希望能很快看到您的下一帖。","好多东东啊！！回复谢谢了！！","呵呵，好帖支持一下呢谢谢了啊！！","很不错呀，谢谢楼主的分享啦！","很不错啊，谢谢楼主了！！","谢了！！！辛苦了！！！","支持一下。谢谢精品。","纯支持一下，楼主辛苦了。","楼主辛苦了，收集了这么多，羡慕！谢谢","辛苦了，不错的，支持了。","这么好的帖子不顶行啊！！谢谢","楼主辛苦了，收藏起来！！！","谢谢更新，支持一下：）","强烈支持，谢谢分享，不错不错。","先下载再说，东东不错！！","不顶不行啊，好东西哦！！","好多经典资源啊！！顶个。。","看贴就要回帖！！多谢搂主的帖子！！","好东西，不错了，支持你了，谢谢。","好棒，楼主真是辛苦了，非常的感谢唉！！","楼主发帖辛苦了，感谢提供！！","看贴回贴才是厚道！","不错，这样的介绍不错，收藏了几款，谢谢提供。","试坐沙发的感觉！谢谢","先自己沙发！！谢谢","就第一个咯，谢谢！","好东西大家分享，谢谢","希望大家可以用得到！谢谢","我为人人！！人人为我！！","感谢大家的支持！谢谢","大家可以去转帖！！转去N多论坛赚分","好的帖子大家转！！赚分大家一起赚！！谢谢","感谢支持！感谢回贴！谢谢","好贴大家分享！！感谢ING","好资源！大家分享！！谢谢","感谢支持~~~ 谢谢：）","不客气了！！谢谢","请问大家！为什么没有人回贴的呢？？？","相信大家都听过这名字吧？让我们一起分享！！","大家请回贴支持！！谢谢","辛苦，大家各取所需吧！！谢谢","请问有大家喜欢的吗？？？","用过的人都知道好！！请支持！！谢谢","希望对大家有帮助！！谢谢","请看贴者看完后回复下！！谢谢","谢谢您的关注！！谢谢您的支持！！","不客气！！大家喜欢我天天发给大家分享！！谢谢","有几个很不错的资源。欢迎大家来支持！谢谢","相信一定让大家喜欢！！谢谢","本贴要是对大家有帮助请回贴支持！！谢谢","朋友们不要客气！！好东西大家一起分享","请别让好贴子沉下去了！走过路过请支持下！谢谢","看完贴子的朋友请回帖顶一下，别让它沉下去了，以便给需要的人分享呵","看贴请回贴，回贴是一种美德！","经典发给大家值得称赞！！谢谢","谢谢收藏佳品大家分享","请问！！怎么没人回贴子的吗？？谢谢","记住要回帖哟，下次还有好东东献给大家","东东要下，帖子要回！好的回复有分加");
	var rname=document.getElementsByTagName("a");
	var redit = document.getElementsByClassName("editp");
	if (redit.length==0){
		try {
			document.getElementById("fastpostmessage").innerHTML = rcontent[Math.floor(Math.random()*rcontent.length)];
			document.getElementById("fastpostsubmit").click();
		}catch(ee){};
	};
})(); 