// ==UserScript==
// @name Wanikani On'yomi in katakana
// @namespace thenn42.eu/userscripts
// @description Transforms any onyomi reading into katakana on Wanikani
// @include     https://www.wanikani.com/*
// @include     http://www.wanikani.com/*
// @version    2.1.4
// @run-at document-end
// @updateURL https://userscripts.org/scripts/source/167274.user.js
// @downloadURL https://userscripts.org/scripts/source/167274.user.js
// @require     http://code.jquery.com/jquery-1.9.1.min.js
// @grant GM_log
// ==/UserScript==



var maxLevel=50;
var KanjiList = {"撃": 1, "茂": 1, "誇": 1, "伊": 1, "預": 1, "抗": 1, "料": 1, "洞": 1, "造": 1, "般": 1, "作": 1, "河": 1, "欲": 1, "侵": 1, "然": 1, "吸": 1, "眺": 1, "稼": 1, "談": 1, "反": 1, "科": 1, "筒": 1, "織": 1, "摘": 1, "遠": 0, "知": 1, "除": 1, "緩": 0, "罪": 1, "衰": 1, "泳": 0, "譲": 1, "俵": 1, "奨": 1, "覆": 1, "沈": 1, "個": 1, "引": 0, "枚": 1, "謝": 1, "無": 1, "崩": 1, "是": 1, "械": 1, "刷": 1, "頻": 1, "運": 1, "俊": 1, "契": 1, "寒": 0, "典": 1, "教": 1, "衛": 1, "也": 0, "盤": 1, "括": 1, "景": 1, "併": 1, "滴": 1, "凶": 1, "基": 1, "鹿": 1, "巾": 1, "贈": 1, "上": 1, "后": 1, "騒": 1, "底": 0, "怖": 1, "牛": 1, "閣": 1, "岩": 0, "足": 1, "伴": 1, "妻": 1, "鬼": 1, "尾": 1, "衆": 1, "泉": 1, "聖": 1, "虚": 1, "鉢": 1, "寧": 1, "鳩": 0, "跳": 1, "号": 1, "偶": 1, "移": 1, "険": 1, "老": 1, "消": 1, "鈍": 1, "圏": 1, "頑": 1, "産": 1, "撮": 1, "課": 1, "吹": 0, "精": 1, "柄": 0, "珍": 1, "克": 1, "車": 1, "前": 1, "双": 1, "駐": 1, "幕": 1, "翔": 0, "潟": 0, "賞": 1, "勢": 1, "編": 1, "杯": 1, "固": 1, "糾": 1, "齢": 1, "済": 1, "再": 1, "堂": 1, "隣": 1, "閥": 1, "符": 1, "義": 1, "爆": 1, "水": 1, "傷": 1, "町": 1, "頼": 1, "弾": 1, "所": 1, "旅": 1, "重": 1, "桜": 0, "鏡": 0, "難": 1, "酢": 0, "学": 1, "臭": 0, "詰": 0, "襲": 1, "郷": 1, "培": 1, "陸": 1, "持": 0, "技": 1, "載": 1, "予": 1, "越": 1, "笑": 0, "制": 1, "辞": 1, "加": 1, "誰": 0, "貴": 1, "簿": 1, "故": 1, "蓄": 1, "配": 1, "城": 0, "秒": 1, "補": 1, "江": 0, "陣": 1, "略": 1, "顧": 1, "彩": 1, "乳": 1, "相": 1, "好": 1, "飼": 0, "争": 1, "王": 1, "従": 1, "純": 1, "検": 1, "抱": 0, "垣": 0, "冷": 1, "父": 0, "礼": 1, "綿": 1, "績": 1, "友": 1, "豊": 1, "働": 1, "子": 1, "輸": 1, "毛": 1, "占": 1, "婦": 1, "普": 1, "議": 1, "俳": 1, "浴": 0, "幾": 0, "薄": 1, "複": 1, "三": 1, "倍": 1, "促": 1, "階": 1, "弓": 1, "講": 1, "曇": 0, "介": 1, "大": 1, "支": 1, "暮": 1, "許": 1, "状": 1, "鍋": 0, "泊": 1, "里": 0, "問": 1, "当": 1, "展": 1, "衝": 1, "滞": 1, "珠": 1, "督": 1, "話": 1, "具": 1, "蜂": 0, "鰐": 0, "墓": 1, "暗": 1, "依": 1, "汚": 1, "判": 1, "座": 1, "芯": 1, "段": 1, "訴": 1, "隷": 1, "区": 1, "羽": 0, "社": 1, "胃": 1, "案": 1, "噌": 1, "酎": 1, "緑": 0, "賛": 1, "保": 1, "面": 1, "句": 1, "剤": 1, "給": 1, "慮": 1, "深": 1, "雷": 1, "選": 1, "系": 1, "幼": 1, "考": 0, "渇": 0, "岐": 1, "徒": 1, "伝": 0, "訟": 1, "連": 1, "天": 1, "風": 1, "札": 1, "音": 1, "農": 1, "営": 1, "尻": 0, "野": 1, "習": 1, "揚": 1, "機": 1, "遣": 1, "矢": 1, "勤": 1, "左": 0, "磨": 0, "良": 0, "泰": 1, "開": 1, "県": 1, "林": 0, "溝": 1, "館": 1, "本": 1, "観": 1, "点": 1, "刺": 1, "宿": 1, "場": 0, "時": 1, "担": 1, "豆": 1, "過": 1, "嵐": 0, "姓": 1, "答": 0, "滝": 0, "潜": 1, "員": 1, "釣": 0, "院": 1, "票": 1, "華": 1, "走": 1, "歴": 1, "執": 1, "酸": 1, "巻": 1, "彼": 0, "寿": 1, "塾": 1, "炎": 1, "少": 1, "餓": 1, "朗": 1, "別": 1, "弧": 1, "妨": 1, "昭": 1, "振": 1, "殴": 1, "帽": 1, "降": 1, "郎": 1, "黒": 1, "九": 1, "離": 1, "古": 1, "塩": 0, "髪": 0, "仲": 0, "幽": 1, "翼": 1, "飾": 1, "計": 1, "同": 1, "窓": 0, "研": 1, "脚": 1, "劣": 1, "値": 0, "粧": 1, "暫": 1, "太": 1, "断": 1, "搬": 1, "辱": 1, "育": 1, "券": 1, "麻": 1, "尼": 1, "踊": 0, "資": 1, "像": 1, "顔": 0, "距": 1, "棟": 1, "審": 1, "奪": 0, "葬": 1, "脅": 1, "和": 1, "透": 1, "験": 1, "夕": 0, "挙": 1, "折": 1, "減": 1, "隠": 1, "関": 1, "骨": 1, "訳": 1, "液": 1, "匹": 1, "収": 1, "緒": 1, "著": 1, "拘": 1, "睡": 1, "因": 1, "剣": 1, "入": 1, "虫": 0, "息": 1, "揮": 1, "仰": 1, "詳": 1, "極": 1, "幻": 1, "出": 1, "対": 1, "最": 1, "掃": 1, "誉": 1, "型": 1, "斗": 1, "供": 1, "貝": 0, "眠": 1, "縦": 0, "効": 1, "情": 1, "埋": 0, "界": 1, "量": 1, "巨": 1, "旗": 1, "浜": 0, "詞": 1, "口": 1, "巧": 1, "敬": 1, "陶": 1, "翻": 1, "遺": 1, "姿": 1, "者": 1, "了": 1, "看": 1, "名": 1, "粒": 1, "砕": 1, "暖": 1, "掘": 1, "語": 1, "醤": 1, "麦": 0, "末": 1, "薬": 1, "男": 1, "鼻": 0, "為": 1, "尽": 1, "委": 1, "敗": 1, "獣": 1, "健": 1, "偽": 1, "旬": 1, "乱": 1, "述": 1, "歳": 1, "長": 1, "零": 1, "特": 1, "司": 1, "要": 1, "斉": 1, "序": 1, "崎": 0, "涙": 0, "会": 1, "嬢": 1, "焦": 1, "被": 1, "皿": 0, "血": 1, "賃": 1, "迅": 1, "金": 1, "卒": 1, "勧": 1, "吐": 0, "周": 1, "浮": 0, "晴": 0, "麗": 1, "狭": 0, "香": 1, "隔": 1, "託": 1, "視": 1, "抜": 0, "星": 0, "客": 1, "説": 1, "港": 1, "脱": 1, "掲": 1, "暴": 1, "紹": 1, "岸": 1, "扇": 1, "嫌": 1, "発": 1, "牧": 1, "処": 1, "湯": 0, "更": 1, "糸": 0, "鋼": 1, "訂": 1, "導": 1, "間": 1, "芝": 0, "用": 1, "阪": 1, "読": 0, "吾": 0, "裁": 1, "滅": 1, "秋": 0, "児": 1, "拝": 1, "捜": 1, "巣": 0, "腰": 0, "色": 0, "響": 1, "清": 1, "澄": 1, "指": 0, "蚊": 0, "完": 1, "式": 1, "愛": 1, "期": 1, "群": 1, "邦": 1, "設": 1, "伯": 1, "爽": 0, "久": 0, "葉": 0, "積": 1, "富": 1, "菜": 1, "束": 1, "雪": 0, "建": 1, "言": 1, "超": 1, "丘": 1, "管": 1, "娠": 1, "夢": 1, "貯": 1, "徹": 1, "常": 1, "淡": 1, "立": 1, "題": 1, "酒": 1, "招": 1, "算": 1, "工": 1, "層": 1, "僧": 1, "器": 1, "番": 1, "潮": 1, "幸": 1, "七": 1, "概": 1, "贅": 1, "有": 1, "程": 1, "小": 1, "美": 1, "冒": 1, "殖": 1, "辛": 1, "喪": 1, "憲": 1, "蔵": 1, "家": 1, "刻": 1, "綺": 1, "今": 1, "浅": 0, "賄": 1, "杉": 0, "街": 1, "余": 1, "付": 0, "章": 1, "幣": 1, "革": 1, "雨": 0, "業": 1, "修": 1, "懲": 1, "敵": 1, "役": 1, "謀": 1, "月": 1, "倒": 1, "掛": 0, "肝": 1, "笠": 0, "在": 1, "涯": 1, "花": 0, "去": 1, "尺": 1, "焼": 0, "濃": 1, "懇": 1, "総": 1, "韓": 1, "仙": 1, "換": 1, "豚": 0, "鳥": 1, "呪": 0, "路": 1, "英": 1, "柳": 1, "整": 1, "究": 1, "都": 1, "兼": 1, "百": 1, "較": 1, "脇": 0, "刑": 1, "思": 1, "悲": 0, "横": 0, "医": 1, "裂": 1, "筋": 1, "額": 1, "論": 1, "飢": 1, "履": 1, "照": 1, "仮": 1, "扱": 0, "競": 1, "幹": 1, "災": 1, "盾": 1, "漂": 1, "暇": 1, "粋": 1, "希": 1, "礎": 1, "疑": 1, "務": 1, "園": 1, "枝": 1, "唱": 1, "測": 1, "康": 1, "妹": 1, "蛇": 0, "忍": 1, "青": 1, "巡": 1, "形": 1, "想": 1, "廷": 1, "絶": 1, "昇": 1, "尋": 1, "朝": 0, "舟": 0, "罰": 1, "京": 1, "耳": 0, "流": 1, "賀": 1, "桃": 0, "係": 1, "屋": 0, "菊": 1, "穏": 1, "畑": 0, "道": 1, "乗": 0, "曜": 1, "絡": 1, "部": 1, "復": 1, "寺": 0, "肉": 1, "脈": 1, "唐": 1, "蜜": 1, "岡": 0, "素": 1, "否": 1, "爪": 0, "亭": 1, "抵": 1, "眼": 1, "況": 1, "動": 1, "協": 1, "俗": 1, "聞": 1, "童": 1, "全": 1, "数": 1, "至": 1, "貿": 1, "空": 1, "国": 1, "把": 1, "後": 1, "向": 1, "沖": 0, "果": 1, "簡": 1, "室": 1, "圧": 1, "努": 1, "中": 1, "新": 1, "脳": 1, "強": 1, "鍵": 0, "画": 1, "猿": 0, "傾": 1, "汁": 1, "淀": 0, "凍": 1, "翌": 1, "鑑": 1, "様": 0, "締": 1, "適": 1, "度": 1, "歯": 0, "森": 0, "曲": 1, "援": 1, "島": 0, "陽": 1, "埼": 0, "一": 1, "栄": 1, "興": 1, "斬": 1, "途": 1, "記": 1, "悟": 1, "御": 1, "索": 1, "妥": 1, "堤": 1, "身": 1, "優": 1, "缶": 1, "容": 1, "示": 1, "監": 1, "限": 1, "達": 1, "警": 1, "涼": 1, "柱": 1, "拳": 1, "聴": 1, "電": 1, "呼": 0, "企": 1, "満": 1, "椅": 1, "納": 1, "気": 1, "謙": 1, "誘": 1, "覚": 1, "責": 1, "朱": 1, "阻": 1, "棄": 1, "草": 0, "汗": 0, "奥": 1, "東": 1, "悩": 0, "胴": 1, "登": 1, "避": 1, "現": 1, "航": 1, "梅": 0, "文": 1, "昆": 1, "律": 1, "福": 1, "税": 1, "世": 1, "舞": 1, "宣": 1, "助": 1, "仁": 1, "求": 1, "装": 1, "経": 1, "雑": 1, "僕": 1, "酔": 1, "湖": 1, "識": 1, "狩": 0, "迫": 1, "賭": 0, "竹": 0, "丁": 1, "授": 1, "夏": 0, "洗": 1, "準": 1, "標": 1, "望": 1, "斜": 1, "感": 1, "択": 1, "利": 1, "漫": 1, "邪": 1, "撲": 1, "箸": 0, "確": 1, "激": 1, "賂": 1, "犠": 1, "扉": 1, "籍": 1, "奏": 1, "卓": 1, "違": 0, "他": 1, "棚": 1, "忠": 1, "季": 1, "物": 0, "諮": 1, "恵": 1, "致": 1, "延": 1, "寸": 1, "命": 1, "退": 1, "舌": 0, "揺": 1, "鐘": 1, "宝": 1, "婚": 1, "輪": 1, "堰": 1, "岳": 1, "方": 0, "机": 0, "証": 1, "派": 1, "屈": 1, "飛": 1, "寝": 0, "絞": 1, "班": 1, "念": 1, "年": 1, "球": 1, "的": 1, "羊": 1, "斎": 1, "五": 1, "列": 1, "探": 1, "貨": 1, "犬": 0, "失": 1, "張": 1, "憶": 1, "改": 1, "蒸": 1, "参": 1, "雄": 1, "駆": 0, "免": 1, "恋": 1, "毒": 1, "何": 0, "留": 1, "孝": 1, "竜": 1, "州": 1, "来": 1, "触": 1, "注": 1, "火": 1, "独": 1, "声": 0, "米": 1, "駒": 0, "湿": 1, "儀": 1, "宇": 1, "順": 1, "粉": 1, "井": 1, "演": 1, "甘": 0, "販": 1, "銭": 1, "錬": 1, "稲": 0, "便": 1, "雅": 1, "仕": 1, "潔": 1, "受": 0, "属": 1, "鋭": 1, "漁": 1, "送": 1, "床": 1, "掌": 1, "北": 1, "宜": 0, "弟": 1, "春": 0, "欧": 1, "報": 1, "徴": 1, "狂": 1, "態": 1, "廊": 1, "才": 1, "菌": 1, "桑": 0, "返": 1, "南": 1, "闘": 1, "散": 1, "霧": 0, "八": 1, "称": 1, "荷": 0, "使": 1, "刀": 1, "各": 1, "芋": 0, "褒": 1, "化": 1, "採": 1, "瀬": 0, "箱": 0, "茶": 1, "格": 1, "沿": 1, "病": 1, "壇": 1, "筆": 1, "詐": 1, "握": 1, "日": 1, "武": 1, "蟹": 0, "銀": 1, "肌": 0, "墜": 1, "寄": 1, "撤": 1, "輩": 1, "催": 1, "鬱": 1, "帳": 1, "十": 1, "密": 1, "手": 0, "緊": 1, "背": 1, "角": 1, "取": 0, "静": 1, "祝": 1, "拠": 1, "六": 1, "平": 1, "絵": 1, "鳴": 0, "職": 1, "書": 1, "楽": 1, "尊": 1, "明": 1, "冗": 1, "隙": 0, "夜": 1, "覧": 1, "炭": 1, "塔": 1, "徳": 1, "砲": 1, "携": 1, "遂": 1, "婆": 1, "届": 0, "族": 1, "虎": 0, "法": 1, "拡": 1, "試": 1, "剛": 1, "叫": 1, "豪": 1, "公": 1, "製": 1, "湾": 1, "善": 1, "笛": 1, "温": 1, "猫": 0, "冬": 0, "唯": 1, "皮": 0, "囲": 1, "鶴": 0, "奇": 1, "敏": 1, "体": 1, "棒": 1, "藤": 0, "白": 1, "質": 1, "目": 0, "飲": 0, "練": 1, "虹": 0, "死": 1, "融": 1, "写": 1, "患": 1, "接": 1, "瞭": 1, "犯": 1, "綱": 0, "墳": 1, "治": 1, "丼": 1, "調": 1, "坂": 0, "鉄": 1, "姉": 1, "慎": 1, "盗": 1, "博": 1, "神": 1, "表": 1, "短": 1, "煮": 0, "己": 1, "署": 1, "穴": 0, "追": 0, "逃": 1, "垂": 1, "包": 1, "変": 1, "服": 1, "憎": 1, "傘": 0, "厚": 0, "府": 1, "枢": 1, "片": 0, "梨": 0, "含": 1, "哀": 1, "祉": 1, "術": 1, "煙": 1, "副": 1, "統": 1, "峰": 1, "腹": 0, "胸": 0, "乾": 1, "銅": 1, "将": 1, "誕": 1, "備": 1, "実": 1, "喫": 1, "訪": 1, "逮": 1, "細": 0, "似": 1, "殿": 1, "品": 1, "燃": 1, "療": 1, "獄": 1, "祈": 1, "蛍": 0, "描": 1, "察": 1, "類": 1, "臣": 1, "若": 0, "可": 1, "干": 1, "添": 1, "軽": 0, "門": 1, "厄": 1, "民": 1, "互": 1, "候": 1, "紛": 1, "帝": 1, "瞬": 1, "就": 1, "宴": 1, "活": 1, "込": 0, "元": 1, "評": 1, "比": 1, "応": 1, "慣": 1, "山": 1, "女": 1, "懸": 1, "銃": 1, "内": 1, "安": 1, "養": 1, "誓": 1, "四": 0, "墟": 1, "映": 1, "貧": 1, "献": 1, "帰": 0, "破": 1, "戸": 0, "築": 1, "近": 1, "党": 1, "川": 0, "食": 1, "繰": 0, "任": 1, "省": 1, "刃": 0, "還": 1, "妊": 1, "休": 1, "源": 1, "訓": 1, "団": 1, "銘": 1, "親": 1, "弱": 1, "網": 1, "架": 1, "芸": 1, "主": 1, "沼": 0, "充": 1, "等": 1, "勘": 1, "条": 1, "既": 1, "歩": 1, "灯": 1, "影": 1, "購": 1, "需": 1, "億": 1, "亀": 0, "舎": 1, "通": 1, "肥": 1, "並": 1, "株": 0, "害": 1, "下": 1, "着": 0, "熊": 0, "兄": 0, "塊": 0, "操": 1, "滑": 1, "佐": 1, "裕": 1, "癖": 0, "狙": 1, "単": 1, "租": 1, "抽": 1, "彰": 1, "奴": 1, "晶": 1, "壁": 0, "々": 0, "守": 1, "損": 1, "意": 1, "枠": 0, "急": 1, "権": 1, "売": 0, "借": 1, "船": 1, "肺": 1, "始": 0, "千": 1, "遅": 1, "壊": 1, "歓": 1, "牙": 1, "僚": 1, "恥": 0, "詩": 1, "敷": 1, "批": 1, "汽": 1, "西": 1, "諾": 1, "禁": 1, "堀": 0, "待": 0, "縄": 1, "劇": 1, "閉": 1, "合": 0, "袋": 0, "霊": 1, "耐": 1, "枕": 0, "昔": 0, "外": 1, "継": 1, "鮮": 1, "未": 1, "熱": 1, "録": 1, "永": 1, "伺": 0, "放": 1, "私": 1, "塀": 1, "魂": 0, "必": 1, "谷": 0, "勇": 1, "兆": 1, "棋": 1, "坊": 1, "母": 0, "仏": 1, "恐": 1, "荒": 0, "祖": 1, "盟": 1, "泣": 0, "止": 1, "早": 1, "士": 1, "灰": 0, "獲": 1, "替": 0, "庄": 1, "切": 1, "円": 1, "誌": 1, "踏": 1, "排": 1, "首": 0, "紙": 0, "粘": 1, "交": 1, "慰": 1, "帯": 1, "貸": 0, "辺": 1, "押": 0, "黄": 0, "則": 1, "乏": 1, "令": 1, "差": 1, "共": 1, "味": 1, "史": 1, "直": 1, "俺": 0, "碁": 1, "率": 1, "逆": 1, "見": 0, "認": 1, "戒": 1, "宗": 1, "趣": 1, "控": 0, "第": 1, "油": 1, "芽": 0, "磁": 1, "穂": 1, "構": 1, "歌": 1, "惑": 1, "腐": 1, "勝": 1, "費": 1, "域": 1, "以": 1, "潤": 1, "姫": 0, "割": 0, "靴": 0, "浸": 1, "径": 1, "吉": 1, "隊": 1, "漏": 1, "初": 1, "真": 1, "校": 1, "雰": 1, "夫": 1, "週": 1, "申": 0, "土": 1, "人": 1, "塁": 1, "秀": 1, "幅": 0, "益": 1, "住": 1, "懐": 0, "拒": 1, "柔": 1, "字": 1, "摩": 1, "旨": 1, "畳": 1, "護": 1, "板": 1, "広": 0, "射": 1, "伎": 1, "成": 1, "増": 1, "力": 1, "級": 1, "昨": 1, "到": 1, "琴": 0, "丸": 0, "廃": 1, "請": 1, "行": 1, "低": 1, "策": 1, "忙": 0, "騎": 1, "針": 0, "停": 1, "非": 1, "代": 1, "硬": 1, "置": 1, "叱": 0, "図": 1, "松": 0, "布": 1, "如": 1, "紅": 1, "植": 1, "氏": 1, "挑": 1, "易": 1, "続": 1, "次": 1, "誠": 1, "津": 0, "性": 1, "微": 1, "戻": 0, "橋": 0, "迎": 1, "塗": 1, "鉛": 1, "線": 1, "貼": 0, "穫": 1, "祭": 0, "危": 1, "渉": 1, "軸": 1, "突": 1, "砂": 1, "約": 1, "分": 1, "残": 1, "与": 1, "抑": 1, "怒": 1, "欠": 1, "万": 1, "戦": 1, "木": 1, "縮": 1, "励": 1, "瞳": 1, "進": 1, "伸": 0, "嫁": 1, "心": 1, "組": 1, "告": 1, "染": 1, "黙": 1, "泥": 1, "赤": 0, "艦": 1, "印": 1, "石": 0, "決": 1, "能": 1, "威": 1, "我": 1, "猛": 1, "生": 1, "模": 1, "闇": 0, "輝": 1, "頭": 0, "馬": 1, "政": 1, "節": 1, "居": 1, "提": 1, "忘": 1, "鍛": 1, "回": 1, "苦": 1, "晩": 1, "孫": 1, "鉱": 1, "台": 1, "墨": 0, "境": 1, "宅": 1, "皇": 1, "侍": 0, "店": 1, "崖": 1, "妙": 1, "領": 1, "阜": 1, "功": 1, "漢": 1, "憩": 1, "央": 1, "露": 1, "鈴": 1, "核": 1, "欺": 1, "昼": 0, "局": 1, "雇": 1, "商": 1, "半": 1, "願": 1, "魚": 1, "募": 1, "跡": 1, "池": 0, "恨": 1, "端": 1, "奮": 1, "頃": 0, "二": 1, "君": 1, "定": 1, "障": 1, "負": 1, "誤": 1, "薦": 1, "措": 1, "娯": 1, "由": 1, "環": 1, "労": 1, "殺": 1, "房": 1, "魅": 1, "光": 1, "烈": 1, "及": 1, "位": 1, "軌": 1, "救": 1, "捕": 1, "衣": 1, "卵": 0, "裸": 1, "承": 1, "紀": 1, "妃": 1, "市": 1, "理": 1, "炉": 1, "刊": 1, "躍": 1, "投": 0, "得": 1, "項": 1, "稚": 1, "霜": 0, "原": 1, "財": 1, "肩": 0, "隆": 1, "庭": 1, "田": 0, "防": 1, "診": 1, "先": 1, "削": 1, "軍": 1, "臓": 1, "志": 1, "痛": 1, "驚": 1, "泡": 1, "解": 1, "異": 1, "却": 1, "迷": 1, "封": 1, "震": 1, "倉": 1, "洋": 1, "不": 1, "斐": 1, "紫": 1, "席": 1, "根": 1, "攻": 1, "挿": 1, "両": 1, "範": 1, "均": 1, "沢": 1, "払": 0, "糖": 1, "秘": 1, "象": 1, "転": 1, "擦": 1, "恩": 1, "臨": 1, "壮": 1, "雲": 0, "創": 1, "征": 1, "禅": 1, "玉": 0, "刈": 0, "事": 1, "謎": 0, "宙": 1, "娘": 0, "際": 1, "多": 1, "価": 1, "庫": 1, "維": 1, "遜": 1, "甲": 1, "買": 0, "施": 1, "終": 1, "駅": 1, "版": 1, "滋": 1, "溶": 1, "裏": 0, "拓": 1, "盛": 1, "信": 1, "飯": 1, "陰": 1, "側": 0, "弁": 1, "渋": 1, "冊": 1, "悔": 1, "速": 1, "駄": 1, "師": 1, "盆": 1, "宮": 0, "疲": 1, "氷": 0, "毎": 1, "村": 0, "打": 0, "腕": 0, "高": 1, "陛": 1, "自": 1, "寮": 1, "困": 0, "兵": 1, "諸": 1, "疫": 1, "庁": 1, "専": 1, "嘆": 1, "例": 1, "規": 1, "討": 1, "暑": 0, "熟": 1, "亡": 1, "漠": 1, "怪": 1, "種": 1, "地": 1, "厳": 1, "債": 1, "症": 1, "勉": 1, "午": 1, "遊": 0, "材": 1, "菓": 1, "賢": 1, "存": 1, "矛": 1, "畜": 1, "旧": 1, "捨": 0, "快": 1, "右": 0, "郵": 1, "混": 1, "査": 1, "縁": 1, "往": 1, "堅": 0, "唇": 0, "皆": 0, "炊": 1, "析": 1, "官": 1, "喜": 0, "償": 1, "渡": 0, "貢": 1, "暦": 1, "推": 1, "悪": 1, "咲": 0, "奈": 1, "樹": 1, "落": 1, "繁": 1, "海": 1, "集": 1, "又": 0, "正": 1, "波": 1, "結": 1, "彫": 1, "即": 1, "哲": 1, "偵": 1, "起": 0, "件": 1, "拾": 0, "魔": 1};
var kana = {"め": "メ", "む": "ム", "ゃ": "ャ", "も": "モ", "ゅ": "ュ", "や": "ヤ", "ょ": "ョ", "ゆ": "ユ", "ら": "ラ", "よ": "ヨ", "る": "ル", "り": "リ", "ろ": "ロ", "れ": "レ", "わ": "ワ", "ん": "ン", "を": "ヲ", "あ": "ア", "い": "イ", "う": "ウ", "え": "エ", "か": "カ", "お": "オ", "き": "キ", "が": "ガ", "く": "ク", "ぎ": "ギ", "け": "ケ", "ぐ": "グ", "こ": "コ", "げ": "ゲ", "さ": "サ", "ご": "ゴ", "し": "シ", "ざ": "ザ", "す": "ス", "じ": "ジ", "せ": "セ", "ず": "ズ", "そ": "ソ", "ぜ": "ゼ", "た": "タ", "ぞ": "ゾ", "ち": "チ", "だ": "ダ", "っ": "ッ", "ぢ": "ジ", "づ": "ズ", "つ": "ツ", "で": "デ", "て": "テ", "ど": "ド", "と": "ト", "に": "ニ", "な": "ナ", "ね": "ネ", "ぬ": "ヌ", "は": "ハ", "の": "ノ", "ぱ": "パ", "ば": "バ", "び": "ビ", "ひ": "ヒ", "ふ": "フ", "ぴ": "ピ", "ぷ": "プ", "ぶ": "ブ", "べ": "ベ", "へ": "ヘ", "ほ": "ホ", "ぺ": "ペ", "ぽ": "ポ", "ぼ": "ボ", "み": "ミ", "ま": "マ"};


if (/\/lattice\//.test(document.URL)) //lattice
{
    function DealWithLatticeLater(Node)
    {
        Node.each(DealWithKanji);

        function DealWithKanji()
        {
            if (IsOnyomi($(this).text()))
            {
                $(this).attr('data-original-title', ConvertChain($(this).attr('data-original-title')));
            }
        }
    }

    waitForKeyElements(".lattice-single-character a[data-original-title]", DealWithLatticeLater, false);

}
else if (/\/kanji\//.test(document.URL)) //kanji info pages
{

    function findOnyomi()
    {
        if ($(this).children('h3').text() == "On'yomi")
        {
            $(this).children('p').text(ConvertChain($(this).children('p').text()));
        }
    }
    $('.span6').each(findOnyomi);

}
else if (/review/.test(document.URL)) //reviews
{
    waitForKeyElements("li[class=kanji]", WhenKanjiOnReviewSummary, false);
    function WhenKanjiOnReviewSummary(Node)
    {
        if (IsOnyomi(Node.children("a").text()) )
        {
            Node.attr("data-ja", ConvertChain(Node.attr("data-ja") ) );
        }
    }

    function WhenAnswer(Node)
    {
        if (Node.children('h2').text() == "Important Readings (onyomi)")
        {
            Node.text(ConvertChain(Node.contents(':not(h2)').text()));
            Node.prepend("<h2>Important Readings (onyomi)<\/h2>");
        }
    }

    function WhenLookingForAnswer()
    {
        waitForKeyElements("#item-info-reading", WhenAnswer, false);
    }
    $('#option-item-info').click(WhenLookingForAnswer);
    $(document).keydown(function (key)
    {
        var letter = key.which || key.keyCode;
        if (letter == 70)
        {
            WhenLookingForAnswer();
        }
    });

}
else if (/\/radicals\//.test(document.URL) || /\/vocabulary\//.test(document.URL)) //radical and vocabulary pages
{
    function DealWithKanji()
    {
        if (IsOnyomi($(this).children('.character').text()))
        {
            $(this).find('li').eq(0).text(ConvertChain($(this).find('li').eq(0).text()));
        }
    }
    $('.single-character-grid').eq(0).find('a').each(DealWithKanji);
}
else if (/\/level\//.test(document.URL)) //level page
{
    function DealWithKanji()
    {
        if (IsOnyomi($(this).children('.character').text()))
        {
            $(this).find('li').eq(0).text(ConvertChain($(this).find('li').eq(0).text()));
        }
    }
    $('.single-character-grid').eq(1).find('a').each(DealWithKanji);
}
else if (/dashboard/.test(document.URL) || document.URL == "http://www.wanikani.com/") //Homepage
{

    function DealWithDashboardLater(Node)
    {
        Node.each(DealWithKanji)

        function DealWithKanji()
        {
            if (IsOnyomi($(this).text()))
            {
                $(this).attr('data-original-title', ConvertChain($(this).attr('data-original-title')));
            }
        }
    }

    waitForKeyElements(".kanji-progress a[data-original-title]", DealWithDashboardLater, false);



}
else if (/\/kanji\?difficult/.test(document.URL) || document.URL == "http://www.wanikani.com/kanji") //big kanji pages
{


    function DealWithLevel()
    {
        $(this).find('.character-item').each(DealWithKanji);
    }

    function DealWithKanji()
    {
        if (IsOnyomi($(this).find('.character').text()))
        {
            $(this).find('li').eq(0).text(ConvertChain($(this).find('li').eq(0).text()));
        }
    }

    $('.single-character-grid').each(DealWithLevel);

}
else if (/\/lesson/.test(document.URL)) //lesson
{

//Test part of lessons---------------------------------

    function WhenAnswerInLessonTest(Node)
    {
        if (Node.children('h2').text() == "Important Readings (onyomi)")
        {
            Node.text(ConvertChain(Node.contents(':not(h2)').text()));
            Node.prepend("<h2>Important Readings (onyomi)<\/h2>");
        }
    }

    function WhenLookingForAnswerInLessonTest()
    {
        if($("#quiz").attr("style") != "display: None;")
        {
            waitForKeyElements("#item-info-reading", WhenAnswerInLessonTest, false);
        }
    }

    $('#option-item-info').click(WhenLookingForAnswerInLessonTest);
    $(document).keydown(function (key)
    {
        var letter = key.which || key.keyCode;
        if (letter == 70)
        {
            WhenLookingForAnswerInLessonTest();
        }
    });
//----------------------------------------------------------

//Lesson part ----------------------------------------------
    function WhenLessonSlides()
    {
        if($("#lesson").attr("style") != "display: None;")
        {
            Node = $("#supplement-kan-reading-type");
            if(Node.text() == "onyomi")
            {
                var reading = Node.closest("div").children("div")
                reading.text(ConvertChain(reading.text()));
            }
        }
    }

    $('#batch-items').click(WhenLessonSlides);
    $(document).keydown(function (key)
    {
        var letter = key.which || key.keyCode;
        if (letter == 87 || letter == 68 || letter == 37 || letter == 39 || letter == 13)
        {
            WhenLessonSlides();
        }
    });
//-----------------------------------------------------------------
}
else
{}



function IsOnyomi(kanji)
{
    return KanjiList[kanji];
}

function ConvertChain(chain)
{
    chain = chain.trim()
    for (var i = 0, c = chain.length; i < c; i++)
    {
        chain = replaceAt(chain, i, kana[chain[i]] || chain[i]);
    }
    return chain;
}

function replaceAt(s, n, t)
{
    return s.substring(0, n) + t + s.substring(n + 1);
}



/*--- waitForKeyElements():  A utility function, for Greasemonkey scripts,
    that detects and handles AJAXed content.

    Usage example:

        waitForKeyElements (
            "div.comments"
            , commentCallbackFunction
        );

        //--- Page-specific function to do what we want when the node is found.
        function commentCallbackFunction (jNode) {
            jNode.text ("This comment changed by waitForKeyElements().");
        }

    IMPORTANT: This function requires your script to have loaded jQuery.
*/

function waitForKeyElements(
    selectorTxt,
/* Required: The jQuery selector string that
                        specifies the desired element(s).
                    */
actionFunction,
/* Required: The code to run when elements are
                        found. It is passed a jNode to the matched
                        element.
                    */
bWaitOnce,
/* Optional: If false, will continue to scan for
                        new elements even after the first match is
                        found.
                    */
iframeSelector
/* Optional: If set, identifies the iframe to
                        search.
                    */
)
{
    var targetNodes, btargetsFound;

    if (typeof iframeSelector == "undefined")
        targetNodes = $(selectorTxt);
    else
        targetNodes = $(iframeSelector).contents()
            .find(selectorTxt);

    if (targetNodes && targetNodes.length > 0)
    {
        btargetsFound = true;
        /*--- Found target node(s).  Go through each and act if they
            are new.
        */
        targetNodes.each(function ()
        {
            var jThis = $(this);
            var alreadyFound = jThis.data('alreadyFound') || false;

            if (!alreadyFound)
            {
                //--- Call the payload function.
                var cancelFound = actionFunction(jThis);
                if (cancelFound)
                    btargetsFound = false;
                else
                    jThis.data('alreadyFound', true);
            }
        });
    }
    else
    {
        btargetsFound = false;
    }

    //--- Get the timer-control variable for this selector.
    var controlObj = waitForKeyElements.controlObj ||
    {};
    var controlKey = selectorTxt.replace(/[^\w]/g, "_");
    var timeControl = controlObj[controlKey];

    //--- Now set or clear the timer as appropriate.
    if (btargetsFound && bWaitOnce && timeControl)
    {
        //--- The only condition where we need to clear the timer.
        clearInterval(timeControl);
        delete controlObj[controlKey]
    }
    else
    {
        //--- Set a timer, if needed.
        if (!timeControl)
        {
            timeControl = setInterval(function ()
            {
                waitForKeyElements(selectorTxt,
                    actionFunction,
                    bWaitOnce,
                    iframeSelector);
            },
                300);
            controlObj[controlKey] = timeControl;
        }
    }
    waitForKeyElements.controlObj = controlObj;
}
