// ==UserScript==
// @name           Virtonomica: Заполнение склада
// @namespace      virtonomica
// @description    Помощник по заполнению склада
// @include	   http://*virtonomic*.*/*/main/unit/view/*
// @version        1.2
// ==/UserScript==

var run = function() 
{
//----------------------------------------------------------------
    	var win = (typeof(unsafeWindow) != 'undefined' ? unsafeWindow : top.window);
    	$ = win.$;
	
	
	var a1=$('div.officePlace').text().trim()
	var a2=a1.slice(0,5)

	if(a2 != "Склад") return; // Выход если не склад

	var a3=(location.href).slice(-3)
	  if (isNaN(a3)) return //Выход если не главная страница

	if (a1.indexOf("Офис") == -1 ) return; //Выход если главная страница не нашей компании


//arr_sklkof - массив складских коэффициентов для всех продуктов шт./ на 1000кв.м
var arr_sklkof={"Алмазы":1500,"Марганец":50000,"Медный колчедан":50000,"Титановая руда":25000,"Хром":20000,"Бокситы":20000,"Глина":250000,"Древесина":20000,"Железная руда":50000,"Золото":10000,"Кремний":100000,"Нефть":70000,"Природные минералы":200000,
"Уголь":100000,"Авиадвигатель":10,"Авиашасси":4,"Авионика":4,
"Автозапчасти":10000,"Зеркальный лист":10000,"Интерьер самолета":2.7,"Картон":100000,
"Корпус яхты":4,"Косметическое масло":50000,"Медь":25000,"Натуральные лекарственные компоненты":50000,"Оснащение яхты":10,"Отходы хлопчатника":10000000,"Рыболовная сеть":4000,"Сверхлёгкий алюминиевый сплав":33333,"Секция фюзеляжа":0.8,"Синтетические лекарственные компоненты":50000,"Термоэлемент":35000,"Титан":12500,"Углепластик":7000,"Упаковка":100000,"Хлопковая ткань":10000,"Хлопковое волокно":1000000,"Электропривод":5000,"Элементы авиакрыла":0.5,"Элементы авиаоперения":0.8,"Алюминий":8500,"Бумага":100000,"Двигатель":1000,"Кожа":20000,
"Комплектующие":10000,"Краска":7000,"Пластмасса":7000,"Резина":16000,"Синтетическая ткань":35000,"Сталь":20000,"Стекло":15000,"Ткань":100000,"Химикаты":35000,"Шерсть":35000,
"Электронные компоненты":1500,"Картофель":250000,
"Комбикорм":100000,"Кормовые культуры":1000000,"Кофе":333333,"Оливки":250000,"Подсолнечник":250000,
"Помидоры":200000,"Рыбная мука":100000,"Цветы и эфиромасличные культуры":100000,"Зерно":500000,"Какао":100000,"Молоко":70000,"Мясо":12500,"Сахар":500000,
"Фрукты":200000,"Хлопок":1000000,"Яйца":70000,"Консервированные оливки":50000,
"Красная икра":50000,"Ликер":50000,"Масло":100000,"Натуральный кофе":33333,
"Оливковое масло":25000,"Продукты быстрого приготовления":100000,"Растворимый кофе":33333,"Рыбные деликатесы":33333,"Рыбные консервы":50000,"Соусы":100000,"Сыр":100000,"Черная икра":50000,"Чипсы":100000,"Энергетические напитки":100000,"Колбасные изделия":100000,"Кондитерские изделия":100000,"Макаронные изделия":200000,
"Молочные продукты":100000,"Мороженое":1000000,"Мука":125000,"Пиво":100000,
'Газировка "Би кул"':100000,"Прохладительные напитки":100000,"Сок":200000,"Спиртные напитки":50000,"Хлеб":350000,"Шоколад":100000,"Конфеты":120000,"Консервы":50000,
"Бронзовый декор":100,"Верхняя одежда":2000,"Внедорожник":
66.7,"Жемчужные украшения":400,"Зеркало":4000,"Зонт":5000,"Кожгалантерея":40000,
"Кондиционер":1000,"Косметика":50000,"Кофе-машина":1000,"Кухонная мебель":400,
"Кухонные плиты":1000,"Мебель":400,"Моторное масло":5000,"Нижнее белье":4000,"Подарки и Сувениры":100000,"Посудомоечные машины":1000,"Пылесос":1000,"Седан":100,"Спорт-кар":83.3,"Столовое и постельное бельё":4000,"Сумки и портфели":40000,"Тренажер":500,"Утюг":3500,"Фен":5000,"Электроинструмент":3333,"Автомобиль":100,"Холодильники":1000,"Бытовая химия":150000,"Аудиотехника":1000,"Велосипед":5000,"Игрушки":100000,"Компьютер":500,"Спальная мебель":2000,"Мобильный телефон":3500,"Мотоцикл":150,"Обувь":5000,"Одежда":5000,"Посуда":10000,"Пресса":1000000,
"Фототехника":3500,"Часы":10000,"Шины":2000,"Бижутерия":10000,"Бриллианты":400,"Ювелирные украшения":400,"GPS-навигаторы":3500,"Канцтовары":70000,"Стиральные машины":1000,"Телевизоры":1000,
"Сантехника":4000,"Душевые кабинки":2500,"Книги":100000,"Гормональные препараты":50000,"Лекарственные травы":50000,"Медицинский инструментарий":10000,"Природные лекарства":50000,"Синтетические лекарства":50000,"Средства гигиены":50000,"Горно-шахтное оборудование":500,"Медицинское оборудование":100,"Парикмахерское оборудование":100,
"Паровая турбина":1,"Паровой котёл":1,"Пилорама":500,"Ресторанное оборудование":100,"Рыболовецкий траулер":1,
"Теплообменное оборудование":2,"Угольная мельница":1,"Угольный энергоблок":0.2,"Узкофюзеляжный самолет":0.04,"Прибор":100,"Станок":500,"Трактор":80,"Жемчуг":5000,"Крабы":50000,"Лосось":33333,"Осетр":20000,"Промысловая рыба":20000,"Устрицы":50000,"Арт декор":143,"Интерьер яхты":5,"Яхта":3.3,"Никотиновый пластырь":50000,"Табак":50000,"LED":1000,
"Специи":50000,"Сыр фета":50000,"Сигареты":50000,"Сигары":33333,"Джинсы":5000,"Консервированный корм для животных":2500,
"Деловая одежда":2000,"Сухой корм для животных":2000,"Смартфон":2000};

// -------------------------- определяем размер склада
	var valskl=$("table.infoblock td.title:eq(0)").next().text() 	
	valskl=parseInt(valskl)
// -------------------------------------------------------------------------------------------------
/// -------------------------- добавляем столбцы, расчитываем и выводим новое заполнение склада
	var r=0
	var sumproc=0 // суммарный процент заполнения
	$("table.grid tbody tr[class]").each( function(){
	  var nameprod=$("td:eq(0)",this).text()
	  var nowqual=$("td:eq(1)",this).text().trim().replace(' ', '').replace(' ', '').replace(' ', '').replace(' ', '')
	  var nowsale=$("td:eq(5)",this).text().trim().replace(' ', '').replace(' ', '').replace(' ', '').replace(' ', '')
	  var nowzak=$("td:eq(6)",this).text().trim().replace(' ', '').replace(' ', '').replace(' ', '').replace(' ', '')
	  var newqual=nowqual-nowsale
	  if (newqual<0) newqual=0
	   newqual=newqual+nowzak*1
	   var sklproc=Get_skl_procent(nameprod, valskl,newqual)
	   if (isNaN(sklproc)) {	// Если нет в базе, т.е. ТМ-ка, пробуем расчитать по складской процентовке, иначе считаем "0"
	     var nowproc=$("td:eq(9)",this).text()
	     nowproc=parseFloat(nowproc)*1
	     sklproc=0
	     if (nowproc!=0) {
	       sklproc=nowproc*newqual/nowqual
	     }
	   }
	   sklproc=sklproc.toFixed(2)
	   var tcolor = "green"
	   if (sklproc>50) tcolor="orange"
	   if (sklproc>200) tcolor="red"
	var txt = "<td style=color:"+tcolor+" style=text-align:right>"+sklproc+"%</td>";
	  if (r == 0) $(this).prev().append('<th>New %</th><th>')
	  r=r+1
	  sumproc=sumproc+sklproc*1
	  $(this).append(txt)
	})
// -------------------------- добавляем сведения о доставках на склад -----------------------------------
	var prod_name=[]
	var prod_qual=[]
	var new_url=location.href+"/delivery"
	var u=0
	var a=0
	var b=0

	$.get(new_url, function(data) {
	  $('#mainContent>table.list>tbody>tr[class]>td',data).each(function() {
          switch (u) { // Доставляемый товар и количество
	  case 0:
	    prod_name[a]=$(this,data).text().trim()
	    a=a+1
	    break;
	  case 1:
	    prod_qual[b]=$(this,data).text().trim().replace(' ', '').replace(' ', '').replace(' ', '').replace(' ', '')
	    b=b+1
	    break;
	  }

	    u=u+1
	  if (u==3) u=0
	});

	  if (u=0) valdos=0

	  var dossum=AfterLoad (valskl, prod_name, prod_qual)
	  sumproc=sumproc+dossum*1
	var tcolor2 = "green"
	   if (sumproc>50) tcolor2="orange"
	   if (sumproc>200) tcolor2="red"
	   sumproc=sumproc.toFixed(2)

	$("table.grid tbody").append("<tr><td><td><td><td><td><td><td><td><td><td>Итого:</td><td style=color:"+tcolor2+">"+sumproc+"%</td></tr>")
	});
//-------------------------------------------------------------------------------------------------------------
// -------------------------- расчет процента заполнения склада-------------------------------------------------
  function Get_skl_procent(np, vs,vp){
    if (vs<10) vs=vs*1000 // для миллионников
    var proc=vp*100/(arr_sklkof[np]*vs)
  return proc
  }
// -------------------------- расчет процента доставки на склад-------------------------------------------------------
  function AfterLoad (vs, p_n, p_q){
    var sp=0
      for (var y=0; y<p_n.length; y++) {
	var np=p_n[y]
	var vp=p_q[y]
	var dosproc=Get_skl_procent (np, vs, vp)
      var tcolor3 = "green"
      if (dosproc>50) tcolor3="orange"
      if (dosproc>200) tcolor3="red"
      dosproc=dosproc.toFixed(2)
      $("table.grid tbody").append("<tr style='BACKGROUND-COLOR : #d0f0c0'><td>"+np+"<td><td><td><td><td><td><td><td><td>Доставка :</td><td style=color:"+tcolor3+">"+dosproc+"%</td></tr>")
      sp=sp+dosproc*1
      }
      tcolor3 = "green"
      if (sp>50) tcolor3="orange"
      if (sp>200) tcolor3="red"
      
      $("table.grid tbody").append("<tr><td><td><td><td><td><td><td><td><td><td>Доставка всего:</td><td style=color:"+tcolor3+">"+sp+"%</td></tr>")
      return sp
  }

}

var script = document.createElement("script");
script.textContent = '(' + run.toString() + ')();';
document.documentElement.appendChild(script);
